{
  "summary": "An overlap was identified between the EBA Guidelines on loan origination and the Basel Framework concerning the criteria for assessing project finance exposures. Both texts provide specific and similar requirements for institutions regarding the evaluation of revenue sources (such as take-or-pay contracts) and security arrangements (pledging of assets and control over the project entity). While the EBA text frames these as elements for a creditworthiness assessment and the Basel text as conditions for a 'high quality' classification, they govern the same regulatory subject and impose nearly identical substantive checks on the financial institution.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_49.json",
      "excerpt1": "Institutions should assess the primary source of repayment of the loan, which is the income generated by the assets (project) being financed. Institutions should assess the cash flow associated with the project, including future income-producing capacity once the project is completed, taking into account any applicable regulatory or legal restriction (e.g. price regulation, rate-of-return regulation, revenues being subject to take-or-pay contracts... As far as possible, institutions should ensure that all the assets of the project and the present and future cash flow and accounts are pledged to the institution... If a special purpose vehicle is established for the project, the shares in that special purpose vehicle should be pledged to the institution, to enable the institution/agent to take possession of the company if needed.",
      "pageNumber1": 49,
      "filename2": "BaselFramework.di_page_220.json",
      "excerpt2": "The following conditions must also be met: (3) The revenues are availability-based or subject to a rate-of-return regulation or take-or-pay contract; ... (7) All assets and contracts necessary to operate the project have been pledged to the creditors to the extent permitted by applicable law; and (8) Creditors may assume control of the project finance entity in case of its default.",
      "pageNumber2": 220,
      "explanation": "Both texts regulate the criteria for the assessment of project finance exposures by financial institutions. The EBA Guideline requires institutions to assess specific features as part of the creditworthiness assessment, while the Basel Framework lists conditions that must be met for an exposure to be deemed 'high quality'. The substantive criteria are the same: both highlight the importance of revenues being secured by mechanisms like take-or-pay contracts, the necessity of pledging all project assets to creditors, and the ability for creditors to take control of the project entity upon default. This constitutes a true overlap as they govern the same regulatory subject (assessment of project finance) for the same actor (lending institutions) with almost identical requirements.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}