{
  "summary": "One overlap was identified between the EBA Guidelines on loan origination and the Basel Framework. Both documents require institutions to assess the repayment capacity for loans that are materially dependent on cash flows from the underlying property. The EBA Guideline provides more specific details on how this assessment should be conducted, such as analyzing future rental income and running sensitivity analyses on vacancy rates and rental prices, which aligns with and further specifies the high-level principle in the Basel Framework that requires appropriate underwriting policies including relevant metrics like occupancy rates.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_37.json",
      "excerpt1": "For loan agreements that relate to an immovable property that explicitly state that the immovable property is not to be occupied as a place of residence by the borrower or a family member (i.e. buy-to-let agreements), institutions should assess the relationship between the future rental income from the immovable property and the borrower's ability to meet obligations.",
      "pageNumber1": 37,
      "filename2": "BaselFramework.di_page_231.json",
      "excerpt2": "Underwriting policies must also be appropriate when the repayment of the mortgage loan depends materially on the cash flows generated by the property, including relevant metrics (such as an occupancy rate of the property).",
      "pageNumber2": 231,
      "explanation": "Both texts regulate the underwriting process for loans where repayment depends on cash flows from the property. They apply to the same actors (institutions/banks) and concern the same regulatory action (assessment of the borrower's ability to repay). The EBA Guideline requires an assessment of future rental income in relation to the borrower's obligations, while the Basel Framework requires underwriting policies to be appropriate for such loans and include relevant metrics like occupancy rates. The EBA's requirement is a specific implementation of the broader principle set out by the Basel Framework, creating a direct overlap.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}