{
  "summary": "The documents overlap in their requirements for credit institutions when calculating Expected Credit Losses (ECL). Both texts mandate that institutions use forward-looking information, including macroeconomic factors, in their assessment. They also both provide for the use of collective assessment methods for groups of exposures that share similar credit risk characteristics, as an alternative to individual assessment.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_30.json",
      "excerpt1": "When assessing the adequacy of the allowances credit institutions should take into account relevant factors and expectations at the reporting date that may affect the collectability of remaining cash flows over the life of a group of lending exposures or a single lending exposure. Credit institutions should consider information which goes beyond historical and current data, and take into account reasonable and supportable forward-looking information, including macroeconomic factors, that are relevant to the exposure(s) being evaluated (for example retail or wholesale) in accordance with the applicable accounting framework. Depending on the ability to incorporate forward-looking information into the ECL estimate, credit institutions may use individual or collective assessment approaches... For example, collective assessment is often used for large groups of homogeneous lending exposures with shared credit risk characteristics, such as retail portfolios.",
      "pageNumber1": 30,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_624.json",
      "excerpt2": "Consequently when reasonable and supportable information that is more forward-looking than past due information is available without undue cost or effort, it must be used to assess changes in credit risk. ... In some circumstances an entity does not have reasonable and supportable information that is available without undue cost or effort to measure lifetime expected credit losses on an individual instrument basis. In that case, lifetime expected credit losses shall be recognised on a collective basis that considers comprehensive credit risk information. This comprehensive credit risk information must incorporate not only past due information but also all relevant credit information, including forward-looking macroeconomic information... an entity can group financial instruments on the basis of shared credit risk characteristics...",
      "pageNumber2": 624,
      "explanation": "Both texts regulate the methodology for calculating Expected Credit Losses (ECL) for credit institutions. They establish overlapping requirements concerning the use of assessment methods and information types. Both mandate the use of 'reasonable and supportable forward-looking information' (including macroeconomic factors) and permit the use of 'collective assessment approaches' for groups of exposures with 'shared credit risk characteristics'.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}