{
  "summary": "One overlap was identified between the two documents regarding the indicators used for assessing a significant increase in credit risk under IFRS 9. The EBA Guidelines provide specific interpretation on factors, such as changes in the probability of default (PD) and intensified monitoring, which are also listed as relevant indicators in the IFRS 9 framework. Both texts govern the same regulatory subject for the same type of actor (credit institutions) within the same functional context (accounting for expected credit losses).",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_84.json",
      "excerpt1": "Regarding the use of the absolute change in the PD when assessing significant increase of credit risk, the EBA acknowledges that IFRS 9 is a relative model (increase in the risk of default occurring since initial recognition). However, when assessing whether or not a significant increase in credit risk has occurred, relevant facts and circumstances should be taken into account, including the absolute change in PD. The EBA believes that the guidelines are sufficiently clear in this regard and consistent with BCBS guidance and would not prevent a credit institution from meeting the impairment requirements of IFRS 9. Paragraph 113 refers to the case of intensifying the monitoring of exposures as an example of an indicator of significant increase of credit risk and therefore it should not be considered automatically as a trigger for significant increase of credit risk.",
      "pageNumber1": 84,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_627.json",
      "excerpt2": "(d) an actual or expected significant change in the financial instrument's external credit rating.\n(e) an actual or expected internal credit rating downgrade for the borrower or decrease in behavioural scoring used to assess credit risk internally. Internal credit ratings and internal behavioural scoring are more reliable when they are mapped to external ratings or supported by default studies.\n(f) existing or forecast adverse changes in business, financial or economic conditions that are expected to cause a significant change in the borrower's ability to meet its debt obligations, such as an actual or expected increase in interest rates or an actual or expected significant increase in unemployment rates.",
      "pageNumber2": 627,
      "explanation": "Both documents address the same regulatory subject: the indicators used to assess a significant increase in credit risk for financial instruments under the IFRS 9 accounting framework. The EBA Guideline clarifies that factors such as the 'absolute change in the PD' (Probability of Default) and 'intensifying the monitoring of exposures' are relevant indicators. The IFRS 9 text provides a non-exhaustive list of relevant information for this assessment, including '(e) an actual or expected internal credit rating downgrade for the borrower', which directly relates to changes in PD. A related section in the same IFRS document also lists changes in credit management approach, such as becoming 'more closely monitored', as an indicator. The EBA text provides specific guidance that aligns with and elaborates on the principles and examples set out in the IFRS framework.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}