{
  "summary": "One overlap was identified where a Finnish Financial Supervisory Authority regulation explicitly incorporates by reference a specific paragraph from the EBA Guidelines on accounting for expected credit losses. The Finnish regulation mandates that supervised entities must consider the same inherent risk factors in credit pricing as those listed in the EBA Guidelines as being indicative of inadequate estimates of Expected Credit Losses (ECL). Both texts apply to credit institutions and address the consideration of specific risk indicators in the context of credit risk management and pricing. No contradictions were found as other provided texts regulate different subjects, such as loan origination, management of non-performing exposures, or supervisory review procedures, and do not govern the same specific regulatory action.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_26.json",
      "excerpt1": "Senior management should be able to demonstrate that it understands and appropriately considers inherent risks when pricing lending exposures. Credit institutions should take particular care of the following fact patterns, which are potentially indicative of inadequate estimates of ECL: a. the granting of credit to borrowers based on fragile income streams (that could become non- recurrent upon a downturn) or with no documentation or limited verification of borrower income sources; b. high debt service requirements relative to the borrower's net available expected cash flows; c. flexible repayment schedules, including payment vacations, interest-only payments and negative amortisation features; d. for real estate and other asset based financing, lending of amounts equal to or exceeding the value of the financed property or otherwise failing to provide an adequate margin of collateral protection; e. undue increases in modifications of lending exposures due to financial difficulties faced by the borrower25 or renegotiations/modifications of lending exposures for other reasons (such as competitive pressures faced by credit institutions); f. circumvention of the classification and rating requirements, including rescheduling, refinancing or reclassification of lending exposures; g. undue increases in the volume of credit, especially in relation to the increase in the volume of credit by other lenders in the same market; and h. increasing volume and severity of past-due, low-quality and impaired credit.",
      "pageNumber1": 26,
      "filename2": "2018_04.m3_en.di_page_15.json",
      "excerpt2": "(26) Supervised entities must be able to demonstrate that they consider inherent risks appropriately in accordance with chapter 4.2.2, paragraph (40) of the guidelines referred to above in paragraph (24) in pricing credit contracts.",
      "pageNumber2": 15,
      "explanation": "The Finnish FSA regulation directly incorporates paragraph 40 of the EBA Guidelines (EBA/GL/2017/06) by reference. It requires supervised entities to demonstrate that they consider the same specified list of inherent risks in their credit pricing. The EBA Guideline requires credit institutions to consider this same list of fact patterns as indicative of inadequate ECL estimates and to consider these risks when pricing loans. Both texts apply to credit institutions and mandate consideration of the same specific risk indicators for the same purpose, creating a direct overlap.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}