{
  "summary": "Both documents define 'Project Finance' as a method of funding where the lender primarily relies on the revenues and cash flows generated by the project and its assets for repayment and security. They also align on the importance of collateral over the project's assets to secure the loan.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_49.json",
      "excerpt1": "Institutions should assess the primary source of repayment of the loan, which is the income generated by the assets (project) being financed. Institutions should assess the cash flow associated with the project, including future income-producing capacity once the project is completed, taking into account any applicable regulatory or legal restriction (e.g. price regulation, rate-of-return regulation, revenues being subject to take-or-pay contracts, environmental legislation and regulations affecting the profitability of a project).",
      "pageNumber1": 49,
      "filename2": "BaselFramework.di_page_295.json",
      "excerpt2": "PF is a method of funding in which the lender looks primarily to the revenues generated by a single project, both as the source of repayment and as security for the exposure. ... The consequence is that repayment depends primarily on the project's cash flow and on the collateral value of the project's assets.",
      "pageNumber2": 295,
      "explanation": "Both excerpts define Project Finance and state that institutions (lenders) should primarily assess the income/revenues and cash flows generated by the project's assets as the source of repayment and as security for the loan. This demonstrates a clear overlap in the core principle of assessing the repayment source for project finance.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_49.json",
      "excerpt1": "As far as possible, institutions should ensure that all the assets of the project and the present and future cash flow and accounts are pledged to the institution providing the lending or to the agent/underwriter in the case of a syndicated transaction/club deal. If a special purpose vehicle is established for the project, the shares in that special purpose vehicle should be pledged to the institution, to enable the institution/agent to take possession of the company if needed.",
      "pageNumber1": 49,
      "filename2": "BaselFramework.di_page_220.json",
      "excerpt2": "(7) All assets and contracts necessary to operate the project have been pledged to the creditors to the extent permitted by applicable law; and (8) Creditors may assume control of the project finance entity in case of its default.",
      "pageNumber2": 220,
      "explanation": "Both documents emphasize the importance of pledging project assets to creditors. The EBA GL requires institutions to ensure that 'all the assets of the project and the present and future cash flow and accounts are pledged'. The Basel Framework specifies that, for a high-quality project finance exposure, 'All assets and contracts necessary to operate the project have been pledged to the creditors to the extent permitted by applicable law'. Both also address the ability for creditors to take control (EBA GL: 'take possession of the company if needed'; Basel Framework: 'Creditors may assume control of the project finance entity in case of its default').",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_49.json",
      "excerpt1": "Institutions should ensure that the calculation of costs associated with the development, as provided by the borrower, includes contingencies for cost overruns. Such planned contingencies should be included in the credit limit or equity. Institutions should assess the level of cash reserves and liquidity profile of the borrower or equity investors to ensure that they have the capacity to fund unplanned contingencies for cost overruns and delays, if any, above the contingency sum.",
      "pageNumber1": 49,
      "filename2": "BaselFramework.di_page_220.json",
      "excerpt2": "(2) The project finance entity has sufficient reserve funds or other financial arrangements to cover the contingency funding and working capital requirements of the project;",
      "pageNumber2": 220,
      "explanation": "Both documents state that project finance entities (borrowers/equity investors) should maintain sufficient funds to cover contingencies and cost overruns. The EBA GL explicitly mentions 'contingencies for cost overruns' and assessing 'cash reserves and liquidity profile' for 'unplanned contingencies', while the Basel Framework refers to 'sufficient reserve funds or other financial arrangements to cover the contingency funding and working capital requirements'.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}