{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring detail requirements for an institution's data infrastructure to support credit risk management and the framework for credit decision-making, including delegated powers and staff expertise. The SREP Guidelines reinforce the importance of an adequate data infrastructure for credit risk management, aligning with the EBA Guidelines on loan origination and monitoring. The Basel Framework also outlines supervisory expectations for robust credit risk management processes, including well-defined criteria for approving new exposures, identifying approval authority based on size and complexity, and ongoing monitoring of credit risk, collateral, and covenants. These provisions show an overlap in the general requirement for robust credit risk management frameworks, data infrastructure, and documented credit decision-making processes.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_28.json",
      "excerpt1": "61. The data infrastructure should be detailed and sufficiently granular to capture specific loan-by- loan information, in particular actual credit-granting criteria applied at the point of origination, allowing data regarding the borrower to be linked with data regarding collateral, to support the effective monitoring of credit risk (see Section 8) and enable effective audit trailing, operational and credit performance and efficiency measurement, as well as the tracking of policy deviations, exceptions and overrides (including credit/transaction rating or scoring overrides).",
      "pageNumber1": 28,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_92.json",
      "excerpt2": "226. In this regard, competent authorities should consider whether the institutions have adequate data infrastructure that meets the requirements of the EBA Guidelines on loan origination and monitoring, and of the EBA Guidelines on management of non-performing and forborne exposures and whether analytical techniques are appropriate to enable the institution to adequately manage their credit risk, and to fulfil supervisory reporting requirements, and to detect, measure and regularly monitor the credit risk inherent in all on- and off-balance-sheet activities (where relevant at group level), in particular with regard to: a. the borrower/counterparty/transaction's credit risk and eligibility; b. credit exposures (irrespective of their nature) of borrowers and, where relevant, of groups of connected borrowers; c. guarantee and collateral coverage (including netting agreements) and eligibility of this coverage; d. ongoing compliance with the contractual terms and agreements (covenants); e. unauthorised overdrafts and conditions for reclassification of credit exposures; and f. relevant sources of credit concentration risk.",
      "pageNumber2": 92,
      "explanation": "Both excerpts address the same regulatory subject: the requirement for institutions to maintain an adequate and granular data infrastructure for credit risk management. Excerpt 1 from EBA GL 2020/06 specifies the characteristics of this data infrastructure, while Excerpt 2 from the SREP Guidelines explicitly states that competent authorities should assess whether institutions have an adequate data infrastructure that 'meets the requirements of the EBA Guidelines on loan origination and monitoring' and supports comprehensive credit risk monitoring.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_28.json",
      "excerpt1": "63. Institutions should establish a clear and well-documented credit decision-making framework that should set out a clear and sound structure for the credit decision-making responsibilities within an institution, including a description of the hierarchy of the credit decision-makers and their allocation within the institution's organisational and business structure and their reporting lines. 65. The credit decision-making framework should clearly articulate the decision-making powers and limitations of each decision-maker and of any automated models for credit decision- making purposes, in line with the criteria for such models set out in Section 4.3.4. These powers and limitations should account for the characteristics of the credit portfolio, including its concentration and diversification objectives, in relation to business lines, geographies, economic sectors and products, as well as credit limits and maximum exposures. Where relevant, institutions should set time limits for the delegated powers or the size of delegated approvals. 66. When delegating credit decision-making powers, including limits, to members of staff, institutions should consider the specificities of the credit facilities subject to this individual decision-making, including their size and complexity, and the types and risk profiles of borrowers. Institutions should also ensure that these staff members are adequately trained and hold relevant expertise and seniority in relation to the specific authority delegated to them.",
      "pageNumber1": 28,
      "filename2": "BaselFramework.di_page_1789.json",
      "excerpt2": "(3) The supervisor requires and regularly determines that such policies and processes establish an appropriate and properly controlled credit risk environment, including: (a) a well documented and effectively implemented strategy and sound policies and processes for assuming credit risk, without undue reliance on external credit assessments; (b) well defined criteria and policies and processes for: (i) approving new exposures (including prudent underwriting standards), and ensuring a thorough understanding of the risk profile and characteristics of the borrowers (and in the case of securitisation exposures all features of securitisation transactions)44 that would materially impact the performance of these exposures; (ii) renewing and refinancing existing exposures; and (iii) identifying the appropriate approval authority for the size and complexity of the exposures; (c) effective credit administration policies and processes, including: continued analysis of a borrower's ability and willingness to make all payments associated with the contractual arrangements (including reviews of the performance of underlying assets, eg for securitisation exposures or project finance); monitoring of documentation, legal covenants, contractual requirements, collateral and other forms of credit risk mitigation; and an appropriate exposure grading or classification system;",
      "pageNumber2": 1789,
      "explanation": "Both excerpts deal with the establishment and documentation of credit decision-making processes, including the allocation of responsibilities and delegation of powers. Excerpts 1 from EBA GL 2020/06 describe the need for a 'clear and well-documented credit decision-making framework' that articulates 'decision-making powers and limitations' and 'delegating credit decision-making powers, including limits'. Excerpt 2 from the Basel Framework requires 'well defined criteria and policies and processes for... identifying the appropriate approval authority for the size and complexity of the exposures'. Both emphasize clear processes and defined authority for credit decisions and their delegation, ensuring proper oversight and alignment with risk profiles.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}