{
  "summary": "The analysis reveals several overlaps concerning the requirements for institutions to monitor and manage credit risk, specifically regarding the aggregation of credit risk exposures, the identification of risk drivers, and data requirements. Multiple guidelines and regulations emphasize the need for robust data infrastructure, the ability to group exposures by shared characteristics, and the use of relevant risk parameters like Probability of Default (PD) and Loss Given Default (LGD) in credit risk assessment and monitoring. There are also overlaps regarding the necessity for institutions to use internal data, supplemented by external data, and to document their methodologies for risk parameter estimation. The importance of a sufficient number of obligor/facility grades to avoid undue concentrations and ensure meaningful risk differentiation is also a recurring theme.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_61.json",
      "excerpt1": "249. When monitoring credit risk, institutions should have appropriate methodologies and practices, allowing the aggregation of credit risk exposures in business lines, portfolios, sub- portfolios, products, industries and geographical segments, and support the identification of credit risk concentrations. Institutions should ensure that credit risk data and data infrastructure meet the following requirements: a. depth and breadth so that they cover all the significant risk factors - this should allow, inter alia, exposures to be grouped together in terms of shared credit risk characteristics, such as the institutional sector to which the borrower belongs, the purpose of the transaction and the geographical location of the borrower/collateral, so as to enable an aggregate analysis that allows the identification of the entity's exposure to these significant risk factors; b. accuracy, integrity, reliability and timeliness of data;",
      "pageNumber1": 61,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_263.json",
      "excerpt2": "(j) for all exposure classes specified in Article 147 and for each category of exposure to which the different correlations in Article 154 (1) to (4) correspond: (i) for the institutions using own LGD estimates for the calculation of risk-weighted exposure amounts, the exposure-weighted average LGD and PD in percentage for each relevant geographical location of credit exposures; (ii) for the institutions that do not use own LGD estimates, the exposure-weighted average PD in percentage for each relevant geographical location of credit exposures. For the purposes of point (j), the relevant geographical location of credit exposures means exposures in the Member States in which the institution has been authorised and Member States or third countries in which institutions carry out activities through a branch or a subsidiary.",
      "pageNumber2": 263,
      "explanation": "Both excerpts address the need for institutions to aggregate and report credit risk data by geographical location. The source emphasizes aggregation methodologies for identifying concentrations across geographical segments, while the target requires disclosure of exposure-weighted average LGD and PD for each relevant geographical location of credit exposures, indicating a requirement for such aggregation and analysis.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_61.json",
      "excerpt1": "248. As part of credit risk monitoring and reporting, institutions should identify the relevant drivers of its aggregate credit risk as well as the credit risk in its portfolios and sub-portfolios, taking into account macroeconomic (including demographic) factors and the fact that credit risk drivers may change over time. Credit risk drivers should be measured, analysed and monitored, and the credit risk management function should report regularly the outcome of the analysis to the management body.",
      "pageNumber1": 61,
      "filename2": "Final%20Guidelines%20on%20Accounting%20for%20Expected%20Credit%20Losses%20(EBA-GL-2017-06).di_page_42.json",
      "excerpt2": "108. When assessing whether there has been a significant increase in credit risk for a lending exposure, credit institutions should also take into account the following factors which are related to the environment in which a credit institution or the borrower operates: a. deterioration of the macroeconomic outlook relevant to a particular borrower or to a group of borrowers. Macroeconomic assessments should be sufficiently rich to include factors relevant to sovereign, corporate, household and other types of borrower. Furthermore, they should address any relevant regional differences in economic performance within a jurisdiction 31; and b. deterioration of prospects for the sector or industries within which a borrower operates. 109. Accurate identification of drivers of credit risk, and reliable demonstration of the linkages between those drivers and the level of credit risk, should be considered as critical, as a seemingly small change in a qualitative characteristic of a loan can potentially be a leading indicator of a large increase in the risk of a default occurring.",
      "pageNumber2": 42,
      "explanation": "Both texts require institutions to identify and consider macroeconomic factors and other environmental factors as drivers of credit risk when monitoring and assessing credit risk. The source requires institutions to identify and monitor relevant drivers of aggregate credit risk, including macroeconomic factors, and report on them. The target explicitly lists deterioration of the macroeconomic outlook and prospects for the sector/industries as factors to consider when assessing significant increases in credit risk, highlighting the importance of identifying and linking these drivers to the level of credit risk.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_61.json",
      "excerpt1": "249. When monitoring credit risk, institutions should have appropriate methodologies and practices, allowing the aggregation of credit risk exposures in business lines, portfolios, sub- portfolios, products, industries and geographical segments, and support the identification of credit risk concentrations. Institutions should ensure that credit risk data and data infrastructure meet the following requirements: a. depth and breadth so that they cover all the significant risk factors - this should allow, inter alia, exposures to be grouped together in terms of shared credit risk characteristics, such as the institutional sector to which the borrower belongs, the purpose of the transaction and the geographical location of the borrower/collateral, so as to enable an aggregate analysis that allows the identification of the entity's exposure to these significant risk factors;",
      "pageNumber1": 61,
      "filename2": "BaselFramework.di_page_373.json",
      "excerpt2": "36.14 For banks using the advanced approach, facility ratings must reflect exclusively LGD. These ratings can reflect any and all factors that can influence LGD including, but not limited to, the type of collateral, product, industry, and purpose. Borrower characteristics may be included as LGD rating criteria only to the extent they are predictive of LGD. Banks may alter the factors that influence facility grades across segments of the portfolio as long as they can satisfy their supervisor that it improves the relevance and precision of their estimates.",
      "pageNumber2": 373,
      "explanation": "Both excerpts address the grouping or segmentation of credit exposures based on shared characteristics. The source text requires institutions to be able to group exposures based on 'shared credit risk characteristics, such as the institutional sector to which the borrower belongs, the purpose of the transaction and the geographical location of the borrower/collateral'. The target text states that facility ratings, which influence LGD estimates, can reflect factors like 'type of collateral, product, industry, and purpose', allowing banks to 'alter the factors that influence facility grades across segments of the portfolio'. This commonality implies a shared requirement to categorize and analyze exposures based on similar risk attributes to manage credit risk effectively.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_61.json",
      "excerpt1": "249. When monitoring credit risk, institutions should have appropriate methodologies and practices, allowing the aggregation of credit risk exposures in business lines, portfolios, sub- portfolios, products, industries and geographical segments, and support the identification of credit risk concentrations. Institutions should ensure that credit risk data and data infrastructure meet the following requirements: a. depth and breadth so that they cover all the significant risk factors - this should allow, inter alia, exposures to be grouped together in terms of shared credit risk characteristics, such as the institutional sector to which the borrower belongs, the purpose of the transaction and the geographical location of the borrower/collateral, so as to enable an aggregate analysis that allows the identification of the entity's exposure to these significant risk factors; b. accuracy, integrity, reliability and timeliness of data;",
      "pageNumber1": 61,
      "filename2": "Guidelines%20on%20PD%20and%20LGD%20estimation%20(EBA-GL-2017-16).di_page_28.json",
      "excerpt2": "Data requirements for LGD estimation As the LGD estimates should be based on the institution's own experience, it is important that all relevant data be properly recorded and stored. The scope of data necessary for proper LGD estimation is very broad, and entails not only the date of default and all cash flows and events after default, but also all relevant information on the obligors and transactions that could be used as risk drivers in the model development. The reference data set (RDS) should include all information necessary for the model development as well as for calibration. For the purpose of LGD estimation, it should include complete information for all defaulted facilities observed during the historical observation period.",
      "pageNumber2": 28,
      "explanation": "Both texts outline requirements for credit risk data and data infrastructure. The source mandates that 'credit risk data and data infrastructure meet the following requirements: a. depth and breadth so that they cover all the significant risk factors... b. accuracy, integrity, reliability and timeliness of data'. The target, in the context of LGD estimation, states that 'all relevant data be properly recorded and stored' and that the 'scope of data necessary for proper LGD estimation is very broad, and entails not only the date of default and all cash flows and events after default, but also all relevant information on the obligors and transactions that could be used as risk drivers in the model development.' This demonstrates a shared regulatory subject regarding the need for comprehensive, high-quality data for credit risk management and estimation.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_61.json",
      "excerpt1": "249. When monitoring credit risk, institutions should have appropriate methodologies and practices, allowing the aggregation of credit risk exposures in business lines, portfolios, sub- portfolios, products, industries and geographical segments, and support the identification of credit risk concentrations. Institutions should ensure that credit risk data and data infrastructure meet the following requirements: a. depth and breadth so that they cover all the significant risk factors - this should allow, inter alia, exposures to be grouped together in terms of shared credit risk characteristics, such as the institutional sector to which the borrower belongs, the purpose of the transaction and the geographical location of the borrower/collateral, so as to enable an aggregate analysis that allows the identification of the entity's exposure to these significant risk factors;",
      "pageNumber1": 61,
      "filename2": "Guidelines%20on%20PD%20and%20LGD%20estimation%20(EBA-GL-2017-16).di_page_62.json",
      "excerpt2": "57. In the process of selecting risk drivers and rating criteria, institutions should consider a broad set of information relevant to the type of exposures covered by the rating system. Potential risk drivers analysed by institutions should include in particular the following:",
      "pageNumber2": 62,
      "explanation": "Both excerpts address the identification and use of relevant risk factors or drivers for credit risk analysis. The source requires data infrastructure to cover 'all the significant risk factors' to allow grouping of exposures in terms of 'shared credit risk characteristics'. The target states that institutions should consider a 'broad set of information relevant to the type of exposures covered by the rating system' when selecting 'risk drivers and rating criteria'. This indicates an overlap in the requirement for institutions to identify and incorporate key risk factors or drivers in their credit risk management frameworks.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_61.json",
      "excerpt1": "249. When monitoring credit risk, institutions should have appropriate methodologies and practices, allowing the aggregation of credit risk exposures in business lines, portfolios, sub- portfolios, products, industries and geographical segments, and support the identification of credit risk concentrations. Institutions should ensure that credit risk data and data infrastructure meet the following requirements: a. depth and breadth so that they cover all the significant risk factors - this should allow, inter alia, exposures to be grouped together in terms of shared credit risk characteristics, such as the institutional sector to which the borrower belongs, the purpose of the transaction and the geographical location of the borrower/collateral, so as to enable an aggregate analysis that allows the identification of the entity's exposure to these significant risk factors;",
      "pageNumber1": 61,
      "filename2": "BaselFramework.di_page_384.json",
      "excerpt2": "36.49 Banks must retain data used in the process of allocating exposures to pools, including data on borrower and transaction risk characteristics used either directly or through use of a model, as well as data on delinquency. Banks must also retain data on the estimated PDs, LGDs and EADs, associated with pools of exposures. For defaulted exposures, banks must retain the data on the pools to which the exposure was assigned over the year prior to default and the realised outcomes on LGD and EAD.",
      "pageNumber2": 384,
      "explanation": "Both texts require institutions to group or allocate exposures based on borrower and transaction characteristics. The source states that data infrastructure should allow 'exposures to be grouped together in terms of shared credit risk characteristics'. The target requires banks to 'retain data used in the process of allocating exposures to pools, including data on borrower and transaction risk characteristics'. This indicates a shared requirement for segmentation and data retention based on specific risk attributes for credit risk monitoring and management.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_61.json",
      "excerpt1": "249. When monitoring credit risk, institutions should have appropriate methodologies and practices, allowing the aggregation of credit risk exposures in business lines, portfolios, sub- portfolios, products, industries and geographical segments, and support the identification of credit risk concentrations.",
      "pageNumber1": 61,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_69.json",
      "excerpt2": "Portfolio-level information Portfolio distribution Size distribution and concentration level Top x (e.g. 10) groups of connected clients and related risk indicators Asset class distribution Breakdown by industry, sector, collateral type, country, maturity, etc. Risk parameters Stock of loss PD/LGD evolution (overall and per portfolio) PD/LGD forecasts and projections Overall expected losses Default exposure Stocks and flows of loss allowances (overall and per portfolio) allowances Volumes of and trends in significant risk provisions at individual level NPE/forbearance status/foreclosure NPE volume by category (> 90 days past due, loss allowances, etc.)",
      "pageNumber2": 69,
      "explanation": "Both excerpts address the need for institutions to analyze and monitor credit risk at a portfolio level, including breakdowns by various segments and the identification of concentrations. The source explicitly mentions 'aggregation of credit risk exposures in business lines, portfolios, sub-portfolios, products, industries and geographical segments, and support the identification of credit risk concentrations.' The target lists 'Portfolio distribution, Size distribution and concentration level, Top x (e.g. 10) groups of connected clients and related risk indicators, Asset class distribution, Breakdown by industry, sector, collateral type, country, maturity, etc.' as 'Portfolio-level information' to be monitored. This shows a clear overlap in the requirement for granular, aggregated portfolio-level analysis to understand credit risk concentrations.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_61.json",
      "excerpt1": "249. When monitoring credit risk, institutions should have appropriate methodologies and practices, allowing the aggregation of credit risk exposures in business lines, portfolios, sub- portfolios, products, industries and geographical segments, and support the identification of credit risk concentrations. Institutions should ensure that credit risk data and data infrastructure meet the following requirements: a. depth and breadth so that they cover all the significant risk factors - this should allow, inter alia, exposures to be grouped together in terms of shared credit risk characteristics, such as the institutional sector to which the borrower belongs, the purpose of the transaction and the geographical location of the borrower/collateral, so as to enable an aggregate analysis that allows the identification of the entity's exposure to these significant risk factors;",
      "pageNumber1": 61,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_108.json",
      "excerpt2": "1. Where an institution uses multiple rating systems, the rationale for assigning an obligor or a transaction to a rating system shall be documented and applied in a manner that appropriately reflects the level of risk. ... 1. The structure of rating systems for exposures to corporates, institutions and central governments and central banks shall comply with the following requirements: (a) a rating system shall take into account obligor and trans- action risk characteristics; (d) institutions with portfolios concentrated in a particular market segment and range of default risk shall have enough obligor grades within that range to avoid undue concentrations of obligors in a particular grade. Significant concentrations within a single grade shall be supported by convincing empirical evidence that the obligor grade covers a reasonably narrow PD band and that the default risk posed by all obligors in the grade falls within that band;",
      "pageNumber2": 108,
      "explanation": "Both texts require institutions to categorize exposures and manage concentrations. The source states that institutions should have methodologies for 'aggregation of credit risk exposures in business lines, portfolios... products, industries and geographical segments, and support the identification of credit risk concentrations,' allowing exposures to be 'grouped together in terms of shared credit risk characteristics'. The target states that rating systems should 'take into account obligor and transaction risk characteristics' and that institutions 'with portfolios concentrated in a particular market segment... shall have enough obligor grades within that range to avoid undue concentrations of obligors in a particular grade.' Both provisions emphasize the need to group exposures by characteristics to identify and manage credit risk concentrations.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_61.json",
      "excerpt1": "248. As part of credit risk monitoring and reporting, institutions should identify the relevant drivers of its aggregate credit risk as well as the credit risk in its portfolios and sub-portfolios, taking into account macroeconomic (including demographic) factors and the fact that credit risk drivers may change over time. Credit risk drivers should be measured, analysed and monitored, and the credit risk management function should report regularly the outcome of the analysis to the management body.",
      "pageNumber1": 61,
      "filename2": "Final%20Guidelines%20on%20Accounting%20for%20Expected%20Credit%20Losses%20(EBA-GL-2017-06).di_page_31.json",
      "excerpt2": "64. Credit institutions may use in the ECL assessment and measurement process models and assumption-based estimates for risk identification and measurement, at both the individual lending exposure and overall portfolio levels, including credit grading, credit risk identification, measurement of ECL allowances for accounting purposes, stress testing and capital allocation. Models used in the ECL assessment and measurement process should consider the impact of changes to borrower and credit risk-related variables such as changes in PDs, LGDs, exposure amounts, collateral values, migration of default probabilities and internal borrower credit risk grades based on historical, current, and reasonable and supportable forward-looking information, including macroeconomic factors.",
      "pageNumber2": 31,
      "explanation": "Both texts require institutions to identify and consider macroeconomic factors as drivers of credit risk for monitoring and measurement. The source explicitly states, 'institutions should identify the relevant drivers of its aggregate credit risk... taking into account macroeconomic (including demographic) factors' and that 'Credit risk drivers should be measured, analysed and monitored'. The target states that 'Models used in the ECL assessment and measurement process should consider the impact of changes to borrower and credit risk-related variables... based on historical, current, and reasonable and supportable forward-looking information, including macroeconomic factors.' This demonstrates a clear overlap in the expectation that institutions integrate macroeconomic factors into their credit risk analysis and monitoring frameworks.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}