{
  "summary": "The comparison identifies overlaps regarding the incorporation of ESG factors into an institution's risk management frameworks and the requirements for model validation and data quality. Several excerpts reiterate the need for institutions to consider ESG factors, particularly climate-related risks, in their risk appetite and management policies, aligning with a holistic approach. Overlaps also exist in the principles for robust model validation, emphasizing data quality, independent review, backtesting, and comprehensive documentation for models used in credit risk assessment and decision-making.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_26.json",
      "excerpt1": "56. Institutions should incorporate ESG factors and associated risks in their credit risk appetite and risk management policies, credit risk policies and procedures, adopting a holistic approach. 57. Institutions should take into account the risks associated with ESG factors on the financial conditions of borrowers, and in particular the potential impact of environmental factors and climate change, in their credit risk appetite, policies and procedures. The risks of climate change for the financial performance of borrowers can primarily materialise as physical risks, such as risks to the borrower that arise from the physical effects of climate change, including liability risks for contributing to climate change, or transition risks, e.g. risks to the borrower that arise from the transition to a low-carbon and climate-resilient economy. In addition, other risks can occur, such as changes in market and consumer preferences and legal risks that may affect the performance of underlying assets.",
      "pageNumber1": 26,
      "filename2": "Final%20report%20on%20Guidelines%20on%20internal%20governance%20under%20CRD.di_page_22.json",
      "excerpt2": "23. When setting, approving and overseeing the implementation of the aspects listed in Paragraph 22 the management body should aim at ensuring a business model, governance arrangements, including a risk management framework that take into account all risks. When taking into account all risks, institutions are exposed to, institutions should take into account all relevant risk factors, including environmental, social and governance risk factors. Institutions should consider that the latter may drive their prudential risks, including credit risks, e.g. via risk factors related to the transition to a sustainable economy or external physical climate- related events that may affect debtors, market, liquidity, operational risks and also reputational risks, e.g. via social and governance risk factors, e.g. in the context of outsourcing arrangements16. Such risks include, e.g. legal risks in the area of contractual or labour law, risks related to potential human rights violations or other ESG risk factors that may affect the country where a service provider is located and its ability to provide the agreed service levels.",
      "pageNumber2": 22,
      "explanation": "Both excerpts require institutions to incorporate ESG factors and associated risks into their risk management frameworks, specifically mentioning climate-related physical and transition risks and their potential impact on credit risks and debtors. The original text focuses on loan origination and monitoring, while the related text provides a broader governance perspective, but both converge on the requirement for institutions to consider ESG risks, including climate change, as drivers of prudential risks like credit risk.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_26.json",
      "excerpt1": "54. When using automated models for creditworthiness assessment and credit decision-making, institutions should understand the models used, and their methodology, input data, assumptions, limitations and outputs, and should have in place: a. internal policies and procedures detecting and preventing bias and ensuring the quality of the input data; b. measures to ensure the traceability, auditability, and robustness and resilience of the inputs and outputs; c. internal policies and procedures ensuring that the quality of the model output is regularly assessed, using measures appropriate to the model's use, including backtesting the performance of the model; d. control mechanisms, model overrides and escalation procedures within the regular credit decision-making framework, including qualitative approaches, qualitative risk assessment tools (including expert judgement and critical analysis) and quantitative limits. 55. Institutions should have adequate model documentation that covers: a. methodology, assumptions and data inputs, and an approach to detecting and preventing bias and ensuring the quality of input data; b. the use of model outputs in the decision-making process and the monitoring of these automated decisions on the overall quality of the portfolio or products in which these models are used.",
      "pageNumber1": 26,
      "filename2": "Final%20Guidelines%20on%20Accounting%20for%20Expected%20Credit%20Losses%20(EBA-GL-2017-06).di_page_32.json",
      "excerpt2": "66. Model validation should be conducted when the ECL models are initially developed and when significant changes are made to the models, and should ensure that the models are suitable for their proposed usage on an ongoing basis. 67. A sound model validation framework should include, but not be limited to, the following elements: a. Clear roles and responsibilities for model validation with adequate independence and competence. Model validation should be performed independently of the model development process and by staff with the necessary experience and expertise. The findings and outcomes of model validation should be reported in a prompt and timely manner to the appropriate level of authority. Where a credit institution has outsourced its validation function to an external party, the credit institution remains responsible for the effectiveness of all model validation work and should ensure that the work done by the external party meets the elements of a sound model validation framework on an ongoing basis. b. An appropriate model validation scope and methodology should include a systematic process of evaluating the model's robustness, consistency and accuracy as well as its continued relevance to the underlying individual lending exposure or portfolio. An effective model validation process should also enable potential limitations of a model to be identified and addressed on a timely basis. The scope for validation should include a review of model inputs, model design and model outputs/performance. · Model inputs: Credit institutions should have internally established quality and reliability standards on data (historical, current and forward-looking information) used as model inputs. Data used to estimate ECL allowances should be relevant to the credit institutions' portfolios and, as far as possible, accurate, reliable and complete (i.e. without exclusions that could bias ECL estimates). Validation should ensure that the data used meet these standards. · Model design: For model design, validation should assess that the underlying theory of the model is conceptually sound, recognised and generally accepted for its intended purpose. From a forward-looking perspective, validation should also assess the extent to which the model, at the overall model and individual risk factor level, can take into consideration changes in the economic or credit environment, as well as changes to portfolio business profile or strategy, without significantly reducing model robustness. . Model output/performance: Credit institutions should have internally established standards for acceptable model performance. Where performance thresholds are significantly breached, remedial actions up to the extent of model re-calibration or re- development should be taken. c. Comprehensive documentation of the model validation framework and process. This should include documenting the validation procedures performed, any changes in validation methodology and tools, the range of data used, validation results and any remedial actions",
      "pageNumber2": 32,
      "explanation": "Both excerpts outline requirements for model validation, particularly emphasizing data quality, methodology, robustness, and comprehensive documentation for models used in credit risk assessment and decision-making. Excerpt 1 (points 54-55) details requirements for understanding, preventing bias, ensuring data quality, traceability, backtesting, and documentation. Excerpt 2 (points 66-67) provides a more detailed framework for model validation, including independent validation, scope of validation (inputs, design, outputs/performance), data quality standards, and documentation, directly overlapping with the themes of model robustness, data quality, and ongoing assessment.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_26.json",
      "excerpt1": "54. When using automated models for creditworthiness assessment and credit decision-making, institutions should understand the models used, and their methodology, input data, assumptions, limitations and outputs, and should have in place: a. internal policies and procedures detecting and preventing bias and ensuring the quality of the input data; b. measures to ensure the traceability, auditability, and robustness and resilience of the inputs and outputs; c. internal policies and procedures ensuring that the quality of the model output is regularly assessed, using measures appropriate to the model's use, including backtesting the performance of the model; d. control mechanisms, model overrides and escalation procedures within the regular credit decision-making framework, including qualitative approaches, qualitative risk assessment tools (including expert judgement and critical analysis) and quantitative limits. 55. Institutions should have adequate model documentation that covers: a. methodology, assumptions and data inputs, and an approach to detecting and preventing bias and ensuring the quality of input data; b. the use of model outputs in the decision-making process and the monitoring of these automated decisions on the overall quality of the portfolio or products in which these models are used.",
      "pageNumber1": 26,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_121.json",
      "excerpt2": "Article 188 Validation and documentation Institutions shall have robust systems in place to validate the accuracy and consistency of their internal models and modelling processes. All material elements of the internal models and the modelling process and validation shall be documented. The validation and documentation of institutions' internal models and modelling processes shall be subject to the following requirements: (a) institutions shall use the internal validation process to assess the performance of its internal models and processes in a consistent and meaningful way; (b) the methods and data used for quantitative validation shall be consistent through time. Changes in estimation and vali- dation methods and data both data sources and periods covered shall be documented; (c) institutions shall regularly compare actual equity returns computed using realised and unrealised gains and losses with modelled estimates. Such comparisons shall make use of historical data that cover as long a period as possible. The institution shall document the methods and data used in such comparisons. This analysis and documen- tation shall be updated at least annually; (d) institutions shall make use of other quantitative validation tools and comparisons with external data sources. The analysis shall be based on data that are appropriate to the portfolio, are updated regularly, and cover a relevant obser- vation period. Institutions' internal assessments of the performance of their models shall be based on as long a period as possible; (e) institutions shall have sound internal standards for addressing situations where comparison of actual equity returns with the models estimates calls the validity of the estimates or of the models as such into question. These standards shall take account of business cycles and similar systematic variability in equity returns. All adjustments made to internal models in response to model reviews shall be documented and consistent with the institution's model review standards; (f) the internal model and the modelling process shall be docu- mented, including the responsibilities of parties involved in the modelling, and the model approval and model review processes.",
      "pageNumber2": 121,
      "explanation": "Both excerpts address requirements for the validation and documentation of internal models used by institutions. The original text (Para 54-55) specifies requirements for understanding models, ensuring input data quality, traceability, regular assessment including backtesting, and comprehensive documentation of methodology and data inputs. The related text (Article 188) reinforces the need for robust validation systems, consistent validation methods and data, regular comparison of actual vs. modelled estimates (backtesting), use of other quantitative tools, and thorough documentation of the internal model and modelling process, including responsibilities and review processes. These are clear overlaps in the operational requirements for model governance, validation, and documentation.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_26.json",
      "excerpt1": "54. When using automated models for creditworthiness assessment and credit decision-making, institutions should understand the models used, and their methodology, input data, assumptions, limitations and outputs, and should have in place: a. internal policies and procedures detecting and preventing bias and ensuring the quality of the input data; b. measures to ensure the traceability, auditability, and robustness and resilience of the inputs and outputs; c. internal policies and procedures ensuring that the quality of the model output is regularly assessed, using measures appropriate to the model's use, including backtesting the performance of the model; d. control mechanisms, model overrides and escalation procedures within the regular credit decision-making framework, including qualitative approaches, qualitative risk assessment tools (including expert judgement and critical analysis) and quantitative limits. 55. Institutions should have adequate model documentation that covers: a. methodology, assumptions and data inputs, and an approach to detecting and preventing bias and ensuring the quality of input data; b. the use of model outputs in the decision-making process and the monitoring of these automated decisions on the overall quality of the portfolio or products in which these models are used.",
      "pageNumber1": 26,
      "filename2": "Final%20Guidelines%20on%20Accounting%20for%20Expected%20Credit%20Losses%20(EBA-GL-2017-06).di_page_20.json",
      "excerpt2": "iv. an effective model validation process to ensure that the credit risk assessment and measurement models are able to generate accurate, consistent and unbiased predictive estimates, on an ongoing basis. This includes establishing policies and procedures which set out the accountability and reporting structure of the model validation process, internal rules for assessing and approving changes to the models, and reporting of the outcome of the model validation;",
      "pageNumber2": 20,
      "explanation": "Both excerpts require institutions to have an effective model validation process for credit risk assessment and measurement models. Excerpt 1 (Para 54c, 55a) mandates internal policies for assessing model output quality, including backtesting, and documentation covering methodology, assumptions, data inputs, and bias detection. Excerpt 2 (Principle 1.c.iv) specifically calls for an effective model validation process to ensure accurate, consistent, and unbiased predictive estimates, including policies for accountability, reporting, and approving model changes. This is an overlap concerning the validation and quality assurance of credit risk models.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_26.json",
      "excerpt1": "54. When using automated models for creditworthiness assessment and credit decision-making, institutions should understand the models used, and their methodology, input data, assumptions, limitations and outputs, and should have in place: a. internal policies and procedures detecting and preventing bias and ensuring the quality of the input data; b. measures to ensure the traceability, auditability, and robustness and resilience of the inputs and outputs; c. internal policies and procedures ensuring that the quality of the model output is regularly assessed, using measures appropriate to the model's use, including backtesting the performance of the model; d. control mechanisms, model overrides and escalation procedures within the regular credit decision-making framework, including qualitative approaches, qualitative risk assessment tools (including expert judgement and critical analysis) and quantitative limits. 55. Institutions should have adequate model documentation that covers: a. methodology, assumptions and data inputs, and an approach to detecting and preventing bias and ensuring the quality of input data; b. the use of model outputs in the decision-making process and the monitoring of these automated decisions on the overall quality of the portfolio or products in which these models are used.",
      "pageNumber1": 26,
      "filename2": "Final%20Guidelines%20on%20Accounting%20for%20Expected%20Credit%20Losses%20(EBA-GL-2017-06).di_page_23.json",
      "excerpt2": "o. document the methods used to validate models for ECL measurement (for example backtests);",
      "pageNumber2": 23,
      "explanation": "Both excerpts address the requirement for documenting model validation methods, including backtesting, for credit risk measurement. Excerpt 1 (Para 54c, 55a) mandates internal policies for regularly assessing model output quality, including backtesting, and documentation covering methodology and data inputs. Excerpt 2 (Para 33o) explicitly requires documentation of methods used to validate models for ECL measurement, citing backtests as an example. This is a direct overlap in the specific requirement for documenting model validation, including backtesting.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_26.json",
      "excerpt1": "54. When using automated models for creditworthiness assessment and credit decision-making, institutions should understand the models used, and their methodology, input data, assumptions, limitations and outputs, and should have in place: a. internal policies and procedures detecting and preventing bias and ensuring the quality of the input data; b. measures to ensure the traceability, auditability, and robustness and resilience of the inputs and outputs; c. internal policies and procedures ensuring that the quality of the model output is regularly assessed, using measures appropriate to the model's use, including backtesting the performance of the model; d. control mechanisms, model overrides and escalation procedures within the regular credit decision-making framework, including qualitative approaches, qualitative risk assessment tools (including expert judgement and critical analysis) and quantitative limits. 55. Institutions should have adequate model documentation that covers: a. methodology, assumptions and data inputs, and an approach to detecting and preventing bias and ensuring the quality of input data; b. the use of model outputs in the decision-making process and the monitoring of these automated decisions on the overall quality of the portfolio or products in which these models are used.",
      "pageNumber1": 26,
      "filename2": "Final%20Guidelines%20on%20Accounting%20for%20Expected%20Credit%20Losses%20(EBA-GL-2017-06).di_page_31.json",
      "excerpt2": "64. Credit institutions may use in the ECL assessment and measurement process models and assumption-based estimates for risk identification and measurement, at both the individual lending exposure and overall portfolio levels, including credit grading, credit risk identification, measurement of ECL allowances for accounting purposes, stress testing and capital allocation. Models used in the ECL assessment and measurement process should consider the impact of changes to borrower and credit risk-related variables such as changes in PDs, LGDs, exposure amounts, collateral values, migration of default probabilities and internal borrower credit risk grades based on historical, current, and reasonable and supportable forward-looking information, including macroeconomic factors. 65. Credit institutions should have robust policies and procedures in place to appropriately validate the accuracy and consistency of the models used to assess the credit risk and measure ECL, including their model-based credit risk rating systems and processes and the estimation of all relevant risk components, at the outset of model usage and on an ongoing basis. Such policies and procedures should appropriately include the role of professional judgement.",
      "pageNumber2": 31,
      "explanation": "Both excerpts address the use and validation of models in credit risk assessment and decision-making for institutions. Excerpt 1 (Para 54) states that institutions using automated models for creditworthiness assessment should understand them and have procedures for data quality, traceability, and regular output assessment. Excerpt 2 (Para 64-65) elaborates that institutions use models in the ECL assessment process, and these models must be validated for accuracy and consistency, including their model-based credit risk rating systems, on an ongoing basis. Both emphasize the robustness and ongoing validation of models used for credit risk.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_26.json",
      "excerpt1": "54. When using automated models for creditworthiness assessment and credit decision-making, institutions should understand the models used, and their methodology, input data, assumptions, limitations and outputs, and should have in place: a. internal policies and procedures detecting and preventing bias and ensuring the quality of the input data; b. measures to ensure the traceability, auditability, and robustness and resilience of the inputs and outputs; c. internal policies and procedures ensuring that the quality of the model output is regularly assessed, using measures appropriate to the model's use, including backtesting the performance of the model; d. control mechanisms, model overrides and escalation procedures within the regular credit decision-making framework, including qualitative approaches, qualitative risk assessment tools (including expert judgement and critical analysis) and quantitative limits. 55. Institutions should have adequate model documentation that covers: a. methodology, assumptions and data inputs, and an approach to detecting and preventing bias and ensuring the quality of input data; b. the use of model outputs in the decision-making process and the monitoring of these automated decisions on the overall quality of the portfolio or products in which these models are used.",
      "pageNumber1": 26,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_91.json",
      "excerpt2": "1. The competent authority shall grant permission pursuant to Article 143 for an institution to use the IRB Approach, including to use own estimates of LGD and conversion factors, only if the competent authority is satisfied that requirements laid down in this Chapter are met, in particular those laid down in Section 6, and that the systems of the institution for the management and rating of credit risk exposures are sound and implemented with integrity and, in particular, that the institution has demonstrated to the satis- faction of the competent authority that the following standards are met: (a) the institution's rating systems provide for a meaningful assessment of obligor and transaction characteristics, a meaningful differentiation of risk and accurate and consistent quantitative estimates of risk; (e) the institution documents its rating systems and the rationale for their design and validates its rating systems; (f) the institution has validated each rating system and each internal models approach for equity exposures during an appropriate time period prior to the permission to use this rating system or internal models approach to equity exposures, has assessed during this time period whether the rating system or internal models approaches for equity exposures are suited to the range of application of the rating system or internal models approach for equity exposures, and has made necessary changes to these rating systems or internal models approaches for equity exposures following from its assessment;",
      "pageNumber2": 91,
      "explanation": "Both excerpts establish requirements for institutions regarding their credit risk rating systems and internal models. Excerpt 1 (Para 54-55) mandates that institutions using automated models for creditworthiness assessment understand them, ensure data quality, regularly assess model output (including backtesting), and provide adequate model documentation covering methodology, assumptions, and data inputs. Excerpt 2 (Article 144(1)(a, e, f)) states that for IRB approach approval, institutions must demonstrate that their rating systems provide accurate and consistent risk estimates, that they document and validate their rating systems, and that they have validated each system during an appropriate period. These are clear overlaps in the requirements for model validation, documentation, and the robustness of credit risk assessment systems.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_26.json",
      "excerpt1": "54. When using automated models for creditworthiness assessment and credit decision-making, institutions should understand the models used, and their methodology, input data, assumptions, limitations and outputs, and should have in place: a. internal policies and procedures detecting and preventing bias and ensuring the quality of the input data; b. measures to ensure the traceability, auditability, and robustness and resilience of the inputs and outputs; c. internal policies and procedures ensuring that the quality of the model output is regularly assessed, using measures appropriate to the model's use, including backtesting the performance of the model; d. control mechanisms, model overrides and escalation procedures within the regular credit decision-making framework, including qualitative approaches, qualitative risk assessment tools (including expert judgement and critical analysis) and quantitative limits. 55. Institutions should have adequate model documentation that covers: a. methodology, assumptions and data inputs, and an approach to detecting and preventing bias and ensuring the quality of input data; b. the use of model outputs in the decision-making process and the monitoring of these automated decisions on the overall quality of the portfolio or products in which these models are used.",
      "pageNumber1": 26,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_119.json",
      "excerpt2": "Article 185 Validation of internal estimates Institutions shall validate their internal estimates subject to the following requirements: (a) institutions shall have robust systems in place to validate the accuracy and consistency of rating systems, processes, and the estimation of all relevant risk parameters. The internal validation process shall enable the institution to assess the performance of internal rating and risk estimation systems consistently and meaningfully; (b) institutions shall regularly compare realised default rates with estimated PDs for each grade and, where realised default rates are outside the expected range for that grade, institutions shall specifically analyse the reasons for the deviation. Institutions using own estimates of LGDs and conversion factors shall also perform analogous analysis for these estimates. Such comparisons shall make use of historical data that cover as long a period as possible. The institution shall document the methods and data used in such comparisons. This analysis and documentation shall be updated at least annually; (c) institutions shall also use other quantitative validation tools and comparisons with relevant external data sources. The analysis shall be based on data that are appropriate to the portfolio, are updated regularly, and cover a relevant obser- vation period. Institutions' internal assessments of the performance of their rating systems shall be based on as long a period as possible; (d) the methods and data used for quantitative validation shall be consistent through time. Changes in estimation and vali- dation methods and data (both data sources and periods covered) shall be documented; (e) institutions shall have sound internal standards for situ- ations where deviations in realised PDs, LGDs, conversion factors and total losses, where EL is used, from expectations, become significant enough to call the validity of the estimates into question. These standards shall take account of business cycles and similar systematic variability in default experience. Where realised values continue to be higher than expected values, institutions shall revise estimates upward to reflect their default and loss experience;",
      "pageNumber2": 119,
      "explanation": "Both excerpts detail requirements for the validation and documentation of internal models and rating systems used by institutions for credit risk assessment. Excerpt 1 (Para 54-55) mandates internal policies for ensuring data quality, regular assessment of model output including backtesting, and comprehensive model documentation covering methodology and data inputs. Excerpt 2 (Article 185) requires robust systems for validating accuracy and consistency, regular comparison of realised vs. estimated default rates (akin to backtesting), use of historical and external data, consistent validation methods, and thorough documentation of methods and data. These are clear overlaps in the operational requirements for model validation, performance assessment, and documentation.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_26.json",
      "excerpt1": "54. When using automated models for creditworthiness assessment and credit decision-making, institutions should understand the models used, and their methodology, input data, assumptions, limitations and outputs, and should have in place: a. internal policies and procedures detecting and preventing bias and ensuring the quality of the input data; b. measures to ensure the traceability, auditability, and robustness and resilience of the inputs and outputs; c. internal policies and procedures ensuring that the quality of the model output is regularly assessed, using measures appropriate to the model's use, including backtesting the performance of the model; d. control mechanisms, model overrides and escalation procedures within the regular credit decision-making framework, including qualitative approaches, qualitative risk assessment tools (including expert judgement and critical analysis) and quantitative limits. 55. Institutions should have adequate model documentation that covers: a. methodology, assumptions and data inputs, and an approach to detecting and preventing bias and ensuring the quality of input data; b. the use of model outputs in the decision-making process and the monitoring of these automated decisions on the overall quality of the portfolio or products in which these models are used.",
      "pageNumber1": 26,
      "filename2": "Final%20Guidelines%20on%20Accounting%20for%20Expected%20Credit%20Losses%20(EBA-GL-2017-06).di_page_50.json",
      "excerpt2": "f. the credit institution's policies and procedures for validating the accuracy and consistency of its internal credit risk assessment models are robust.",
      "pageNumber2": 50,
      "explanation": "Both excerpts address the robustness of policies and procedures for validating internal credit risk assessment models. Excerpt 1 (Para 54) requires institutions using automated models for creditworthiness assessment to have internal policies ensuring quality, traceability, and regular assessment including backtesting. Excerpt 2 (Para 139f) explicitly states that credit institutions' policies and procedures for validating the accuracy and consistency of internal credit risk assessment models must be robust. This is an overlap on the fundamental requirement for robust validation frameworks for credit risk models.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_26.json",
      "excerpt1": "54. When using automated models for creditworthiness assessment and credit decision-making, institutions should understand the models used, and their methodology, input data, assumptions, limitations and outputs, and should have in place: a. internal policies and procedures detecting and preventing bias and ensuring the quality of the input data; b. measures to ensure the traceability, auditability, and robustness and resilience of the inputs and outputs; c. internal policies and procedures ensuring that the quality of the model output is regularly assessed, using measures appropriate to the model's use, including backtesting the performance of the model; d. control mechanisms, model overrides and escalation procedures within the regular credit decision-making framework, including qualitative approaches, qualitative risk assessment tools (including expert judgement and critical analysis) and quantitative limits. 55. Institutions should have adequate model documentation that covers: a. methodology, assumptions and data inputs, and an approach to detecting and preventing bias and ensuring the quality of input data; b. the use of model outputs in the decision-making process and the monitoring of these automated decisions on the overall quality of the portfolio or products in which these models are used.",
      "pageNumber1": 26,
      "filename2": "Guidelines%20on%20IRRBB%20and%20CSRBB.di_page_31.json",
      "excerpt2": "70.Institutions should ensure that the validation of IRRBB measurement methods - which should be reviewed and validated independently of their development - and the assessment of corresponding model risk are included in a formal policy process that should be reviewed and approved by the management body or its delegates. The policy should be integrated within the governance processes for model risk management and should specify: (a) the management roles and designate who is responsible for the development, validation, documentation, implementation and use of models; and (b) the model oversight responsibilities as well as policies including the development of initial and ongoing validation procedures, evaluation of results, approval, version control, exception, escalation, modification and decommission processes.",
      "pageNumber2": 31,
      "explanation": "Both excerpts establish requirements for model governance, validation, and documentation for institutions. Excerpt 1 (Para 54-55) mandates understanding models, ensuring data quality, regular output assessment (including backtesting), and adequate documentation of methodology and data inputs. Excerpt 2 (Para 70) requires that model validation be part of a formal policy process, reviewed independently, and integrated into model risk management governance, specifying management roles for development, validation, documentation, implementation, and use, as well as model oversight responsibilities and procedures for ongoing validation, approval, and escalation. While the second excerpt focuses on IRRBB, the *process* requirements for model governance, independent validation, and documentation are directly comparable and overlap.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_26.json",
      "excerpt1": "54. When using automated models for creditworthiness assessment and credit decision-making, institutions should understand the models used, and their methodology, input data, assumptions, limitations and outputs, and should have in place: a. internal policies and procedures detecting and preventing bias and ensuring the quality of the input data; b. measures to ensure the traceability, auditability, and robustness and resilience of the inputs and outputs; c. internal policies and procedures ensuring that the quality of the model output is regularly assessed, using measures appropriate to the model's use, including backtesting the performance of the model; d. control mechanisms, model overrides and escalation procedures within the regular credit decision-making framework, including qualitative approaches, qualitative risk assessment tools (including expert judgement and critical analysis) and quantitative limits. 55. Institutions should have adequate model documentation that covers: a. methodology, assumptions and data inputs, and an approach to detecting and preventing bias and ensuring the quality of input data; b. the use of model outputs in the decision-making process and the monitoring of these automated decisions on the overall quality of the portfolio or products in which these models are used.",
      "pageNumber1": 26,
      "filename2": "Guidelines%20on%20IRRBB%20and%20CSRBB.di_page_49.json",
      "excerpt2": "151. Institutions should ensure that the validation of CSRBB measurement methods - which should be reviewed and validated independently of their development - and the assessment of corresponding model risk are included in a formal policy process that should be reviewed and approved by the management body or its delegates. The policy should be integrated within the governance processes for model risk management and should specify: (a) the management roles and designate who is responsible for the development, validation, documentation, implementation and use of models; and (b) the model oversight responsibilities as well as policies including the development of initial and ongoing validation procedures, evaluation of results, approval, version control, exception, escalation, modification and decommission processes.",
      "pageNumber2": 49,
      "explanation": "Both excerpts establish requirements for model governance, validation, and documentation for institutions. Excerpt 1 (Para 54-55) mandates understanding models, ensuring data quality, regular output assessment (including backtesting), and adequate documentation of methodology and data inputs. Excerpt 2 (Para 151) requires that model validation be part of a formal policy process, reviewed independently, and integrated into model risk management governance, specifying management roles for development, validation, documentation, implementation, and use, as well as model oversight responsibilities and procedures for ongoing validation, approval, and escalation. While the second excerpt focuses on CSRBB, the *process* requirements for model governance, independent validation, and documentation are directly comparable and overlap.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}