{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring (source) detail requirements for institutions to establish robust loan pricing frameworks. This involves reflecting credit risk appetite and business strategies, differentiating pricing based on loan and borrower types, and incorporating various cost components (capital, funding, operating, credit risk, other real costs) and market conditions. The FIN-FSA Regulations and Guidelines 4/2018 (target) directly overlap by recommending that supervised entities price housing credit to cover credit risk, funding costs, return on capital, and other operating costs, and assess risks against expected return when pricing individual credits. Both documents address the same regulatory subject for credit institutions: the methodology and considerations for pricing loans.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_51.json",
      "excerpt1": "199. Pricing frameworks should reflect institutions' credit risk appetite and business strategies, including profitability and risk perspective. Loan pricing should also be linked to the characteristics of the loan product and consider competition and prevailing market conditions. Institutions should also define their approach to pricing by borrower type and credit quality, and riskiness of the borrower (in the case of individual pricing) when appropriate. Institutions should ensure that the pricing framework is well documented and supported by appropriate governance structures, such as a pricing committee, that are responsible for the maintenance of the overall pricing framework and for individual pricing decisions when relevant. 202. Institutions should consider, and reflect in loan pricing, all relevant costs until the next repricing date or maturity, including: a. the cost of capital (considering both regulatory and economic capital), which should result from the capital allocation in place, according to the established breakdowns, e.g. geography, business line and product; b. the cost of funding, which should match the key features of the loan, e.g. the expected duration of the loan, taking into account not only contractual terms but also behavioural assumptions, e.g. pre-payment risk; C. operating and administrative costs, which should result from cost allocation; d. credit risk costs calculated for different homogeneous risk groups, taking into account historical experience of recognising credit risk losses and when relevant using expected loss models; e. any other real costs associated with the loan in question, including tax considerations, when relevant; f. competition and prevailing market conditions, in particular lending segments and for particular loan products. 203. For the purposes of pricing and measuring profitability, including cross-subsidisation between loans or business units/lines, institutions should consider and account for risk- adjusted performance measures in a manner that is proportionate to the size, nature and complexity of the loan and the risk profile of the borrower.",
      "pageNumber1": 51,
      "filename2": "2018_04.m3_en.di_page_15.json",
      "excerpt2": "(25) In their credit decisions, supervised entities must to assess the risks against expected return both in pricing individual credits and in making an overall assessment of their customer relationships. Supervised entities must emphasise the independent profitability of lending relative to credit risks. In keeping with their risk-related goals, supervised entities shall take into consideration potential future macroeconomic changes and their effects on borrowers and contract parties. (26) Supervised entities must be able to demonstrate that they consider inherent risks appropriately in accordance with chapter 4.2.2, paragraph (40) of the guidelines referred to above in paragraph (24) in pricing credit contracts.",
      "pageNumber2": 15,
      "explanation": "Both excerpts address the pricing of loans by institutions (supervised entities/credit institutions). The source specifies that pricing frameworks should reflect credit risk appetite, business strategies, profitability, and various costs (capital, funding, operating, credit risk), as well as competition and market conditions. The target states that supervised entities must assess risks against expected return in pricing, emphasize independent profitability relative to credit risks, and consider inherent risks appropriately in pricing credit contracts. Both sets of guidelines detail the principles and components that institutions must consider when determining the price of a loan, ensuring that pricing covers costs and reflects risks and profitability objectives.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_51.json",
      "excerpt1": "202. Institutions should consider, and reflect in loan pricing, all relevant costs until the next repricing date or maturity, including: a. the cost of capital (considering both regulatory and economic capital), which should result from the capital allocation in place, according to the established breakdowns, e.g. geography, business line and product; b. the cost of funding, which should match the key features of the loan, e.g. the expected duration of the loan, taking into account not only contractual terms but also behavioural assumptions, e.g. pre-payment risk; C. operating and administrative costs, which should result from cost allocation; d. credit risk costs calculated for different homogeneous risk groups, taking into account historical experience of recognising credit risk losses and when relevant using expected loss models; e. any other real costs associated with the loan in question, including tax considerations, when relevant; f. competition and prevailing market conditions, in particular lending segments and for particular loan products.",
      "pageNumber1": 51,
      "filename2": "2018_04.m3_en.di_page_16.json",
      "excerpt2": "(32) The FIN-FSA recommends that housing credit is priced so that customer income from housing credit covers the credit risk, the bank's funding costs, the bank's requirement for return on capital and other operating costs throughout the validity of the contracts.",
      "pageNumber2": 16,
      "explanation": "Both excerpts provide guidance on the specific cost components that institutions should consider and reflect in their loan pricing. The source mandates considering cost of capital, cost of funding, operating/administrative costs, and credit risk costs. The target specifically recommends for housing credit that pricing covers credit risk, funding costs, return on capital (equivalent to cost of capital), and other operating costs. This is a direct overlap in the required elements for loan pricing for institutions.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}