{
  "summary": "Both excerpts address the requirement for institutions to conduct sensitivity analysis as part of their risk assessment. The source document focuses on sensitivity analysis within creditworthiness assessment for loan origination and monitoring, detailing specific idiosyncratic and market events to be considered. The target document from the stress testing guidelines discusses sensitivity analysis in the context of stress testing programs, requiring institutions to subject risk factors to sensitivity analysis to inform scenario design, and categorizes stress scenarios into idiosyncratic, market-wide, and combined types, providing examples for each.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_44.json",
      "excerpt1": "156. Institutions should assess the sustainability and feasibility of the borrower's financial position and the future repayment capacity under potential adverse conditions that may occur in the duration of the loan agreement. To this end, institutions should carry out a single- or multifactor sensitivity analysis, considering market and idiosyncratic events, or a combination of any of them. 157. This sensitivity analysis should account for all general and asset class and product-specific aspects that may have an impact on the creditworthiness of the borrower. 158. When carrying out a sensitivity analysis of the borrower's repayment capacity under negative future conditions, institutions should take into account the following events that are most relevant to the specific circumstances and the business model of the borrower: Idiosyncratic events a. a severe but plausible decline in a borrower's revenues or profit margins; b. a severe but plausible operational loss event; c. the occurrence of severe but plausible management problems; d. the failures of significant trading partners, customers or suppliers; e. a severe but plausible reputational damage; f. a severe but plausible outflow of liquidity, changes in funding or an increase in a borrower's balance sheet leverage; g. adverse movements in the price of assets to which the borrower is predominantly exposed (e.g. as raw material or end product) and foreign exchange risk; Market events h. a severe but plausible macroeconomic downturn; i. a severe but plausible downturn in the economic sectors in which the borrower and its clients are operating; j. a significant change in political, regulatory and geographical risk; k. a severe but plausible increase in the cost of funding, e.g. an increase in the interest rate by 200 basis points on all credit facilities of the borrower.",
      "pageNumber1": 44,
      "filename2": "Guidelines%20on%20institutions%20stress%20testing%20(EBA-GL-2018-04).di_page_42.json",
      "excerpt2": "153. 3. Institutions should subject these risk factors to sensitivity analyses which in turn should provide the appropriate quantitative background information for the design of scenarios. 154. Institutions should apply the following three types of stress scenarios: an idiosyncratic scenario, a market-wide scenario and a combination of the two. As idiosyncratic stress scenario should assume institution-specific events (e.g. a rating downgrade, the default of the largest funding counterparty, a loss of market access, a loss of currency convertibility, the default of the counterparty providing the largest inflows), whereas a market-wide stress scenario should assume an impact on a group of institutions or the financial sector as a whole (e.g. a deterioration in funding market conditions or the macroeconomic environment, or rating downgrades of countries in which the institution operates).",
      "pageNumber2": 42,
      "explanation": "Both documents require institutions to perform sensitivity analysis considering 'idiosyncratic' and 'market' events. The source document specifies this for creditworthiness assessment during loan origination and monitoring, providing a detailed list of such events (e.g., decline in revenues, operational loss, macroeconomic downturn, increased funding costs). The target document mandates sensitivity analysis for stress testing, categorizing scenarios into 'idiosyncratic' and 'market-wide' and giving examples (e.g., rating downgrade, default of funding counterparty for idiosyncratic; macroeconomic environment deterioration, rating downgrades of countries for market-wide). The nature and categories of events to be considered in the sensitivity analysis are broadly consistent, representing an overlap in the types of risk factors institutions must consider in their assessments.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}