{
  "summary": "The EBA Guidelines on loan origination and monitoring (EBA/GL/2020/06) specify the types of information and data institutions and creditors should collect and use to assess the creditworthiness and risk profile of borrowers (consumers and enterprises) before concluding a loan agreement. This includes details on the purpose of the loan, repayment capacity, financial commitments, collateral, and other risk mitigants. Several related documents reinforce or elaborate on these requirements, particularly regarding the factors to be considered in credit decisions and the assessment of collateral and guarantees. Overlaps are identified where multiple texts impose similar requirements for the assessment of borrower creditworthiness and the consideration of specific factors like loan purpose, repayment capacity, and collateral.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_33.json",
      "excerpt1": "84. Institutions and creditors should have sufficient, accurate and up-to-date information and data necessary to assess the borrower's creditworthiness and risk profile before concluding a loan agreement. 85. For the purposes of the creditworthiness assessment of consumers, institutions and creditors should have available, and use, information supported by necessary and appropriate evidence, in relation to at least the following: a. purpose of the loan, when relevant to the type of product; c. source of repayment capacity; g. collateral (for secured lending); h. other risk mitigants, such as guarantees, when available. 86. For the purposes of the creditworthiness assessment of micro, small, medium-sized and large enterprises, institutions should have available, and use, information, supported by necessary and appropriate evidence, in relation to at least the following: a. . purpose of the loan, when relevant to the type of product; b. income and cash flow; C. financial position and commitments, including assets pledged and contingent liabilities; f. collateral (for secured lending); g. other risk mitigants, such as guarantees, when available;",
      "pageNumber1": 33,
      "filename2": "2018_04.m3_en.di_page_15.json",
      "excerpt2": "(23) At a minimum, the following factors must be considered in the context of credit decisions:2 · the borrower's previous repayment performance, current repayment capacity and estimate of future repayment capacity considering all of its assets and liabilities · the purpose of use of the credit and the source of funds for its repayment (continuity factors must be taken into account) · the funding plan for the project and the proportion of the borrower's equity finance · collateral type, valuation, coverage and realisability · in case the credit is amortised on a very back-loaded repayment plan, the plan for paying the largest instalments · assessment of changes in economic conditions (interest rates, other factors) · group of connected clients3, its obligations (incl. guarantee obligations) and the supervised entity's position in terms of priority, preferential rights and collateral · how the credit decision is consistent with the credit strategy · in the case of housing company loans, also the following: - high level of housing company loan - ownership concentrations · in the case of corporate credit, also the following: - assessment of the borrower's business idea, sector and position/competitiveness within the sector - assessment of the competence and expertise of company management - ownership structure of the company and its influence in the potential event of equity recapitalisation (Issued on 23.1.2020, valid from 10.2.2020)",
      "pageNumber2": 15,
      "explanation": "Both excerpts address the information and factors required for assessing a borrower's creditworthiness and making credit decisions. The original content (EBA GL 2020/06, paras 84-86) sets out general and specific information requirements for consumers and enterprises, including purpose of loan, repayment capacity, financial commitments, and collateral. The related content (FIN-FSA 4/2018, para 23) provides a minimum list of factors for credit decisions, which directly mirrors many of these, such as the purpose of credit, source of funds for repayment, repayment capacity, and collateral type/valuation, for both general and corporate credit. This constitutes a direct overlap in the regulatory requirements for information gathering and assessment during the loan origination phase.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_33.json",
      "excerpt1": "85. For the purposes of the creditworthiness assessment of consumers, institutions and creditors should have available, and use, information supported by necessary and appropriate evidence, in relation to at least the following: g. collateral (for secured lending); h. other risk mitigants, such as guarantees, when available. 86. For the purposes of the creditworthiness assessment of micro, small, medium-sized and large enterprises, institutions should have available, and use, information, supported by necessary and appropriate evidence, in relation to at least the following: f. collateral (for secured lending); g. other risk mitigants, such as guarantees, when available;",
      "pageNumber1": 33,
      "filename2": "2018_04.m3_en.di_page_17.json",
      "excerpt2": "(41) Supervised entities must have documented procedures and guidelines for: · accepting different types of collateral · regularly monitoring and assessing collateral values4 · collateral valuation (hair-cut) · ensuring that collateral is binding, adequate and realisable · identifying any concentrations of risk arising from collateral.",
      "pageNumber2": 17,
      "explanation": "Both excerpts concern the role and management of collateral in the lending process. The original document (EBA GL 2020/06, paras 85g, 85h, 86f, 86g) requires institutions and creditors to have and use information on collateral and other risk mitigants (such as guarantees) for creditworthiness assessment. The related document (FIN-FSA 4/2018, para 41) mandates supervised entities to have documented procedures and guidelines for accepting, monitoring, assessing, and valuing different types of collateral, including ensuring it is binding and realisable. This represents an overlap in the regulatory expectation that collateral and guarantees are integral to the credit assessment and risk mitigation framework, requiring specific information and robust management procedures.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}