{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring and the Basel Framework both address the assessment of real estate related loans where repayment is primarily dependent on the cash flows generated by the property. Specifically, the EBA Guidelines outline assessment requirements for properties under construction intended to generate income and for buy-to-let agreements, including reliance on rental income and sensitivity analyses to market events affecting rental prices and vacancy rates. The Basel Framework provides definitions for 'Income-Producing Real Estate (IPRE) lending' and 'Exposures that are materially dependent on cash flows generated by the property', which align with the characteristics of the loans described in the EBA guidelines.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_37.json",
      "excerpt1": "111. If the property is still being constructed and intended to provide, upon completion, an income to its owner in the form of rents or profits from its sale, institutions should assess the development phase and the phase after the completion of the development, when the project converts into an income-producing property. For the purposes of such loan agreements, institutions and creditors should establish that: a. the borrower has a plausible plan related to the project, including estimates of all costs associated with the development; b. the borrower has access to builders, architects, engineers and contractors, who will take part in the development; c. the borrower has obtained or is able to obtain in the future all necessary permits and certificates for the development, as the project progresses. 112. For loan agreements that relate to an immovable property that explicitly state that the immovable property is not to be occupied as a place of residence by the borrower or a family member (i.e. buy-to-let agreements), institutions should assess the relationship between the future rental income from the immovable property and the borrower's ability to meet obligations.",
      "pageNumber1": 37,
      "filename2": "BaselFramework.di_page_295.json",
      "excerpt2": "Income-producing real estate lending 30.14 IPRE lending refers to a method of providing funding to real estate (such as, office buildings to let, retail space, multifamily residential buildings, industrial or warehouse space, or hotels) where the prospects for repayment and recovery on the exposure depend primarily on the cash flows generated by the asset. The primary source of these cash flows would generally be lease or rental payments or the sale of the asset. The borrower may be, but is not required to be, an SPE, an operating company focused on real estate construction or holdings, or an operating company with sources of revenue other than real estate. The distinguishing characteristic of IPRE versus other corporate exposures that are collateralised by real estate is the strong positive correlation between the prospects for repayment of the exposure and the prospects for recovery in the event of default, with both depending primarily on the cash flows generated by a property.",
      "pageNumber2": 295,
      "explanation": "Both excerpts define and describe the characteristics of loans for income-producing real estate. The EBA Guidelines specify the assessment for properties under construction intended to provide income and buy-to-let agreements, where the assessment focuses on future rental income and the borrower's ability to meet obligations. The Basel Framework provides a direct definition for 'Income-Producing Real Estate (IPRE) lending' where repayment depends primarily on cash flows generated by the asset, such as lease or rental payments or the sale of the asset. Both address the same subject of real estate lending where repayment is tied to property-generated income.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_37.json",
      "excerpt1": "113. As part of the creditworthiness assessment, institutions should carry out sensitivity analyses to reflect potential negative market and idiosyncratic events in the future that are relevant to the type and purpose of the loan. These events may include a reduction in income; an increase in interest rates in cases of variable rate loan agreements; negative amortisation of the loan; balloon payments or deferred payments of the principal or interest; and, when relevant, deterioration in the marketability of the immovable property, an increase in vacancy rates and a reduction in the rental prices for similar properties. When relevant, institutions and creditors should also consider the implication of foreign currency exchange rate risk, as provided in paragraph 108.",
      "pageNumber1": 37,
      "filename2": "BaselFramework.di_page_235.json",
      "excerpt2": "Definition of exposures that are \"materially dependent on cash flows generated by the property\" 20.79 Regulatory real estate exposures (both residential and commercial) are classified as exposures that are \"materially dependent on cash flows generated by the property\" when the prospects for servicing the loan materially depend on the cash flows generated by the property securing the loan rather than on the underlying capacity of the borrower to service the debt from other sources. The primary source of these cash flows would generally be lease or rental payments, or the sale of the property. The distinguishing characteristic of these exposures compared to other regulatory real estate exposures is that both the servicing of the loan and the prospects for recovery in the event of default depend materially on the cash flows generated by the property securing the exposure.",
      "pageNumber2": 235,
      "explanation": "Both excerpts address the assessment of real estate loans where repayment depends on the property's cash flows. The EBA Guidelines require institutions to conduct sensitivity analyses for such loans, specifically mentioning events like deterioration in marketability, increased vacancy rates, and reduced rental prices, which directly relate to the cash flow generation of the property. The Basel Framework defines 'exposures that are materially dependent on cash flows generated by the property,' where loan servicing and recovery depend primarily on lease or rental payments or the sale of the property. Both texts mandate consideration of the property's income-generating capacity for these types of loans.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}