{
  "summary": "The analysis reveals an overlap in regulatory requirements concerning the remuneration policies for staff involved in credit granting. Both documents mandate that remuneration policies must be consistent with sound risk management, prevent conflicts of interest, and avoid incentivising excessive risk-taking. The Finnish guideline specifies that remuneration should not be dependent on the number or proportion of approved credit applications, which aligns with the broader principles stated in the EBA Guidelines.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_32.json",
      "excerpt1": "82. As part of the requirements of institutions' remuneration policies set out in Articles 74, 75 and 92 of Directive 2013/36/EU and the EBA Guidelines on remuneration policies and practices related to the sale and provision of retail banking products and services, the EBA Guidelines on sound remuneration policies under Articles 74(3) and 75(2) of Directive 2013/36/EU and disclosures under Article 450 of Regulation (EU) No 575/2013, and Article 7 of Directive 2014/17/EU, institutions' remuneration policies and practices should be in line with the approach to credit risk management, credit risk appetite and strategies, and should not create a conflict of interest. Remuneration policies and practices applicable to staff, and in particular identified staff engaged in credit granting, credit administration and monitoring, should be consistent and not provide incentives for risk taking that exceeds the tolerated risk of the institution, and should be aligned with the business strategy, objectives and long-term interests of the institution. In addition, remuneration policies and practices should incorporate measures to manage conflicts of interest, with a view to protecting consumers from undesirable detriment arising from the remuneration of sales staff. 83. Institutions' remuneration policies and practices should, in particular, ensure that the performance and risk measurement process to determine the variable remuneration of the staff involved in credit granting includes appropriate credit quality metrics that are in line with the institution's credit risk appetite.",
      "pageNumber1": 32,
      "filename2": "2018_04.m3_en.di_page_13.json",
      "excerpt2": "(13) In accordance with chapter 7a, section 10 of the Consumer Protection Act, in preparing and applying its policies on remuneration of personnel responsible for the assessment of consumers' creditworthiness, lenders must ensure that the policies prevent the emergence of conflicts of interests. In particular, it is required that the amount of remuneration of the personnel is not dependent on the number and share of approved credit applications. The policies must promote appropriate and effective risk management and they must not encourage risk taking in excess of the risk level acceptable for the lender.",
      "pageNumber2": 13,
      "explanation": "Both excerpts address remuneration policies for staff involved in credit granting/assessment within institutions. Filename1 requires remuneration policies for staff engaged in credit granting not to create a conflict of interest, to be consistent with credit risk management, and not to provide incentives for risk-taking exceeding the tolerated risk. Filename2 imposes similar requirements, stating that policies must prevent conflicts of interest, promote effective risk management, and not encourage excessive risk-taking, specifically adding that remuneration should not be dependent on the number of approved credit applications, which is a concrete measure aligned with the general principles in filename1.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}