{
  "summary": "The two excerpts discuss the application of the principle of proportionality in EBA guidelines, specifically concerning loan origination and monitoring, and the management of non-performing and forborne exposures. Both highlight stakeholders' concerns about the prescriptive nature of requirements and advocate for a more flexible and risk-sensitive application of proportionality.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_84.json",
      "excerpt1": "One of the biggest areas of concern for the BSG was the application of the principle of proportionality and the level of application. The BSG noted the extensively wide scope of the guidelines and suggested focusing only on newly originated loans, not setting any new requirements for the existing stock of loans, as any information collection and analysis will be too burdensome and costly, and encouraging further integration with the requirements of the MCD, the CCD and the General Data Protection Regulation (GDPR), in order to avoid any contradiction of the Level 1 legislation. To accommodate a more proportionate approach, the BSG suggested revising the language that makes the requirements very prescriptive. The BSG requested more flexibility and recognition in the application of the principle of proportionality vis-à-vis the risk profile of the borrower, and the nature and complexity of the credit facility. Furthermore, the BSG requested for more differentiation in relation to requirements for retail and non-retail loans, risk-sensitive and non-risk-sensitive businesses, as well as the materiality of portfolios for the institutions.",
      "pageNumber1": 84,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_87.json",
      "excerpt2": "Stakeholders had general comments on various issues such as the prescriptiveness of the requirements and in relation to the application of the principle of proportionality throughout the guidelines. Some comments presented a detailed list of requirements that the stakeholders considered particularly prescriptive. Where possible and appropriate, the EBA changed the language accordingly to avoid any unintended consequences of the prudential regulation, such as an unnecessary regulatory burden on institutions. In terms of the application of the proportionality principle, in the guidelines the EBA provided some examples and included considerations for institutions and competent authorities in order to indicate how the principle of proportionality should be applied in practice. These considerations include, for example, references to four distinct SREP categories and considerations in relation to NPE governance and operational aspects.",
      "pageNumber2": 87,
      "explanation": "Both excerpts address stakeholders' feedback regarding the application of the principle of proportionality within EBA guidelines. Excerpt 1 (Loan Origination and Monitoring) details concerns from the BSG about the 'extensively wide scope' and calls for a 'more proportionate approach' and 'more flexibility and recognition in the application of the principle of proportionality vis-à-vis the risk profile of the borrower, and the nature and complexity of the credit facility', as well as 'more differentiation in relation to requirements for retail and non-retail loans'. Excerpt 2 (NPE/FBE management) similarly reports that 'Stakeholders had general comments on various issues such as the prescriptiveness of the requirements and in relation to the application of the principle of proportionality throughout the guidelines' and that the EBA responded by changing language 'to avoid any unintended consequences of the prudential regulation, such as an unnecessary regulatory burden on institutions' and 'provided some examples and included considerations for institutions and competent authorities in order to indicate how the principle of proportionality should be applied in practice'. While applied to different guidelines, the underlying regulatory subject is the concern about the prescriptive nature of requirements and the need for a proportionate, risk-sensitive application of regulatory principles by credit institutions.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}