{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring include specific provisions to ensure objectivity and impartiality in credit decision-making, particularly concerning conflicts of interest for individuals involved in such decisions. These provisions are found to overlap with broader requirements for conflict of interest policies and decision-making by the management body as detailed in the EBA Guidelines on Internal Governance. Both sets of guidelines emphasize the need for individuals to abstain from decisions where conflicts of interest exist and for institutions to establish policies and controls to manage such conflicts and ensure objective decision-making.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_29.json",
      "excerpt1": "70. Institutions should ensure that decisions taken by credit decision-makers are impartial and objective and not adversely affected by any conflict of interest, in line with the EBA Guidelines on internal governance. More specifically, for the purposes of these guidelines, institutions should ensure that any individual involved in credit decision-making, such as members of staff and members of the management body, should not take part in credit decisions if any of the following occurs:a. any individual involved in credit decision-making has a personal or professional relationship (outside the professional relationship when representing the institution) with the borrower;b. any individual involved in credit decision-making has an economic or any other interest, including direct or indirect, actual or potential, financial or non-financial, associated with the borrower;c. any individual involved in credit decision-making has undue political influence on or a political relationship with the borrower.",
      "pageNumber1": 29,
      "filename2": "Final%20Guidelines%20on%20Internal%20Governance%20(EBA-GL-2017-11).di_page_39.json",
      "excerpt2": "113. The policy should set out procedures, measures, documentation requirements and responsibilities for the identification and prevention of conflicts of interest, for the assessment of their materiality and for taking mitigating measures. Such procedures, requirements, responsibilities and measures should include:c. establishing the responsibility of the members of the management body to abstain from voting on any matter where a member has or may have a conflict of interest or where the member's objectivity or ability to properly fulfil duties to the institution may be otherwise compromised;...114. The policy should specifically cover the risk of conflicts of interest at the level of the management body and provide sufficient guidance on the identification and management of conflicts of interest that may impede the ability of members of the management body to take objective and impartial decisions that aim to fulfil the best interests of the institution.",
      "pageNumber2": 39,
      "explanation": "Both excerpts address the management of conflicts of interest to ensure objective and impartial decision-making. The source document specifically applies this to 'credit decision-making' and lists explicit situations (personal/professional relationship, economic interest, political influence) that constitute a conflict. The target document provides broader requirements for a conflict of interest policy, explicitly stating that members of the management body should abstain from voting on matters where they have a conflict of interest or their objectivity may be compromised, and that the policy should guide objective decisions. The principle of abstaining due to conflicts for objective decision-making is consistent and overlapping, with the source providing specific examples within the credit context.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_29.json",
      "excerpt1": "71. Notwithstanding the governance structures implemented in institutions to operationalise the credit decision-making framework, institutions should have policies, procedures and organisational controls in place that guarantee and ensure objectivity and impartiality in the credit decision-making process. These policies, procedures and organisational controls, including any mitigating measures, should be clearly defined and understood, and should address any potential conflicts of interest. Institutions should ensure effective oversight of the decisions taken by credit decision-makers, including credit granting, to ensure their objectivity and impartiality.",
      "pageNumber1": 29,
      "filename2": "Final%20report%20on%20Guidelines%20on%20internal%20governance%20under%20CRD.di_page_11.json",
      "excerpt2": "39. To ensure objective decision-making, oversight and compliance with external and internal requirements, including institutions' strategies and risk limits, institutions should implement a conflict-of-interest policy and internal whistleblowing procedures.40. In order to prevent conflicts of interest, the management body should ensure that a framework for the identification and, where necessary, mitigation of conflicts of interests exist. The institution, its organisational substructures, staff and shareholders hold different interests that should be considered in such a framework in order to ensure that decisions are taken objectively.",
      "pageNumber2": 11,
      "explanation": "Both excerpts require institutions to establish policies, procedures, and organizational controls to ensure objective decision-making and prevent conflicts of interest. The source focuses on the 'credit decision-making process' and 'credit granting', while the target provides a general requirement for 'objective decision-making' across the institution. The underlying principle and required actions (policies, procedures, controls for objectivity and conflict of interest mitigation) are the same.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_29.json",
      "excerpt1": "71. Notwithstanding the governance structures implemented in institutions to operationalise the credit decision-making framework, institutions should have policies, procedures and organisational controls in place that guarantee and ensure objectivity and impartiality in the credit decision-making process. These policies, procedures and organisational controls, including any mitigating measures, should be clearly defined and understood, and should address any potential conflicts of interest. Institutions should ensure effective oversight of the decisions taken by credit decision-makers, including credit granting, to ensure their objectivity and impartiality.",
      "pageNumber1": 29,
      "filename2": "Final%20report%20on%20Guidelines%20on%20internal%20governance%20under%20CRD.di_page_40.json",
      "excerpt2": "108. The management body should be responsible for establishing, approving and overseeing the implementation and maintenance of effective policies to identify, assess, manage and mitigate or prevent actual and potential conflicts between the interests of the institution and the private interests of staff, including members of the management body, which could adversely influence the performance of their duties and responsibilities. A consolidating institution should consider interests within a group-wide conflict of interest policy on a consolidated or sub-consolidated basis.109. The policy should aim at identifying conflicts of interest of staff, including the interests of their closest family members. Institutions should take into consideration that conflicts of interest may arise not only from present but also from past personal or professional relationships. Where conflicts of interest arise, institutions should assess their materiality and decide on and implement mitigating measures, as appropriate.",
      "pageNumber2": 40,
      "explanation": "Both excerpts address the need for institutions to establish and maintain policies for identifying, assessing, managing, and mitigating conflicts of interest. The source specifically mentions these for 'credit decision-making' and 'credit granting' to ensure objectivity and impartiality. The target outlines the management body's responsibility for a broader 'conflict of interest policy for staff' (which includes decision-makers) with the same aim of identifying and mitigating conflicts that could adversely influence performance. The core requirement for policies and measures to manage conflicts of interest to ensure objective decision-making is present in both.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_29.json",
      "excerpt1": "69. If the institutions grant specific veto rights in relation to positive credit decisions to the head of the risk management function, institutions should consider granting such veto rights to additional staff members within the risk management function for specific credit decisions, to ensure that such a veto can be exercised, if appropriate, at all levels of the credit decision- making framework below the management body. Institutions should specify the scope of these veto rights, the escalation or appeal procedures, and how the management body will be involved.",
      "pageNumber1": 29,
      "filename2": "Final%20Guidelines%20on%20Internal%20Governance%20(EBA-GL-2017-11).di_page_51.json",
      "excerpt2": "185. The head of the RMF should be able to challenge decisions taken by the institution's management and its management body, and the grounds for objections should be formally documented. If an institution wishes to grant the head of the RMF the right to veto decisions (e.g. a credit or investment decision or the setting of a limit) made at levels below the management body, it should specify the scope of such a veto right, the escalation or appeal procedures, and how the management body will be involved.",
      "pageNumber2": 51,
      "explanation": "Both excerpts address the same regulatory subject: the granting of veto rights to the head of the risk management function (RMF) concerning decisions made at levels below the management body, specifically mentioning 'credit decisions'. Both require institutions to specify the 'scope of such a veto right', 'escalation or appeal procedures', and 'how the management body will be involved'. The wording and requirements are almost identical, demonstrating a clear overlap.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_29.json",
      "excerpt1": "69. If the institutions grant specific veto rights in relation to positive credit decisions to the head of the risk management function, institutions should consider granting such veto rights to additional staff members within the risk management function for specific credit decisions, to ensure that such a veto can be exercised, if appropriate, at all levels of the credit decision- making framework below the management body. Institutions should specify the scope of these veto rights, the escalation or appeal procedures, and how the management body will be involved.",
      "pageNumber1": 29,
      "filename2": "Final%20Report%20on%20GL%20on%20internal%20governance%20under%20IFD.di_page_52.json",
      "excerpt2": "181. The head of the RMF should be able to challenge decisions taken by the investment firm's management and its management body, and the grounds for objections should be formally documented. If an investment firm wishes to grant the head of the RMF the right to veto decisions (e.g. a credit or investment decision or the setting of a limit) made at levels below the management body, it should specify the scope of such a veto right, the escalation or appeal procedures, and how the management body will be involved.",
      "pageNumber2": 52,
      "explanation": "Both excerpts deal with the same regulatory subject: the right of the head of the Risk Management Function (RMF) to veto decisions, including 'credit decisions', made at levels below the management body. Both require the institution/investment firm to specify the 'scope of such a veto right', 'escalation or appeal procedures', and 'how the management body will be involved'. The requirements are identical, indicating a direct overlap.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}