{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring (EBA/GL/2020/06) define their scope to include 'institutions' and 'creditors' for certain loan types, and specifically state that Sections 5 and 6 apply to loans to consumers and various enterprises but 'do not apply to forborne and non-performing loans'. The FIN-FSA regulations and guidelines, which recommend compliance with these EBA Guidelines, explicitly extend the requirement for creditworthiness assessment 'with respect to both new credits, renewed credits and changes of credit terms and conditions', including those for 'other borrowers than consumers'. This latter statement implies that creditworthiness assessment, which is a core part of loan origination and monitoring, applies to renewed credits or changes in terms, which could encompass situations where loans might be forborne or non-performing, thus creating a potential contradiction regarding the exclusion of forborne and non-performing loans in the EBA guidelines for Sections 5 and 6, and the comprehensive application of creditworthiness assessment by FIN-FSA.",
  "overlaps": [],
  "contradictions": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_14.json",
      "excerpt1": "9. Sections 5 and 6 apply to loans to consumers, micro and small enterprises, and medium-sized and large enterprises. Sections 5 and 6 do not apply to loans and advances to credit institutions, investment firms, financial institutions, insurance and reinsurance undertakings, and central banks, and loans and advances to sovereigns, including central governments, regional and local authorities, and public sector entities. Sections 5 and 6 do not apply to forborne and non- performing loans.",
      "pageNumber1": 14,
      "filename2": "2018_04.m3_en.di_page_14.json",
      "excerpt2": "(21) In the assessment of creditworthiness, the supervised entity must comply with chapter 7a, section 10 of the Consumer Protection Act also with respect to other borrowers than consumers. The assessment must be made with respect to both new credits, renewed credits and changes of credit terms and conditions. The information and documents needed as background for the decision must be listed.",
      "pageNumber2": 14,
      "explanation": "Excerpt 1 from the EBA Guidelines on Loan Origination and Monitoring explicitly states that Sections 5 and 6 (which cover aspects like creditworthiness assessment and monitoring) 'do not apply to forborne and non-performing loans'. However, Excerpt 2 from the FIN-FSA regulations and guidelines, which recommend compliance with the EBA Guidelines, mandates that creditworthiness assessments 'must be made with respect to both new credits, renewed credits and changes of credit terms and conditions'. Renewed credits and changes of credit terms and conditions, particularly for other borrowers than consumers, can very likely involve loans that are already forborne or non-performing (e.g., restructuring of a troubled loan). This creates a contradiction where the EBA Guidelines exclude forborne and non-performing loans from the scope of Sections 5 and 6, while the FIN-FSA, implementing the EBA Guidelines, effectively extends creditworthiness assessment to situations that could encompass such loans, thus requiring compliance in a context where the EBA guidelines explicitly state they do not apply.",
      "type": "CONTRADICTION"
    }
  ]
}