{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring (EBA/GL/2020/06) serve as a foundational document for requirements across various aspects of credit risk management. The analysis reveals several overlaps where other regulatory texts either reiterate the importance of adhering to these guidelines or specify similar requirements for credit institutions, particularly concerning collateral valuation, internal governance, credit risk management frameworks, and the use of models. No direct contradictions were found, as the related texts generally reinforce or specify the application of the EBA guidelines.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_89.json",
      "excerpt1": "In the area of internal governance, the EBA has clarified the requirements for credit decision- making, and also the requirement for the use of FinTech and model governance, to ensure that the guidelines are both future proof and technology neutral. The EBA also revised the requirements for the credit risk management and control frameworks, to ensure their full alignment with the EBA Guidelines on internal governance and to avoid prescribing any specific organisational structures that remain the responsibility of the institutions themselves. With respect to the loan origination procedures the EBA first clarified the requirements for handling information for the purposes of creditworthiness assessment, recognising that, for existing customers, information may be already available to the institutions, and then explained the notion of verification of information. The text has been thoroughly reviewed throughout, to ensure that there is no 'one size fits all' approach, and various approaches, including models, can be exploited as long as they meet general prudential requirements set out in the guidelines. The requirements for creditworthiness assessment for consumer lending have been simplified, compared with other asset classes, to ensure a practical application of the principle of proportionality. The EBA also clarified the requirements for the creditworthiness assessment of leveraged transactions that have been previously scattered across various sections. The section on pricing has been significantly revised to address respondents' concerns. The EBA clarified the requirements and emphasised that the EBA's intention is not to prescribe specific pricing strategies. The EBA also elaborated further on various risk-based metrics to be considered by institutions in their pricing approaches. With respect to the collateral valuation, the EBA has further revised the guidelines to allow the use of advanced statistical models for the valuation of immovable property collateral at the point of origination, subject to the strict conditions for such use, as far as possible within the requirements of the CRR/CRD and the MCD. The EBA also provided a set of requirements for the advanced statistical models themselves. Based on the feedback received, the EBA streamlined the requirements for the monitoring framework, introducing more proportionality and consideration of the risk profile of the borrowers and portfolios/individual loans. Further clarifications included the monitoring of soft information, behavioural aspects, leveraged transactions and the use of early warning signals.",
      "pageNumber1": 89,
      "filename2": "2018_04.m3_en.di_page_11.json",
      "excerpt2": "On 29 May 2020, the European Banking Authority (EBA) issued guidelines on loan origination and monitoring (EBA/GL/2020/06). The guidelines clarify, in particular, the internal governance and control framework for the credit-granting and decision-making process, specify the requirements for assessing the creditworthiness of borrowers at the point of credit granting to consumers and enterprises, and set out requirements for the information to be used in assessments. In addition, the guidelines set out supervisory expectations for the risk-based pricing of loans and provide guidance on, among other things, the valuation of immovable and movable property collateral at the point of credit granting, and the monitoring and review of the value of such collateral. The guidelines also provide specifications on the ongoing monitoring of credit risks. (Issued on 20 October 2020, valid from 30 June 2021) (2) In accordance with Article 16(3) of the EBA Regulation (1093/2010), financial institutions shall make every effort to comply with the EBA Guidelines referred to in paragraph (1). (Issued on 20 October 2020, valid from 30 June 2021) (3) The FIN-FSA recommends that supervised entities falling within the scope of these regulations and guidelines comply with the EBA Guidelines mentioned in paragraph (1), which is available at the https://www.finanssivalvonta.fi/en/. (Issued on 20 October 2020, valid from 30 June 2021) (4) The FIN-FSA recommends that all supervised entities as referred to in section 4 of the FIN-FSA Act and other financial market participants as referred to in section 5 and foreign supervised entities as referred to in section 6 comply with chapter 5 on loan origination procedures of the EBA Guidelines mentioned in paragraph (1), excluding paragraph 93 of the Guidelines, when they offer consumer loans falling within the scope of chapter 7 of the Consumer Protection Act or consumer loans related to residential property falling within the scope of chapter 7a of the Consumer Protection Act.",
      "pageNumber2": 11,
      "explanation": "Both excerpts address the EBA Guidelines on Loan Origination and Monitoring (EBA/GL/2020/06). The source excerpt is an executive summary highlighting the guidelines' revisions and clarifications on internal governance, credit decision-making, creditworthiness assessment, pricing, collateral valuation, and monitoring framework. The target excerpt explicitly refers to these same guidelines, summarizing their scope which includes internal governance, credit-granting/decision-making, creditworthiness assessment, information requirements, risk-based pricing, collateral valuation, and ongoing monitoring of credit risks. It also mandates financial institutions to comply with these guidelines, confirming a direct and substantial overlap in the regulatory subjects covered.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_89.json",
      "excerpt1": "In the area of internal governance, the EBA has clarified the requirements for credit decision- making, and also the requirement for the use of FinTech and model governance, to ensure that the guidelines are both future proof and technology neutral. The EBA also revised the requirements for the credit risk management and control frameworks, to ensure their full alignment with the EBA Guidelines on internal governance and to avoid prescribing any specific organisational structures that remain the responsibility of the institutions themselves.",
      "pageNumber1": 89,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_91.json",
      "excerpt2": "c. the policies and procedures are sound and consistent with the credit risk strategy, and cover all the main businesses and processes relevant to managing, measuring and controlling credit risk, in particular: · credit granting and pricing: for example, borrowers, guarantors and collateral eligibility; credit limits; selection of FMIs, CCPs and correspondent banks; types of credit facilities available; terms and conditions (including collateral and netting agreements requirement) to be applied; · credit risk measurement and monitoring: for example, criteria for identifying groups of connected counterparties; criteria for assessing borrowers' creditworthiness and collateral evaluation and frequency for their review; criteria for quantifying impairments, credit valuation adjustments and provisions; and · credit management: for example, criteria for reviewing products, terms and conditions; criteria for applying forbearance practices or restructuring; criteria for loan classification and management of NPLs;",
      "pageNumber2": 91,
      "explanation": "The source excerpt discusses the EBA's clarification and revision of internal governance requirements for credit decision-making and credit risk management and control frameworks, ensuring alignment with internal governance guidelines. The target excerpt details components of credit risk management policies and procedures, including credit granting, pricing, creditworthiness assessment, and collateral evaluation. Both texts relate to the internal governance and the framework for managing, measuring, and controlling credit risk within institutions, particularly concerning credit granting and creditworthiness, indicating a clear overlap in subject matter.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_89.json",
      "excerpt1": "With respect to the collateral valuation, the EBA has further revised the guidelines to allow the use of advanced statistical models for the valuation of immovable property collateral at the point of origination, subject to the strict conditions for such use, as far as possible within the requirements of the CRR/CRD and the MCD. The EBA also provided a set of requirements for the advanced statistical models themselves.",
      "pageNumber1": 89,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_87.json",
      "excerpt2": "b. collateral values, for performing and non-performing exposures, including to what degree they meet the requirements of the EBA Guidelines on management of non- performing and forborne exposures (for collateral used to secure non-performing exposures) and EBA Guidelines on loan origination and monitoring (for all collateral);",
      "pageNumber2": 87,
      "explanation": "The source text describes the EBA's revisions to guidelines concerning collateral valuation, specifically allowing for advanced statistical models for immovable property collateral at origination and setting requirements for these models. The target text explicitly references the 'EBA Guidelines on loan origination and monitoring (for all collateral)' when discussing the assessment of collateral values. This direct reference confirms that both excerpts are addressing the same regulatory subject of collateral valuation as defined and elaborated in the EBA/GL/2020/06.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_89.json",
      "excerpt1": "Based on the feedback received, the EBA streamlined the requirements for the monitoring framework, introducing more proportionality and consideration of the risk profile of the borrowers and portfolios/individual loans. Further clarifications included the monitoring of soft information, behavioural aspects, leveraged transactions and the use of early warning signals.",
      "pageNumber1": 89,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_93.json",
      "excerpt2": "231. Competent authorities should assess whether the institution has defined and implemented continuous and effective monitoring of credit risk exposures (including credit concentration) throughout the institution, amongst others, by means of specific indicators and relevant triggers to provide effective early warning alerts. 233. Competent authorities should assess whether the institution has a strong and comprehensive control framework and sound safeguards to mitigate its credit risk in line with its credit risk strategy and appetite and whether such a control framework is line with the requirements of the EBA Guidelines on loan origination and monitoring and Guidelines on management of non-performing and forborne exposures.",
      "pageNumber2": 93,
      "explanation": "The source text discusses the EBA streamlining requirements for the monitoring framework, including the use of early warning signals. The target text mandates competent authorities to assess institutions' continuous and effective monitoring of credit risk exposures, including the provision of 'effective early warning alerts,' and explicitly states that the control framework should be in line with the EBA Guidelines on loan origination and monitoring. This shows a direct overlap regarding the requirement for and the content of the monitoring framework and early warning systems within credit risk management.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_89.json",
      "excerpt1": "With respect to the collateral valuation, the EBA has further revised the guidelines to allow the use of advanced statistical models for the valuation of immovable property collateral at the point of origination, subject to the strict conditions for such use, as far as possible within the requirements of the CRR/CRD and the MCD. The EBA also provided a set of requirements for the advanced statistical models themselves.",
      "pageNumber1": 89,
      "filename2": "2018_04.m3_en.di_page_17.json",
      "excerpt2": "(41) Supervised entities must have documented procedures and guidelines for: · accepting different types of collateral · regularly monitoring and assessing collateral values4 · collateral valuation (hair-cut) · ensuring that collateral is binding, adequate and realisable · identifying any concentrations of risk arising from collateral. (42) Supervised entities must establish acceptable types of collateral as well as collateral valuation percentages for each type of acceptable collateral. The valuation percentages shall be consistent with a prudential maximum limit for the relevant types of collateral. However, collateral value must always be based on a case-specific assessment, and special attention should be paid on collateral whose fair value cannot be considered stable. (43) The valuer of collateral must be competent and adequately independent of the granting of credit. Supervised entities must comply with the provisions in section 1 of Decree 1031/2016 of the Council of State on the professional requirements for a valuer of residential property or collateral for credit in consumer credit related to housing, also with respect to the valuer of collateral for other credit. (44) Supervised entities must ensure that the valuation of acceptable collateral is based on reliable appraisal methods, taking internationally recognised valuation standards into account. 4 EBA has published an interpretation guideline (2017_3078) on the determination of fair value under Article 208(3)(b) and Article 229(1) of the EU CRR (575/2013). According to the interpretation guideline, Article 208(3)(b) CRR does not allow the use of a statistical model as the sole means of valuation of collateral. The same applies to Article 229(1) CRR.",
      "pageNumber2": 17,
      "explanation": "Both excerpts deal with collateral valuation for credit institutions. The source text mentions the EBA revising guidelines to allow advanced statistical models for immovable property collateral at origination, subject to strict conditions and CRR/CRD/MCD requirements, and also refers to requirements for these models. The target text requires supervised entities to have documented procedures for collateral valuation, including regular monitoring and assessment of values, establishing acceptable collateral types and valuation percentages, and ensuring valuations are based on reliable appraisal methods. Crucially, footnote 4 in the target excerpt refers to an EBA interpretation guideline that 'does not allow the use of a statistical model as the sole means of valuation of collateral' under CRR articles, which directly relates to the source text's mention of allowing advanced statistical models under 'strict conditions'. This highlights an overlap in the regulatory focus on collateral valuation methods and their limitations.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_89.json",
      "excerpt1": "With respect to the collateral valuation, the EBA has further revised the guidelines to allow the use of advanced statistical models for the valuation of immovable property collateral at the point of origination, subject to the strict conditions for such use, as far as possible within the requirements of the CRR/CRD and the MCD. The EBA also provided a set of requirements for the advanced statistical models themselves.",
      "pageNumber1": 89,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_131.json",
      "excerpt2": "3. The following requirements on monitoring of property values and on property valuation shall be met: (a) institutions monitor the value of the property on a frequent basis and at a minimum once every year for commercial immovable property and once every three years for resi- dential real estate. Institutions carry out more frequent monitoring where the market is subject to significant changes in conditions; (b) the property valuation is reviewed when information available to institutions indicates that the value of the property may have declined materially relative to general market prices and that review is carried out by a valuer who possesses the necessary qualifications, ability and experience to execute a valuation and who is independent from the credit decision process. For loans exceeding EUR 3 million or 5% of the own funds of an institution, the property valuation shall be reviewed by such valuer at least every three years. Institutions may use statistical methods to monitor the value of the property and to identify property that needs revaluation.",
      "pageNumber2": 131,
      "explanation": "Both excerpts discuss the valuation of immovable property collateral. The source text mentions the EBA's revision of guidelines to allow advanced statistical models for immovable property collateral valuation at origination, subject to strict conditions. The target text (CRR Article 208(3)) outlines requirements for monitoring property values and valuation, explicitly stating that 'Institutions may use statistical methods to monitor the value of the property and to identify property that needs revaluation.' This is a clear overlap as both address the use of statistical methods in collateral valuation.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_89.json",
      "excerpt1": "With respect to the collateral valuation, the EBA has further revised the guidelines to allow the use of advanced statistical models for the valuation of immovable property collateral at the point of origination, subject to the strict conditions for such use, as far as possible within the requirements of the CRR/CRD and the MCD. The EBA also provided a set of requirements for the advanced statistical models themselves.",
      "pageNumber1": 89,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_51.json",
      "excerpt2": "185. Credit institutions should monitor the value of immovable property collateral on a frequent basis and at a minimum as specified in Article 208(3) of Regulation (EU) No 575/2013. 186. Indexation or similar methods may be used to monitor the value of a collateral and identify the collaterals requiring revaluation. This should be in line with the institution's policy and provided that the collateral to be assessed is susceptible to accurate assessment by such methods. 187. Indices used to carry out this indexation may be internal or external as long as they are: a) reviewed regularly, with the results of this review being documented and readily available, and with the review cycle and governance requirements being clearly defined in a policy document approved by the management body; b) sufficiently granular, with the methodology being adequate and appropriate for the type of collateral in question; c) based on a sufficient time series of observed empirical evidence of actual property transactions. 188. Valuations and revaluations of immovable property collateral should be performed on an individual and a property-specific basis. Valuations and revaluations of immovable property collateral should not be carried out using a statistical model as the sole means of undertaking the review of the property valuation. 189. Competent authorities should define a common threshold for the individual valuation and revaluation of the collaterals used for NPEs by an independent appraiser. This threshold should be applicable to all credit institutions in the authority's jurisdiction and should be publicly disclosed.",
      "pageNumber2": 51,
      "explanation": "Both excerpts pertain to the valuation of immovable property collateral. The source text describes EBA's revised guidelines that permit advanced statistical models for immovable property collateral valuation at origination, subject to strict conditions. The target text, within guidelines on NPLs, specifies that 'indexation or similar methods may be used to monitor the value of a collateral' but also states that 'valuations and revaluations of immovable property collateral should not be carried out using a statistical model as the sole means of undertaking the review of the property valuation.' This indicates an overlap in the regulatory subject of using statistical or model-based approaches for collateral valuation, with both texts setting conditions or limitations on their use.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}