{
  "summary": "The analysis reveals several overlaps between the provided texts, primarily concerning the requirements for robust data infrastructure, monitoring frameworks, and internal controls for managing credit risk, particularly non-performing exposures (NPEs) and collateral. Both the EBA Guidelines on Loan Origination and Monitoring and the EBA Guidelines on Management of Non-Performing and Forborne Exposures emphasize the need for timely, accurate, and comprehensive data, as well as integrated monitoring systems to track credit exposures and collateral throughout their lifecycle. Several related texts, including the Basel Framework, CRR, and SREP Guidelines, reinforce these general principles, highlighting the consistent regulatory expectation for sound risk management practices, data quality, and reporting capabilities across various aspects of credit risk management. No contradictions were identified as the requirements, while sometimes specific to different phases of the credit lifecycle or types of exposures, are complementary rather than conflicting.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_60.json",
      "excerpt1": "240. Institutions should have a robust and effective monitoring framework, supported by an adequate data infrastructure, to ensure that information regarding their credit risk exposures, borrowers and collateral is relevant and up to date, and that the external reporting is reliable, complete, up to date and timely. 243. Institutions should consider, in the design and implementation of their credit risk monitoring framework, that: a. the framework and data infrastructure provide the capability to gather and automatically compile data regarding credit risk without undue delay and with little reliance on manual processes; b. the framework and data infrastructure allow the generation of granular risk data that is compatible and used for the institution's own risk management purposes but can also meet the requirements of the competent authorities for regular prudential and statistical reporting, as well as for supervisory stress testing and crisis management purposes; c. the framework and data infrastructure ensure effective monitoring of all credit exposures and collateral, and allow the credit decision-making process to be followed; d. the framework and data infrastructure ensure that institutions maintain an appropriate time series of reporting for current exposures, new types of lending and early warning indicators (EWIs) over their credit risk planning horizon.",
      "pageNumber1": 60,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_31.json",
      "excerpt2": "84.In terms of adequate technical infrastructure, credit institutions should ensure that all NPE- related data are centrally stored in robust and secure IT systems and that they are complete and up to date throughout the NPE workout process. 85.An adequate technical infrastructure should enable NPE WUs to: a) Access all relevant data and documentation, including: i. current NPE and early arrears borrower information, including automated notifications; ii. exposure, collateral and guarantee information linked to the borrower or connected clients; iii. monitoring tools with the IT capabilities to track forbearance performance and effectiveness;",
      "pageNumber2": 31,
      "explanation": "Both excerpts impose requirements on institutions (credit institutions) to maintain a robust and adequate data/technical infrastructure for monitoring credit risk exposures and collateral. The source text covers general credit risk exposures, while the target focuses specifically on NPE-related data, but both emphasize completeness, up-to-dateness, reliability, and the capability to gather and monitor relevant data and collateral information.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_60.json",
      "excerpt1": "240. Institutions should have a robust and effective monitoring framework, supported by an adequate data infrastructure, to ensure that information regarding their credit risk exposures, borrowers and collateral is relevant and up to date, and that the external reporting is reliable, complete, up to date and timely. 243. Institutions should consider, in the design and implementation of their credit risk monitoring framework, that: ... b. the framework and data infrastructure allow the generation of granular risk data that is compatible and used for the institution's own risk management purposes but can also meet the requirements of the competent authorities for regular prudential and statistical reporting, as well as for supervisory stress testing and crisis management purposes; ... d. the framework and data infrastructure ensure that institutions maintain an appropriate time series of reporting for current exposures, new types of lending and early warning indicators (EWIs) over their credit risk planning horizon.",
      "pageNumber1": 60,
      "filename2": "Final Report on Guidelines on common procedures and methodologies for SREP and supervisory stress testing.di_page_92.json",
      "excerpt2": "226. In this regard, competent authorities should consider whether the institutions have adequate data infrastructure that meets the requirements of the EBA Guidelines on loan origination and monitoring, and of the EBA Guidelines on management of non-performing and forborne exposures and whether analytical techniques are appropriate to enable the institution to adequately manage their credit risk, and to fulfil supervisory reporting requirements, and to detect, measure and regularly monitor the credit risk inherent in all on- and off-balance-sheet activities (where relevant at group level), in particular with regard to: ...",
      "pageNumber2": 92,
      "explanation": "Both excerpts address the requirement for an adequate data infrastructure and monitoring framework to manage credit risk and fulfill supervisory reporting. The source text specifies capabilities for data generation for risk management and reporting, while the target text assesses institutions' data infrastructure for managing credit risk and meeting supervisory reporting.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_60.json",
      "excerpt1": "240. Institutions should have a robust and effective monitoring framework, supported by an adequate data infrastructure, to ensure that information regarding their credit risk exposures, borrowers and collateral is relevant and up to date, and that the external reporting is reliable, complete, up to date and timely. 243. Institutions should consider, in the design and implementation of their credit risk monitoring framework, that: ... c. the framework and data infrastructure ensure effective monitoring of all credit exposures and collateral, and allow the credit decision-making process to be followed; ...",
      "pageNumber1": 60,
      "filename2": "BaselFramework.di_page_415.json",
      "excerpt2": "36.140The bank must maintain a continuous monitoring process that is appropriate for the specific exposures (either immediate or contingent) attributable to the collateral to be utilised as a risk mitigant. This process may include, as appropriate and relevant, ageing reports, control of trade documents, borrowing base certificates, frequent audits of collateral, confirmation of accounts, control of the proceeds of accounts paid, analyses of dilution (credits given by the borrower to the issuers) and regular financial analysis of both the borrower and the issuers of the receivables, especially in the case when a small number of large-sized receivables are taken as collateral. Observance of the bank's overall concentration limits should be monitored. Additionally, compliance with loan covenants, environmental restrictions, and other legal requirements should be reviewed on a regular basis.",
      "pageNumber2": 415,
      "explanation": "Both excerpts require institutions/banks to maintain a continuous and effective monitoring process for credit exposures and collateral. The source details the need for a robust monitoring framework for all credit exposures and collateral, while the target specifies a continuous monitoring process for collateralized exposures and includes review of compliance with loan covenants.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_60.json",
      "excerpt1": "243. Institutions should consider, in the design and implementation of their credit risk monitoring framework, that: ... d. the framework and data infrastructure ensure that institutions maintain an appropriate time series of reporting for current exposures, new types of lending and early warning indicators (EWIs) over their credit risk planning horizon. 245. The credit risk monitoring framework should cover the following: a. the payment behaviour of borrowers, including any deviations from the requirements of credit agreements, including late, missed or partial payments; b. credit risk associated with both the borrower and the transaction...",
      "pageNumber1": 60,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_44.json",
      "excerpt2": "149. Credit institutions should monitor the repayment capacity of borrowers. In the case of corporate borrowers, this should be assessed at least annually and at key reporting dates at which financial data are available. Credit institutions should collect the latest financial information from corporate borrowers in a timely fashion. The non-provision or the unreasonably late provision of information may be seen as a negative sign with regard to the borrower's creditworthiness. In the case of non-corporate borrowers, credit institutions should monitor payment performance and any signs of financial difficulties that may have an impact on repayment capacity. For borrowers on a watch list or with a weak rating, more frequent review processes should be in place, depending on the materiality, the portfolio and the borrower's financial standing. ... 150. For the purpose of implementing forbearance measures, credit institutions should be able to identify signs of possible future financial difficulties at an early stage. In order to do so, the assessment of the financial situation of the borrower should not be limited to exposures with apparent signs of financial difficulties.",
      "pageNumber2": 44,
      "explanation": "Both excerpts address the monitoring of borrowers' repayment capacity and payment behavior for credit risk management. The source requires the monitoring framework to cover payment behavior and credit risk associated with the borrower, including EWIs. The target text details specific requirements for monitoring repayment capacity, payment performance, and identifying early signs of financial difficulties across different borrower types, aligning with the concept of early warning indicators.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_60.json",
      "excerpt1": "240. Institutions should have a robust and effective monitoring framework, supported by an adequate data infrastructure, to ensure that information regarding their credit risk exposures, borrowers and collateral is relevant and up to date, and that the external reporting is reliable, complete, up to date and timely. 242. Institutions should ensure that the credit risk monitoring framework is well defined and documented, is integrated into the institutions' risk management and control frameworks, and allows all credit exposures to be followed throughout their life cycle.",
      "pageNumber1": 60,
      "filename2": "Final Report on Guidelines on common procedures and methodologies for SREP and supervisory stress testing.di_page_93.json",
      "excerpt2": "231. Competent authorities should assess whether the institution has defined and implemented continuous and effective monitoring of credit risk exposures (including credit concentration) throughout the institution, amongst others, by means of specific indicators and relevant triggers to provide effective early warning alerts. 233. Competent authorities should assess whether the institution has a strong and comprehensive control framework and sound safeguards to mitigate its credit risk in line with its credit risk strategy and appetite and whether such a control framework is line with the requirements of the EBA Guidelines on loan origination and monitoring and Guidelines on management of non-performing and forborne exposures.",
      "pageNumber2": 93,
      "explanation": "Both excerpts discuss the implementation and assessment of a robust and effective monitoring framework for credit risk exposures and its integration into the institution's risk management and control framework. The source outlines the institution's responsibility, while the target describes the competent authorities' role in assessing these frameworks, explicitly referencing the EBA Guidelines on Loan Origination and Monitoring.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_60.json",
      "excerpt1": "240. Institutions should have a robust and effective monitoring framework, supported by an adequate data infrastructure, to ensure that information regarding their credit risk exposures, borrowers and collateral is relevant and up to date, and that the external reporting is reliable, complete, up to date and timely.",
      "pageNumber1": 60,
      "filename2": "BaselFramework.di_page_1789.json",
      "excerpt2": "(c) effective credit administration policies and processes, including: continued analysis of a borrower's ability and willingness to make all payments associated with the contractual arrangements (including reviews of the performance of underlying assets, eg for securitisation exposures or project finance); monitoring of documentation, legal covenants, contractual requirements, collateral and other forms of credit risk mitigation; and an appropriate exposure grading or classification system; (d) effective information systems for accurate and timely identification, aggregation and reporting of credit risk exposures to the bank's board and senior management on an ongoing basis;",
      "pageNumber2": 1789,
      "explanation": "Both excerpts mandate institutions/banks to have effective monitoring processes and information systems for credit risk exposures. The source highlights a robust framework and adequate data infrastructure for relevant, up-to-date, and timely information and reporting. The target specifies effective credit administration policies including monitoring and effective information systems for accurate, timely identification, aggregation, and reporting of credit risk exposures.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_60.json",
      "excerpt1": "240. Institutions should have a robust and effective monitoring framework, supported by an adequate data infrastructure, to ensure that information regarding their credit risk exposures, borrowers and collateral is relevant and up to date, and that the external reporting is reliable, complete, up to date and timely. 243. Institutions should consider, in the design and implementation of their credit risk monitoring framework, that: ... c. the framework and data infrastructure ensure effective monitoring of all credit exposures and collateral, and allow the credit decision-making process to be followed;",
      "pageNumber1": 60,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_131.json",
      "excerpt2": "3. The following requirements on monitoring of property values and on property valuation shall be met: (a) institutions monitor the value of the property on a frequent basis and at a minimum once every year for commercial immovable property and once every three years for residential real estate. Institutions carry out more frequent monitoring where the market is subject to significant changes in conditions; ... 3. The following requirements on risk management shall be met: (b) the difference between the amount of the exposure and the value of the receivables shall reflect all appropriate factors, including the cost of collection, concentration within the receivables pool pledged by an individual borrower, and potential concentration risk within the institution's total exposures beyond that controlled by the institution's general methodology. Institutions shall maintain a continuous monitoring process appropriate to the receivables. They shall also review, on a regular basis, compliance with loan covenants, environmental restrictions, and other legal requirements;",
      "pageNumber2": 131,
      "explanation": "Both excerpts address the monitoring of collateral values and the overall monitoring of credit risk, specifically requiring institutions to monitor property values and maintain a continuous monitoring process for receivables. The source outlines a general requirement for effective monitoring of all credit exposures and collateral, while the target provides specific requirements for the frequency and scope of collateral monitoring (property values, receivables, and loan covenant compliance).",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_60.json",
      "excerpt1": "240. Institutions should have a robust and effective monitoring framework, supported by an adequate data infrastructure, to ensure that information regarding their credit risk exposures, borrowers and collateral is relevant and up to date, and that the external reporting is reliable, complete, up to date and timely. 241. The monitoring framework should enable institutions to manage and monitor their credit risk exposures in line with their credit risk appetite, strategy, policies and procedures at portfolio and, when relevant and material, individual exposure levels.",
      "pageNumber1": 60,
      "filename2": "2018_04.m3_en.di_page_22.json",
      "excerpt2": "(87) Supervised entities shall establish principles for the monitoring of customers, collateral and guarantees. The principles shall describe how problem customers are identified as early as possible and the procedures for treatment of problem customers of various degree. Where special terms, or covenants, are applied in lending, the supervised entity must have processes, systems and responsible persons to conduct the requisite regular monitoring and implementation of documented measures. (89) The supervised entity shall appoint the persons that are to be responsible for the monitoring of credits and collateral. These persons shall ensure that the persons responsible for the internal risk rating are immediately provided with information on changes customers' financial position as well as the timely information needed to update the ratings.",
      "pageNumber2": 22,
      "explanation": "Both texts mandate institutions/supervised entities to establish principles and processes for monitoring credit exposures, customers, and collateral. The source details a robust monitoring framework for credit risk exposures and collateral at portfolio and individual levels. The target requires principles for monitoring, early identification of problem customers, and responsible persons for monitoring credits and collateral to ensure timely information for rating updates.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}