{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring (filename1) outline requirements for institutions to assess borrowers' financial projections and repayment capacity under potential adverse conditions during loan origination. The EBA Guidelines on Management of Non-Performing and Forborne Exposures (filename2) contain similar provisions, requiring institutions to regularly assess repayment capabilities, particularly for certain high-risk loans (like bullet loans) and in light of changed market conditions that could impact repayment ability. These two sets of guidelines overlap in their requirement for institutions to conduct comprehensive assessments of a borrower's ability to repay, considering future conditions and potential adverse events, although filename1 focuses on origination and filename2 on ongoing monitoring and forbearance.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_40.json",
      "excerpt1": "131. When assessing the borrowers' financial position, institutions should assess the sustainability and feasibility of the future repayment capacity under potential adverse conditions that are relevant to the type and purpose of the loan and may occur in the duration of the loan agreement. These events may include a reduction in income and other cash flow; an increase in interest rates; negative amortisation of the loan; deferred payments of principal or interest; deterioration in the market and operating conditions for the borrower; and foreign currency exchange rate changes, when relevant.",
      "pageNumber1": 40,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_44.json",
      "excerpt2": "In the case of non-corporate borrowers, credit institutions should monitor payment performance and any signs of financial difficulties that may have an impact on repayment capacity. For borrowers on a watch list or with a weak rating, more frequent review processes should be in place, depending on the materiality, the portfolio and the borrower's financial standing. The regular assessment of the borrower's repayment capabilities should also apply to bullet loans, because these loans represent a higher level of risk than a loan subject to regular amortisation and also because continuous payment by the borrower of the interest amounts due is not sufficient reason to assume that the final bullet repayment of the loan will take place. ... An assessment of financial difficulties should also be conducted for exposures with regard to which the borrower does not have apparent financial difficulties but in relation to which market conditions have changed significantly in a way that could impact the borrower's ability to repay (e.g. bullet loans the repayment of which will depend on the sale of immovable property or foreign currency loans).",
      "pageNumber2": 44,
      "explanation": "Both excerpts address the assessment of a borrower's repayment capacity under adverse or changed conditions. Filename1 specifies the need to assess 'future repayment capacity under potential adverse conditions' during loan origination, listing examples like increased interest rates or deterioration in market conditions. Filename2, focusing on ongoing monitoring and forbearance, requires a 'regular assessment of the borrower's repayment capabilities' and an 'assessment of financial difficulties... in relation to which market conditions have changed significantly in a way that could impact the borrower's ability to repay'. While one focuses on origination and the other on monitoring, the core regulatory subject of assessing repayment capacity in anticipation of or response to adverse market/economic conditions is the same, and the rules are similar in their objective to ensure that institutions consider these factors.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_40.json",
      "excerpt1": "129. Institutions should ensure that the financial projections used in the analysis are realistic and reasonable. These projections/forecasts should be at least based on projecting historical financial data forward. Institutions should assess if these projections are in line with the institution's economic and market expectations. When institutions have material concerns about the reliability of these financial projections, they should make their own projections of the borrowers' financial position and repayment capacity.",
      "pageNumber1": 40,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_42.json",
      "excerpt2": "140. Before granting any forbearance measures, credit institutions should assess the borrower's repayment capacity. This should include an adequate assessment of the borrower's financial situation, based on sufficient information and taking into account relevant factors such as the debt-servicing capacity and overall indebtedness of the borrower or the property/project.",
      "pageNumber2": 42,
      "explanation": "Both excerpts require an assessment of the borrower's financial position and repayment capacity. Filename1 states that institutions 'should make their own projections of the borrowers' financial position and repayment capacity' when concerns exist about provided projections during loan origination. Filename2 requires that 'Before granting any forbearance measures, credit institutions should assess the borrower's repayment capacity. This should include an adequate assessment of the borrower's financial situation, based on sufficient information'. Both emphasize a robust assessment of financial position and repayment capacity, using sufficient and reliable information, before making a credit decision (origination or forbearance).",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}