{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring (EBA/GL/2020/06) outline comprehensive requirements for institutions regarding their credit risk policies and procedures, including the identification, assessment, approval, monitoring, reporting, and mitigation of credit risk, as well as specific provisions for managing concentration risk. Several related documents, particularly the 'Final Report on Guidelines on common procedures and methodologies for SREP and supervisory stress testing' and the 'BaselFramework', contain highly similar and overlapping requirements concerning the establishment, documentation, and implementation of credit risk strategies, policies, and limits, including those related to concentration risk. These documents consistently emphasize the role of the management body and senior management in setting and overseeing these frameworks, and the need for policies to cover all relevant lending activities and risk characteristics. There are no direct contradictions, as the requirements are complementary and reinforce the same regulatory objectives and practices.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_21.json",
      "excerpt1": "34. Institutions should set out, in their credit risk policies and procedures, the criteria for identifying, assessing, approving, monitoring, reporting and mitigating credit risk, and the criteria for measuring allowances for both accounting and capital adequacy purposes. Institutions should document the framework and update it regularly.",
      "pageNumber1": 21,
      "filename2": "Final Report on Guidelines on common procedures and methodologies for SREP and supervisory stress testing.di_page_91.json",
      "excerpt2": "b. senior management is responsible for drawing up and implementing the policies and procedures for managing, measuring and controlling credit risk, as defined by the management body;\nc. the policies and procedures are sound and consistent with the credit risk strategy, and cover all the main businesses and processes relevant to managing, measuring and controlling credit risk, in particular:\n· credit granting and pricing: for example, borrowers, guarantors and collateral eligibility; credit limits; selection of FMIs, CCPs and correspondent banks; types of credit facilities available; terms and conditions (including collateral and netting agreements requirement) to be applied;\n· credit risk measurement and monitoring: for example, criteria for identifying groups of connected counterparties; criteria for assessing borrowers' creditworthiness and collateral evaluation and frequency for their review; criteria for quantifying impairments, credit valuation adjustments and provisions; and\n· credit management: for example, criteria for reviewing products, terms and conditions; criteria for applying forbearance practices or restructuring; criteria for loan classification and management of NPLs;",
      "pageNumber2": 91,
      "explanation": "Both excerpts address the requirement for institutions to establish, document, and implement comprehensive credit risk policies and procedures. Excerpt 1 specifies setting out 'criteria for identifying, assessing, approving, monitoring, reporting and mitigating credit risk' and 'measuring allowances'. Excerpt 2 details that 'senior management is responsible for drawing up and implementing the policies and procedures for managing, measuring and controlling credit risk' which should cover 'credit granting and pricing', 'credit risk measurement and monitoring', and 'credit management'. The scope and nature of these policy requirements are highly overlapping.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_21.json",
      "excerpt1": "32. Institutions should ensure that the credit risk appetite and associated metrics and limits are appropriately cascaded down within the institution, including all relevant group entities and business lines and units bearing credit risk.\n33. For the purposes of managing concentration risk, institutions should set quantitative internal credit risk limits for their aggregate credit risk, as well as portfolios with shared credit risk characteristics, sub-portfolios and individual borrowers. In cases of group entities and connected clients, the limits should also account for the consolidated and sub-consolidated position and the position of the individual entities at the consolidated and sub-consolidated levels.",
      "pageNumber1": 21,
      "filename2": "BaselFramework.di_page_1795.json",
      "excerpt2": "40.43 Principle 19:51 The supervisor determines that banks have adequate policies and processes to identify, measure, evaluate, monitor, report and control or mitigate concentrations of risk on a timely basis. Supervisors set prudential limits to restrict bank exposures to single counterparties or groups of connected counterparties.52 At least for internationally active banks, large exposure requirements are not less stringent than the applicable Basel standard.",
      "pageNumber2": 1795,
      "explanation": "Both excerpts focus on the management of concentration risk within credit risk and the setting of limits. Excerpt 1 requires institutions to 'set quantitative internal credit risk limits for their aggregate credit risk, as well as portfolios with shared credit risk characteristics, sub-portfolios and individual borrowers' and to account for 'group entities and connected clients'. Excerpt 2 states that supervisors determine banks have 'adequate policies and processes to identify, measure, evaluate, monitor, report and control or mitigate concentrations of risk' and 'set prudential limits to restrict bank exposures to single counterparties or groups of connected counterparties'. The explicit mention of 'limits' for 'concentration risk' and 'connected clients/counterparties' constitutes a clear overlap in the regulatory subject and the type of requirement.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_21.json",
      "excerpt1": "32. Institutions should ensure that the credit risk appetite and associated metrics and limits are appropriately cascaded down within the institution, including all relevant group entities and business lines and units bearing credit risk.\n38. Credit risk policies and procedures should specify: a. policies and procedures and rules for the approval of credit granting and decision- making, including appropriate authorisation levels set in accordance with the credit risk appetite and limits;",
      "pageNumber1": 21,
      "filename2": "Final Report on Guidelines on common procedures and methodologies for SREP and supervisory stress testing.di_page_89.json",
      "excerpt2": "222. Competent authorities should assess whether the institution has a sound, clearly formulated and documented credit risk appetite, strategy and limits approved by the management body. For this assessment, among other factors, competent authorities should take into account:\na. whether the management body clearly expresses the credit risk strategy and appetite, as well as the process for their review;\nb. whether senior management properly implements and monitors the credit risk strategy approved by the management body, ensuring that the institution's activities are consistent with the established strategy, that written procedures are drawn up and implemented, and that responsibilities are clearly and properly assigned;\nc. whether the institution's credit and counterparty risk strategy reflects the institution's appetite levels for credit risk and whether it is consistent with the overall risk appetite;",
      "pageNumber2": 89,
      "explanation": "Both excerpts address the establishment and cascading of credit risk appetite and limits. Excerpt 1 requires institutions to ensure 'credit risk appetite and associated metrics and limits are appropriately cascaded down' and that 'approval of credit granting and decision-making' is 'set in accordance with the credit risk appetite and limits'. Excerpt 2 mandates assessment of whether the institution has a 'sound, clearly formulated and documented credit risk appetite, strategy and limits approved by the management body' and its proper implementation and consistency. The requirement for institutions to define and implement credit risk appetite and limits is clearly overlapping.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_21.json",
      "excerpt1": "34. Institutions should set out, in their credit risk policies and procedures, the criteria for identifying, assessing, approving, monitoring, reporting and mitigating credit risk, and the criteria for measuring allowances for both accounting and capital adequacy purposes. Institutions should document the framework and update it regularly.",
      "pageNumber1": 21,
      "filename2": "BaselFramework.di_page_1787.json",
      "excerpt2": "40.39 Principle 17:41 The supervisor determines that banks have an adequate credit risk management process that considers their risk appetite, risk profile, market conditions, macroeconomic factors and forward-looking information. This includes prudent policies and processes to identify, measure, evaluate, monitor, report and control or mitigate credit risk42 (including counterparty credit risk43) on a timely basis. The full credit life cycle is covered, including credit underwriting, credit evaluation and the ongoing management of the bank's loan and investment portfolios.",
      "pageNumber2": 1787,
      "explanation": "Both excerpts lay out a comprehensive requirement for credit risk management processes and policies. Excerpt 1 requires institutions to set out 'credit risk policies and procedures' covering 'identifying, assessing, approving, monitoring, reporting and mitigating credit risk'. Excerpt 2 requires 'prudent policies and processes to identify, measure, evaluate, monitor, report and control or mitigate credit risk'. The similarity in the listed actions ('identify, measure/assess, monitor, report, control/mitigate') for 'credit risk' indicates a strong overlap in the regulatory subject and specific requirements.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}