{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring (GL 2020/06) and Regulation (EU) No 575/2013 (CRR) both establish requirements for institutions concerning the valuation and monitoring of immovable property pledged as collateral for loans. The EBA GL requires institutions to assess pledged collateral, including its valuation, against their internal policies. The CRR sets out specific, more granular requirements for the monitoring frequency of property values and the review process by independent valuers, particularly for commercial and residential real estate, and for loans exceeding specific thresholds. While the EBA GL sets a general obligation to assess valuation, the CRR provides concrete, minimum standards for how that valuation and monitoring must be performed, leading to an overlap in the scope of valuation and monitoring of collateral.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_45.json",
      "excerpt1": "163. Institutions should assess any pledged collateral against the requirements for collateral set out in the institution's credit risk appetite, policies and procedures, including the valuation and ownership, and check all relevant documentation (e.g. whether property is registered in appropriate registers).",
      "pageNumber1": 45,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_131.json",
      "excerpt2": "3. The following requirements on monitoring of property values and on property valuation shall be met: (a) institutions monitor the value of the property on a frequent basis and at a minimum once every year for commercial immovable property and once every three years for residential real estate. Institutions carry out more frequent monitoring where the market is subject to significant changes in conditions; (b) the property valuation is reviewed when information available to institutions indicates that the value of the property may have declined materially relative to general market prices and that review is carried out by a valuer who possesses the necessary qualifications, ability and experience to execute a valuation and who is independent from the credit decision process. For loans exceeding EUR 3 million or 5% of the own funds of an institution, the property valuation shall be reviewed by such valuer at least every three years.",
      "pageNumber2": 131,
      "explanation": "Both excerpts address the assessment, valuation, and monitoring of collateral by institutions. The EBA GL imposes a general obligation on institutions to assess pledged collateral, including its valuation, in line with their internal policies. CRR Article 208(3) (excerpted from CELEX_32013R0575_EN_TXT.di_page_131) specifies concrete requirements for the frequency of monitoring property values (at least annually for commercial, every three years for residential) and mandates reviews by independent valuers under certain conditions (e.g., material decline in value, or for loans exceeding EUR 3 million or 5% of own funds). These specific CRR requirements provide detailed rules for performing the 'valuation and ownership' assessment mentioned in the EBA GL, indicating an overlap in the regulatory subject of collateral valuation and monitoring.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_45.json",
      "excerpt1": "163. Institutions should assess any pledged collateral against the requirements for collateral set out in the institution's credit risk appetite, policies and procedures, including the valuation and ownership, and check all relevant documentation (e.g. whether property is registered in appropriate registers).",
      "pageNumber1": 45,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_146.json",
      "excerpt2": "1. For immovable property collateral, the collateral shall be valued by an independent valuer at or at less than the market value. An institution shall require the independent valuer to document the market value in a transparent and clear manner. In those Member States that have laid down rigorous criteria for the assessment of the mortgage lending value in statutory or regulatory provisions the property may instead be valued by an independent valuer at or at less than the mortgage lending value. Institutions shall require the independent valuer not to take into account speculative elements in the assessment of the mortgage lending value and to document that value in a transparent and clear manner. The value of the collateral shall be the market value or mortgage lending value reduced as appropriate to reflect the results of the monitoring required under Article 208(3) and to take account of any prior claims on the property.",
      "pageNumber2": 146,
      "explanation": "Both excerpts deal with the valuation of immovable property collateral by institutions. EBA GL 163 states that institutions should assess pledged collateral, including its valuation, against their internal policies. CRR Article 229(1) (excerpted from CELEX_32013R0575_EN_TXT.di_page_146) provides specific legal requirements for the valuation of immovable property collateral, mandating valuation by an independent valuer at or below market value (or mortgage lending value where rigorous criteria exist), and requiring documentation of the valuation. These detailed requirements in the CRR specify how the 'valuation' aspect mentioned in the EBA GL should be conducted, indicating a direct overlap in the subject matter.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}