{
  "summary": "Both excerpts address the criteria for assessing a borrower's ability to repay for loan origination, specifically highlighting the importance of evaluating cash flow and income as primary repayment sources. While the EBA GL emphasizes future income and cash flow and considers collateral as a secondary recourse, the Basel Framework explicitly requires underwriting policies to assess the ability of the borrower to repay, using metrics like debt service coverage ratio, and acknowledges cases where repayment materially depends on cash flows generated by the property (e.g., mortgage loans). The core principle of assessing repayment ability based on cash flows is consistent.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_38.json",
      "excerpt1": "118. Institutions should assess the borrower's current and future ability to meet the obligations under the loan agreement. [...] 119. Institutions should consider that cash flow from the ordinary business activities of the borrower and, when applicable within the purpose of the loan agreement, any proceeds on the sale of the assets are the primary sources of repayment. 120. When assessing the creditworthiness of the borrower, institutions should put emphasis on the borrower's realistic and sustainable future income and future cash flow, and not on available collateral. Collateral by itself should not be a predominant criterion for approving a loan and cannot by itself justify the approval of any loan agreement. Collateral should be considered the institution's second way out in case of default or material deterioration of the risk profile, and not the primary source of repayment, with the exception of when the loan agreement envisages that the repayment of the loan is based on the sale of the property pledged as collateral or liquid collateral provided.",
      "pageNumber1": 38,
      "filename2": "BaselFramework.di_page_231.json",
      "excerpt2": "20.73 National supervisors should ensure that banks put in place underwriting policies with respect to the granting of mortgage loans that include the assessment of the ability of the borrower to repay. Underwriting policies must define a metric(s) (such as the loan's debt service coverage ratio) and specify its (their) corresponding relevant level(s) to conduct such assessment.3ยบ Underwriting policies must also be appropriate when the repayment of the mortgage loan depends materially on the cash flows generated by the property, including relevant metrics (such as an occupancy rate of the property). National supervisors may provide guidance on appropriate definitions and levels for these metrics in their jurisdictions.",
      "pageNumber2": 231,
      "explanation": "Both excerpts impose an obligation on institutions to assess the borrower's ability to repay loans. The EBA GL emphasizes the borrower's current and future ability to meet obligations, focusing on cash flow and income as primary sources. The Basel Framework also requires underwriting policies to include the assessment of the borrower's ability to repay, and explicitly mentions that these policies must be appropriate when repayment depends materially on cash flows generated by the property. Both texts align on the fundamental requirement of assessing the borrower's repayment ability based on cash flows/income.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}