{
  "summary": "The two excerpts provide lists of factors and indicators that should trigger closer monitoring or further assessment of credit risk by financial institutions. While the primary document focuses on 'Early Warning Indicators' (EWIs) in the context of loan origination and monitoring, the secondary document lists factors for assessing a 'significant increase in credit risk' for expected credit losses. Both sets of indicators cover similar themes such as internal and external rating downgrades, changes in collateral value, payment defaults (e.g., 30 days past due), and macroeconomic/sectoral deterioration, leading to an overlap in the criteria used to identify deteriorating credit quality.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_66.json",
      "excerpt1": "j. a significant increase in economic or market volatility that may have a negative impact on the borrower; k. for transactions secured with collateral, a significant worsening of the ratio of their amount to the value of the collateral due to unfavourable developments in the value of the collateral, or no change or an increase in the outstanding amount due to the payment terms established (such as extended principal payment grace periods, rising or flexible instalments, extended terms); l. a significant increase in credit risk on other transactions of the same borrower or significant changes in the expected payment behaviour of the borrower, when known; m. a significant increase in credit risk due to an increase in the difficulties of the group to which the borrower belongs, such as residents of a specific geographical area, or significant unfavourable developments in the performance of the borrower's sector of economic activity or increased difficulties in the group of related borrowers to which the borrower belongs; n. known legal action that may significantly affect the borrower's financial position; o. the late delivery of a certificate of adherence, a waiver request or a breach with respect to the covenants, at least regarding the financial covenants, if applicable; p. negative institution-internal credit grade/risk class migrations in the aggregate credit portfolio or in specific portfolios/segments; q. an actual or expected internal credit rating/risk classification downgrade for the transaction or borrower or a decrease in behavioural scoring used to assess credit risk internally; r. concerns raised in the reports by the external auditors of the institution or borrower; s. one or more borrower-related facilities 30 days past due.",
      "pageNumber1": 66,
      "filename2": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_42.json",
      "excerpt2": "108. When assessing whether there has been a significant increase in credit risk for a lending exposure, credit institutions should also take into account the following factors which are related to the environment in which a credit institution or the borrower operates: a. deterioration of the macroeconomic outlook relevant to a particular borrower or to a group of borrowers. Macroeconomic assessments should be sufficiently rich to include factors relevant to sovereign, corporate, household and other types of borrower. Furthermore, they should address any relevant regional differences in economic performance within a jurisdiction 31; and b. deterioration of prospects for the sector or industries within which a borrower operates. 109. Accurate identification of drivers of credit risk, and reliable demonstration of the linkages between those drivers and the level of credit risk, should be considered as critical, as a seemingly small change in a qualitative characteristic of a loan can potentially be a leading indicator of a large increase in the risk of a default occurring. Furthermore, in accordance with IFRS 9, paragraph 5.5.9, the significance of a change in credit risk since initial recognition depends on the risk of a default occurring at initial recognition. In this regard, where a credit institution uses changes in PD as a means of identifying changes in the risk of a default occurring, it should take into consideration the significance of a given change in PD expressed in a ratio (or the rate of fluctuation) proportionate to the PD at initial recognition (i.e. a change in the PD divided by the PD at initial recognition), considering also paragraph B5.5.11",
      "pageNumber2": 42,
      "explanation": "Both excerpts address the same regulatory subject: factors indicating a deterioration in credit risk for banking institutions. The primary document lists 'Early Warning Indicators' (EWIs) such as 'a significant increase in economic or market volatility that may have a negative impact on the borrower' (j), 'a significant worsening of the ratio of their amount to the value of the collateral' (k), 'a significant increase in credit risk on other transactions of the same borrower' (l), 'unfavourable developments in the performance of the borrower's sector of economic activity' (m), 'negative institution-internal credit grade/risk class migrations' (p), 'an actual or expected internal credit rating/risk classification downgrade' (q), and 'one or more borrower-related facilities 30 days past due' (s). The secondary document lists factors for assessing a 'significant increase in credit risk' including 'deterioration of the macroeconomic outlook relevant to a particular borrower' (a) and 'deterioration of prospects for the sector or industries within which a borrower operates' (b). There is a clear overlap in the types of indicators that institutions must monitor to identify worsening credit quality.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_66.json",
      "excerpt1": "q. an actual or expected internal credit rating/risk classification downgrade for the transaction or borrower or a decrease in behavioural scoring used to assess credit risk internally;",
      "pageNumber1": 66,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_627.json",
      "excerpt2": "e) an actual or expected internal credit rating downgrade for the borrower or decrease in behavioural scoring used to assess credit risk internally. Internal credit ratings and internal behavioural scoring are more reliable when they are mapped to external ratings or supported by default studies.",
      "pageNumber2": 627,
      "explanation": "Both excerpts address the same regulatory subject: the use of internal credit rating downgrades or decreases in behavioural scoring as indicators of increased credit risk for financial instruments. The wording is almost identical, with both stating 'an actual or expected internal credit rating downgrade for the borrower or decrease in behavioural scoring used to assess credit risk internally'. This represents a direct overlap in the specific type of internal credit risk indicator required to be monitored by institutions.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_66.json",
      "excerpt1": "s. one or more borrower-related facilities 30 days past due.",
      "pageNumber1": 66,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_628.json",
      "excerpt2": "p) past due information, including the rebuttable presumption as set out in paragraph 5.5.11. B5.5.19 The rebuttable presumption in paragraph 5.5.11 is not an absolute indicator that lifetime expected credit losses should be recognised, but is presumed to be the latest point at which lifetime expected credit losses should be recognised even when using forward-looking information (including macroeconomic factors on a portfolio level). B5.5.20 An entity can rebut this presumption. However, it can do so only when it has reasonable and supportable information available that demonstrates that even if contractual payments become more than 30 days past due, this does not represent a significant increase in the credit risk of a financial instrument. For example when non-payment was an administrative oversight, instead of resulting from financial difficulty of the borrower, or the entity has access to historical evidence that demonstrates that there is no correlation between significant increases in the risk of a default occurring and financial assets on which payments are more than 30 days past due, but that evidence does identify such a correlation when payments are more than 60 days past due.",
      "pageNumber2": 628,
      "explanation": "Both excerpts address the same regulatory subject: the significance of a borrower being '30 days past due' as an indicator of increased credit risk. The primary document identifies 'one or more borrower-related facilities 30 days past due' as an Early Warning Indicator. The secondary document from CELEX_32023R1803_EN_TXT, while detailing a rebuttable presumption in the context of IFRS 9's lifetime expected credit losses, explicitly states that 'contractual payments become more than 30 days past due' is generally presumed to be the latest point at which lifetime expected credit losses should be recognized, and provides conditions for rebutting this presumption. The consistent mention of '30 days past due' as a key threshold for credit risk deterioration constitutes an overlap.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_66.json",
      "excerpt1": "k. for transactions secured with collateral, a significant worsening of the ratio of their amount to the value of the collateral due to unfavourable developments in the value of the collateral, or no change or an increase in the outstanding amount due to the payment terms established (such as extended principal payment grace periods, rising or flexible instalments, extended terms);",
      "pageNumber1": 66,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_627.json",
      "excerpt2": "j) significant changes in the value of the collateral supporting the obligation or in the quality of third-party guarantees or credit enhancements, which are expected to reduce the borrower's economic incentive to make scheduled contractual payments or to otherwise have an effect on the probability of a default occurring. For example, if the value of collateral declines because house prices decline, borrowers in some jurisdictions have a greater incentive to default on their mortgages.",
      "pageNumber2": 627,
      "explanation": "Both excerpts address the same regulatory subject: the deterioration in the value of collateral as an indicator of increased credit risk for financial institutions. The primary document identifies 'a significant worsening of the ratio of their amount to the value of the collateral due to unfavourable developments in the value of the collateral' as an Early Warning Indicator. The secondary document lists 'significant changes in the value of the collateral supporting the obligation' as a factor in assessing a significant increase in credit risk. This overlap highlights the shared regulatory focus on monitoring collateral values as part of credit risk management.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}