{
  "summary": "An overlap is identified in the definition of 'Project finance'. The EBA Guidelines and the Basel Framework both define 'Project finance' as a method of funding where the repayment is primarily dependent on the cash flows generated by a single project, with the project's assets typically serving as security. Both texts describe the nature of such financing and the entities involved, using very similar operative wording.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_16.json",
      "excerpt1": "Project finance means the financing of all activities of micro, small, medium-sized and large enterprises (including special purpose vehicles established for the project) involved in projects in which the financial servicing of credit facilities is primarily dependent on the cash flow from sales of the project, and all the assets of the project are pledged to the institution financing the project.",
      "pageNumber1": 16,
      "filename2": "BaselFramework.di_page_294.json",
      "excerpt2": "30.9 PF is a method of funding in which the lender looks primarily to the revenues generated by a single project, both as the source of repayment and as security for the exposure. This type of financing is usually for large, complex and expensive installations that might include, for example, power plants, chemical processing plants, mines, transportation infrastructure, environment, and telecommunications infrastructure. Project finance may take the form of financing of the construction of a new capital installation, or refinancing of an existing installation, with or without improvements.",
      "pageNumber2": 294,
      "explanation": "Both excerpts define 'Project finance' for financial institutions. They describe it as a method of funding or financing where the primary source of repayment is the revenues or cash flows generated by a single project, and the project's assets serve as security for the exposure/loan. The core characteristics and functional context of this type of lending are aligned across both definitions, constituting a clear overlap.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_16.json",
      "excerpt1": "Project finance means the financing of all activities of micro, small, medium-sized and large enterprises (including special purpose vehicles established for the project) involved in projects in which the financial servicing of credit facilities is primarily dependent on the cash flow from sales of the project, and all the assets of the project are pledged to the institution financing the project.",
      "pageNumber1": 16,
      "filename2": "BaselFramework.di_page_219.json",
      "excerpt2": "(1) Project finance refers to the method of funding in which the lender looks primarily to the revenues generated by a single project, both as the source of repayment and as security for the loan. This type of financing is usually for large, complex and expensive installations such as power plants, chemical processing plants, mines, transportation infrastructure, environment, media, and telecoms. Project finance may take the form of financing the construction of a new capital installation, or refinancing of an existing installation, with or without improvements.",
      "pageNumber2": 219,
      "explanation": "Both texts provide a definition for 'Project finance'. They largely align in stating that it is a funding method where the lender primarily relies on the revenues or cash flows generated by a single project for repayment, and the project's assets act as security. The description of the nature of projects (large, complex installations) and the forms of financing (construction or refinancing) are also very similar.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}