{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring set out supervisory expectations for the valuation, monitoring, and revaluation of immovable and movable property collateral by institutions. This includes requirements for independent valuers and the use of statistical models. Several related documents, including CRR Articles 208 and 229, and various EBA/FIN-FSA guidelines, also define specific requirements for collateral valuation, monitoring frequency, independence of valuers, and the application of statistical methods for property collateral. These requirements largely align, specifying similar criteria for monitoring frequency, valuer independence, and the acceptable use of statistical models, leading to multiple overlaps. No contradictions were identified as the requirements, while detailed, are generally complementary or specify similar operative provisions.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_8.json",
      "excerpt1": "Section 7 looks at the requirements for the valuation of immovable and movable property collateral (excluding financial collateral) at the point of origination of credit facilities as well as throughout the life cycle of the loans, including monitoring and revaluation (i.e. a review of the value of the collateral). In this section, the guidelines spell out supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used by institutions for the valuation, monitoring and revaluation of various forms of collateral.",
      "pageNumber1": 8,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_131.json",
      "excerpt2": "3. The following requirements on monitoring of property values and on property valuation shall be met: (a) institutions monitor the value of the property on a frequent basis and at a minimum once every year for commercial immovable property and once every three years for resi- dential real estate. Institutions carry out more frequent monitoring where the market is subject to significant changes in conditions; (b) the property valuation is reviewed when information available to institutions indicates that the value of the property may have declined materially relative to general market prices and that review is carried out by a valuer who possesses the necessary qualifications, ability and experience to execute a valuation and who is independent from the credit decision process. For loans exceeding EUR 3 million or 5% of the own funds of an institution, the property valuation shall be reviewed by such valuer at least every three years. Institutions may use statistical methods to monitor the value of the property and to identify property that needs revaluation.",
      "pageNumber2": 131,
      "explanation": "Both excerpts address the monitoring and revaluation of immovable property collateral. The original states that Section 7 covers 'monitoring and revaluation' and 'conditions that allow advanced statistical models to be used'. The related excerpt (CRR Article 208(3)) specifies monitoring frequency (annually for commercial, triennially for residential, more frequent for significant market changes) and explicitly states that 'Institutions may use statistical methods to monitor the value of the property and to identify property that needs revaluation'. Both also mention the requirement for a valuer who is 'independent from the credit decision process' and possesses 'necessary qualifications, ability and experience'.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_8.json",
      "excerpt1": "Section 7 looks at the requirements for the valuation of immovable and movable property collateral (excluding financial collateral) at the point of origination of credit facilities as well as throughout the life cycle of the loans, including monitoring and revaluation (i.e. a review of the value of the collateral). In this section, the guidelines spell out supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used by institutions for the valuation, monitoring and revaluation of various forms of collateral.",
      "pageNumber1": 8,
      "filename2": "Guidelines%20on%20CRM%20for%20A-IRB%20institutions.di_page_39.json",
      "excerpt2": "For the purposes of valuing an immovable property collateral and reviewing its value under the conditions specified in Article 208(3)(b) of that Regulation, institutions should ensure the following: (i) The immovable property collateral is valued by an independent valuer at or at less than the market value. In those Member States that have laid down rigorous criteria for the assessment of the mortgage lending value in statutory or regulatory provisions, the property may instead be valued by an independent valuer at or at less than the mortgage lending value. Institutions should require the independent valuer not to take into account speculative elements in the assessment of the mortgage lending value. (iv) The independent valuer should possess the necessary qualifications, ability and experience to execute a valuation and should be independent from the credit decision process. As long as an employee of the institution meets all the aforementioned conditions, that employee can be considered an independent valuer.",
      "pageNumber2": 39,
      "explanation": "Both excerpts address the valuation of immovable property collateral and the requirements for independent valuers. The original mentions 'supervisory expectations for independent valuers'. The related text, referencing CRR Article 208(3)(b), specifies that the valuation must be done by an 'independent valuer' who possesses 'necessary qualifications, ability and experience to execute a valuation' and is 'independent from the credit decision process'. Both align on the core requirement of independent and qualified valuers for immovable property collateral.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_8.json",
      "excerpt1": "Section 7 looks at the requirements for the valuation of immovable and movable property collateral (excluding financial collateral) at the point of origination of credit facilities as well as throughout the life cycle of the loans, including monitoring and revaluation (i.e. a review of the value of the collateral). In this section, the guidelines spell out supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used by institutions for the valuation, monitoring and revaluation of various forms of collateral.",
      "pageNumber1": 8,
      "filename2": "2018_04.m3_en.di_page_17.json",
      "excerpt2": "(41) Supervised entities must have documented procedures and guidelines for: · accepting different types of collateral · regularly monitoring and assessing collateral values4 · collateral valuation (hair-cut) · ensuring that collateral is binding, adequate and realisable · identifying any concentrations of risk arising from collateral. (43) The valuer of collateral must be competent and adequately independent of the granting of credit. Supervised entities must comply with the provisions in section 1 of Decree 1031/2016 of the Council of State on the professional requirements for a valuer of residential property or collateral for credit in consumer credit related to housing, also with respect to the valuer of collateral for other credit. (44) Supervised entities must ensure that the valuation of acceptable collateral is based on reliable appraisal methods, taking internationally recognised valuation standards into account. 4 EBA has published an interpretation guideline (2017_3078) on the determination of fair value under Article 208(3)(b) and Article 229(1) of the EU CRR (575/2013). According to the interpretation guideline, Article 208(3)(b) CRR does not allow the use of a statistical model as the sole means of valuation of collateral. The same applies to Article 229(1) CRR.",
      "pageNumber2": 17,
      "explanation": "Both documents address collateral valuation and monitoring. The original discusses 'valuation, monitoring and revaluation' and 'supervisory expectations for independent valuers' and the use of 'advanced statistical models'. The related excerpt specifies that 'Supervised entities must have documented procedures and guidelines for...regularly monitoring and assessing collateral values...collateral valuation' and that 'The valuer of collateral must be competent and adequately independent of the granting of credit'. It also notes that statistical models cannot be the sole means of valuation, which is a condition for their use.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_8.json",
      "excerpt1": "Section 7 looks at the requirements for the valuation of immovable and movable property collateral (excluding financial collateral) at the point of origination of credit facilities as well as throughout the life cycle of the loans, including monitoring and revaluation (i.e. a review of the value of the collateral). In this section, the guidelines spell out supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used by institutions for the valuation, monitoring and revaluation of various forms of collateral.",
      "pageNumber1": 8,
      "filename2": "151_2022.di_page_8.json",
      "excerpt2": "Section 15 Valuation and monitoring the value of an asset securing a mortgage-backed credit A mortgage-backed loan is only eligible as collateral if, when granting the credit, the fair value of the collateral asset has been determined in compliance with the provisions of the EU Capital Requirements Regulation and chapter 9, section 10 of the Act on Credit Institutions as well as provisions on credit risk management issued by the Financial Supervisory Authority by virtue of chapter 9, section 24 of the Act on Credit Institutions. The issuer shall monitor the fair value of the cover assets securing mortgage-backed loans at least quarterly as referred to in subsection 1, based on a reliable statistical method describing the development of the market value of real estate or by some other reliable method. An estimate prepared by an independent external real estate evaluator approved by the Central Chamber of Commerce, as referred to in the Real Estate Fund Act (1173/1997), shall be obtained on the shares and real estate assets securing commercial property loans and residential loans exceeding the amount of EUR 3 million.",
      "pageNumber2": 8,
      "explanation": "Both texts concern the valuation and monitoring of property collateral. The original mentions 'valuation, monitoring and revaluation' and 'supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used'. The related excerpt specifies that the issuer 'shall monitor the fair value... at least quarterly... based on a reliable statistical method' and that an 'estimate prepared by an independent external real estate evaluator' is required for loans exceeding EUR 3 million. This indicates alignment on the use of statistical methods for monitoring and the involvement of independent valuers.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_8.json",
      "excerpt1": "Section 7 looks at the requirements for the valuation of immovable and movable property collateral (excluding financial collateral) at the point of origination of credit facilities as well as throughout the life cycle of the loans, including monitoring and revaluation (i.e. a review of the value of the collateral). In this section, the guidelines spell out supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used by institutions for the valuation, monitoring and revaluation of various forms of collateral.",
      "pageNumber1": 8,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_146.json",
      "excerpt2": "Article 229 Valuation principles for other eligible collateral under the IRB Approach 1. For immovable property collateral, the collateral shall be valued by an independent valuer at or at less than the market value. An institution shall require the independent valuer to document the market value in a transparent and clear manner. In those Member States that have laid down rigorous criteria for the assessment of the mortgage lending value in statutory or regulatory provisions the property may instead be valued by an independent valuer at or at less than the mortgage lending value. Institutions shall require the independent valuer not to take into account speculative elements in the assessment of the mortgage lending value and to document that value in a trans- parent and clear manner. The value of the collateral shall be the market value or mortgage lending value reduced as appropriate to reflect the results of the monitoring required under Article 208(3) and to take account of any prior claims on the property.",
      "pageNumber2": 146,
      "explanation": "Both texts specify requirements for the valuation of immovable property collateral and the role of independent valuers. The original mentions 'supervisory expectations for independent valuers'. The related excerpt (CRR Article 229(1)) explicitly states, 'For immovable property collateral, the collateral shall be valued by an independent valuer at or at less than the market value' and details requirements for documentation and consideration of mortgage lending value. This is a direct alignment on the independence of valuers and the principles of property valuation.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_8.json",
      "excerpt1": "Section 7 looks at the requirements for the valuation of immovable and movable property collateral (excluding financial collateral) at the point of origination of credit facilities as well as throughout the life cycle of the loans, including monitoring and revaluation (i.e. a review of the value of the collateral). In this section, the guidelines spell out supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used by institutions for the valuation, monitoring and revaluation of various forms of collateral.",
      "pageNumber1": 8,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_50.json",
      "excerpt2": "9. Collateral valuation of immovable and movable property 178. This section sets out the key elements for collateral valuation of immovable and movable property pledged for NPEs. 9.1 Governance, procedures and controls 9.1.1 General policy and procedures 179. A credit institution should have in place a written policy and procedures governing the valuation of property collateral. The policy and procedures should be fully aligned with the credit institution's RAF. 180. The policy and procedures should cover the valuation of all immovable and movable property collateral irrespective of its eligibility for prudential purposes in accordance with the requirements of Article 208 and Article 210 of Regulation (EU) No 575/2013. 9.1.2 Monitoring and controls 182. Credit institutions should monitor and review the valuations performed by internal or external appraisers on a regular basis as set out in this section.",
      "pageNumber2": 50,
      "explanation": "Both excerpts address the valuation and monitoring of immovable and movable property collateral. The original states that Section 7 'looks at the requirements for the valuation of immovable and movable property collateral...including monitoring and revaluation'. The related excerpt explicitly states that its section 9 'sets out the key elements for collateral valuation of immovable and movable property' and that 'Credit institutions should monitor and review the valuations performed by internal or external appraisers on a regular basis'. This is a clear overlap in the general subject and requirements for valuation and monitoring.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_8.json",
      "excerpt1": "Section 7 looks at the requirements for the valuation of immovable and movable property collateral (excluding financial collateral) at the point of origination of credit facilities as well as throughout the life cycle of the loans, including monitoring and revaluation (i.e. a review of the value of the collateral). In this section, the guidelines spell out supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used by institutions for the valuation, monitoring and revaluation of various forms of collateral.",
      "pageNumber1": 8,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_53.json",
      "excerpt2": "9.2 Frequency of valuations 197. For prudential purposes, credit institutions should update valuations of all secured exposures in accordance with the requirements of Article 208(3) and Article 210(c) of Regulation (EU) No 575/2013. 198. The group of collaterals that are subject to individual valuations and revaluations on a regular basis should be updated at the time when the exposure is classified as non- performing and at least annually while it continues to be classified as such. Credit institutions should make sure that, for the collateral subject to indexation or other similar methods, the indexation is updated at least annually. 200. Credit institutions should carry out more frequent monitoring where the market is subject to significant negative changes and/or where there are signs of significant decline in the value of the individual collateral. 201. Therefore, credit institutions should define criteria in their collateral valuation policy and procedures for determining if a significant decline in collateral value has taken place. Where possible, these will include quantitative thresholds for each type of collateral, based on the observed empirical data and any relevant qualitative credit institution experience, bearing in mind relevant factors such as market price trends or the opinion of independent appraisers. 9.3 Valuation methodology 203. Credit institutions should have defined collateral valuation approaches for each collateral product type; these should be adequate and appropriate for the type of collateral in question. 204. All immovable property collateral should be valued on the basis of market value or mortgage lending value, as specified under Article 229 of Regulation (EU) No 575/2013. Movable property should be valued at its market value.",
      "pageNumber2": 53,
      "explanation": "Both documents provide detailed requirements for the valuation and monitoring of immovable property collateral. The original states that Section 7 covers 'valuation...monitoring and revaluation' and 'conditions that allow advanced statistical models to be used'. The related excerpt defines the 'Frequency of valuations' by requiring updates 'at least annually' and 'more frequent monitoring where the market is subject to significant negative changes', aligning with CRR Article 208(3). It also specifies that 'All immovable property collateral should be valued on the basis of market value or mortgage lending value, as specified under Article 229 of Regulation (EU) No 575/2013'. This shows consistent requirements for valuation methodology and frequency.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_8.json",
      "excerpt1": "Section 7 looks at the requirements for the valuation of immovable and movable property collateral (excluding financial collateral) at the point of origination of credit facilities as well as throughout the life cycle of the loans, including monitoring and revaluation (i.e. a review of the value of the collateral). In this section, the guidelines spell out supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used by institutions for the valuation, monitoring and revaluation of various forms of collateral.",
      "pageNumber1": 8,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_51.json",
      "excerpt2": "9.1.3 Individual valuation of immovable property and use of indexation 185. Credit institutions should monitor the value of immovable property collateral on a frequent basis and at a minimum as specified in Article 208(3) of Regulation (EU) No 575/2013. 186. Indexation or similar methods may be used to monitor the value of a collateral and identify the collaterals requiring revaluation. This should be in line with the institution's policy and provided that the collateral to be assessed is susceptible to accurate assessment by such methods. 188. Valuations and revaluations of immovable property collateral should be performed on an individual and a property-specific basis. Valuations and revaluations of immovable property collateral should not be carried out using a statistical model as the sole means of undertaking the review of the property valuation. 9.1.4 Appraisers 190. All valuations of immovable property, including updated valuations, should be performed by an independent and qualified appraiser, internal or external, who possesses the necessary qualifications, ability and experience to execute a valuation, as specified in Article 208(3)(b) and Article 229 of Regulation (EU) No 575/2013.",
      "pageNumber2": 51,
      "explanation": "Both excerpts detail requirements for the valuation, monitoring, and revaluation of immovable property collateral, including the role of independent valuers and the use of statistical models. The original mentions 'monitoring and revaluation' and 'supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used'. The related text specifies that 'Credit institutions should monitor the value of immovable property collateral...as specified in Article 208(3) of Regulation (EU) No 575/2013' and that 'Indexation or similar methods may be used to monitor the value'. It also explicitly states that 'Valuations...should not be carried out using a statistical model as the sole means' and that 'All valuations of immovable property...should be performed by an independent and qualified appraiser...as specified in Article 208(3)(b) and Article 229 of Regulation (EU) No 575/2013'. This shows consistent regulation on these aspects.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_8.json",
      "excerpt1": "Section 7 looks at the requirements for the valuation of immovable and movable property collateral (excluding financial collateral) at the point of origination of credit facilities as well as throughout the life cycle of the loans, including monitoring and revaluation (i.e. a review of the value of the collateral). In this section, the guidelines spell out supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used by institutions for the valuation, monitoring and revaluation of various forms of collateral.",
      "pageNumber1": 8,
      "filename2": "BaselFramework.di_page_413.json",
      "excerpt2": "(3) Frequent revaluation: the bank is expected to monitor the value of the collateral on a frequent basis and at a minimum once every year. More frequent monitoring is suggested where the market is subject to significant changes in conditions. Statistical methods of evaluation (eg reference to house price indices, sampling) may be used to update estimates or to identify collateral that may have declined in value and that may need re- appraisal. A qualified professional must evaluate the property when information indicates that the value of the collateral may have declined materially relative to general market prices or when a credit event, such as default, occurs.",
      "pageNumber2": 413,
      "explanation": "Both documents address the monitoring and revaluation of collateral and the use of statistical methods. The original refers to 'monitoring and revaluation' and 'conditions that allow advanced statistical models to be used'. The related excerpt specifies 'Frequent revaluation: the bank is expected to monitor the value of the collateral on a frequent basis and at a minimum once every year. More frequent monitoring is suggested where the market is subject to significant changes in conditions. Statistical methods of evaluation...may be used to update estimates or to identify collateral that may have declined in value and that may need re-appraisal.' Both align on the frequency of monitoring and the use of statistical methods.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_8.json",
      "excerpt1": "Section 7 looks at the requirements for the valuation of immovable and movable property collateral (excluding financial collateral) at the point of origination of credit facilities as well as throughout the life cycle of the loans, including monitoring and revaluation (i.e. a review of the value of the collateral). In this section, the guidelines spell out supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used by institutions for the valuation, monitoring and revaluation of various forms of collateral.",
      "pageNumber1": 8,
      "filename2": "BaselFramework.di_page_232.json",
      "excerpt2": "(2) Value of the property: the valuation must be appraised independently33 using prudently conservative valuation criteria. To ensure that the value of the property is appraised in a prudently conservative manner, the valuation must exclude expectations on price increases and must be adjusted to take into account the potential for the current market price to be significantly above the value that would be sustainable over the life of the loan. National supervisors should provide guidance setting out prudent valuation criteria where such guidance does not already exist under national law. If a market value can be determined, the valuation should not be higher than the market value.34",
      "pageNumber2": 232,
      "explanation": "Both excerpts address the valuation of property collateral and the requirement for independence. The original mentions 'supervisory expectations for independent valuers'. The related excerpt states, 'the valuation must be appraised independently' and refers to footnote 33 which further clarifies 'The valuation must be done independently from the bank's mortgage acquisition, loan processing and loan decision process.' This demonstrates a clear overlap in the requirement for independent valuation.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_8.json",
      "excerpt1": "Section 7 looks at the requirements for the valuation of immovable and movable property collateral (excluding financial collateral) at the point of origination of credit facilities as well as throughout the life cycle of the loans, including monitoring and revaluation (i.e. a review of the value of the collateral). In this section, the guidelines spell out supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used by institutions for the valuation, monitoring and revaluation of various forms of collateral.",
      "pageNumber1": 8,
      "filename2": "BaselFramework.di_page_233.json",
      "excerpt2": "33 The valuation must be done independently from the bank's mortgage acquisition, loan processing and loan decision process.",
      "pageNumber2": 233,
      "explanation": "Both texts explicitly require independent valuation of collateral. The original states 'supervisory expectations for independent valuers' in the context of collateral valuation. The related excerpt (footnote 33) provides a precise definition: 'The valuation must be done independently from the bank's mortgage acquisition, loan processing and loan decision process.' This is a direct match on the requirement for valuer independence.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_8.json",
      "excerpt1": "Section 7 looks at the requirements for the valuation of immovable and movable property collateral (excluding financial collateral) at the point of origination of credit facilities as well as throughout the life cycle of the loans, including monitoring and revaluation (i.e. a review of the value of the collateral). In this section, the guidelines spell out supervisory expectations for independent valuers and conditions that allow advanced statistical models to be used by institutions for the valuation, monitoring and revaluation of various forms of collateral.",
      "pageNumber1": 8,
      "filename2": "BaselFramework.di_page_417.json",
      "excerpt2": "(4) Bank credit policies with regard to the transaction structure must address appropriate collateral requirements relative to the exposure amount, the ability to liquidate the collateral readily, the ability to establish objectively a price or market value, the frequency with which the value can readily be obtained (including a professional appraisal or valuation), and the volatility of the value of the collateral. The periodic revaluation process must pay particular attention to 'fashion-sensitive' collateral to ensure that valuations are appropriately adjusted downward of fashion, or model-year, obsolescence as well as physical obsolescence or deterioration.",
      "pageNumber2": 417,
      "explanation": "Both documents address the valuation, monitoring, and revaluation of collateral. The original states that Section 7 covers 'valuation of immovable and movable property collateral...including monitoring and revaluation'. The related excerpt specifies that 'Bank credit policies...must address...the frequency with which the value can readily be obtained (including a professional appraisal or valuation)' and 'The periodic revaluation process must pay particular attention to 'fashion-sensitive' collateral'. This clearly indicates an overlap in requiring ongoing monitoring and revaluation for various forms of collateral.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}