{
  "summary": "The original document discusses feedback and concerns raised by the Banking Stakeholder Group (BSG) regarding the EBA's Guidelines on Loan Origination and Monitoring, particularly focusing on their perceived prescriptiveness in areas like governance, credit granting, pricing, and monitoring, and the need for clarity and proportionality. Several related documents explicitly reference these EBA Guidelines (EBA/GL/2020/06) as a key regulatory framework that financial institutions should comply with, or as a source of supervisory expectations for credit risk management, creditworthiness assessment, collateral valuation, and monitoring. While the original document focuses on critiques and suggestions for the guidelines, the related documents confirm the existence and scope of these same guidelines, establishing a direct connection to the regulatory subject matter. There is no direct contradiction identified, as the related documents are mostly descriptive or recommendatory in nature regarding compliance with the EBA guidelines, rather than imposing conflicting operative rules on the same specific actions or thresholds that were criticized in the original text.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_85.json",
      "excerpt1": "FINAL REPORT - GUIDELINES ON LOAN ORIGINATION AND MONITORING The BSG expressed concerns that the requirements for governance and credit granting are too standardised and prescriptive. It is argued that the guidelines do not clarify the difference between credit risk and creditworthiness assessment. On this point, the BSG suggested that the guidelines, instead of introducing detailed governance requirements that may limit proven and well- functioning lending activity, should focus more on protecting consumer interests, including assessing the suitability of products, protecting consumers from loan sharks and mitigating negative consequences of default. ... With respect to creditworthiness assessment, the BSG also suggested that there needs to be a clarification in the credit decision-making process between acceptance and refusal thresholds linked to default rates. The BSG expressed concerns that the section on pricing is detailed and prescriptive, and that the requirements set out in the draft guidelines represent interference with business practices and decisions. ... The BSG also requested more flexibility and streamlining of the requirements for the monitoring framework, as the proposal of the draft guidelines is perceived as overly complex, burdensome and not proportionate to the average size of the loan portfolios. Furthermore, the BSG expressed concerns that the general monitoring requirements do not adequately reflect the specificities of institutions, borrower groups and specific loan products.",
      "pageNumber1": 85,
      "filename2": "2018_04.m3_en.di_page_11.json",
      "excerpt2": "On 29 May 2020, the European Banking Authority (EBA) issued guidelines on loan origination and monitoring (EBA/GL/2020/06). The guidelines clarify, in particular, the internal governance and control framework for the credit-granting and decision-making process, specify the requirements for assessing the creditworthiness of borrowers at the point of credit granting to consumers and enterprises, and set out requirements for the information to be used in assessments. In addition, the guidelines set out supervisory expectations for the risk-based pricing of loans and provide guidance on, among other things, the valuation of immovable and movable property collateral at the point of credit granting, and the monitoring and review of the value of such collateral. The guidelines also provide specifications on the ongoing monitoring of credit risks.",
      "pageNumber2": 11,
      "explanation": "Both excerpts address the EBA Guidelines on loan origination and monitoring (EBA/GL/2020/06). The original document discusses stakeholder concerns about the prescriptive nature of the guidelines regarding governance, credit granting, creditworthiness assessment, pricing, and the monitoring framework. The related document describes the content of these same guidelines, stating that they 'clarify' internal governance, 'specify' requirements for creditworthiness assessment, 'set out' expectations for risk-based pricing, and provide 'specifications on the ongoing monitoring of credit risks'. This confirms that both texts refer to the same regulatory subjects and requirements, even if one describes concerns and the other describes the content.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_85.json",
      "excerpt1": "FINAL REPORT - GUIDELINES ON LOAN ORIGINATION AND MONITORING The BSG expressed concerns that the requirements for governance and credit granting are too standardised and prescriptive. It is argued that the guidelines do not clarify the difference between credit risk and creditworthiness assessment. On this point, the BSG suggested that the guidelines, instead of introducing detailed governance requirements that may limit proven and well- functioning lending activity, should focus more on protecting consumer interests, including assessing the suitability of products, protecting consumers from loan sharks and mitigating negative consequences of default. ... With respect to creditworthiness assessment, the BSG also suggested that there needs to be a clarification in the credit decision-making process between acceptance and refusal thresholds linked to default rates. The BSG expressed concerns that the section on pricing is detailed and prescriptive, and that the requirements set out in the draft guidelines represent interference with business practices and decisions. ... The BSG also requested more flexibility and streamlining of the requirements for the monitoring framework, as the proposal of the draft guidelines is perceived as overly complex, burdensome and not proportionate to the average size of the loan portfolios. Furthermore, the BSG expressed concerns that the general monitoring requirements do not adequately reflect the specificities of institutions, borrower groups and specific loan products.",
      "pageNumber1": 85,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_91.json",
      "excerpt2": "in line with the EBA Guidelines on loan origination and monitoring and the EBA Guidelines on management of non-performing and forborne exposures. For this assessment, among other factors, competent authorities should take into account whether: a. the management body approves the policies for managing, measuring and controlling credit risk and discusses and reviews them regularly, in line with risk strategies; b. senior management is responsible for drawing up and implementing the policies and procedures for managing, measuring and controlling credit risk, as defined by the management body; c. the policies and procedures are sound and consistent with the credit risk strategy, and cover all the main businesses and processes relevant to managing, measuring and controlling credit risk, in particular: · credit granting and pricing: for example, borrowers, guarantors and collateral eligibility; credit limits; selection of FMIs, CCPs and correspondent banks; types of credit facilities available; terms and conditions (including collateral and netting agreements requirement) to be applied; · credit risk measurement and monitoring: for example, criteria for identifying groups of connected counterparties; criteria for assessing borrowers' creditworthiness and collateral evaluation and frequency for their review; criteria for quantifying impairments, credit valuation adjustments and provisions; and · credit management: for example, criteria for reviewing products, terms and conditions; criteria for applying forbearance practices or restructuring; criteria for loan classification and management of NPLs;",
      "pageNumber2": 91,
      "explanation": "Both excerpts address the EBA Guidelines on Loan Origination and Monitoring. The original text details stakeholder concerns regarding the prescriptive nature of the guidelines concerning governance, credit granting, pricing, and monitoring. The related excerpt from the SREP guidelines mandates that competent authorities assess institutional policies for managing credit risk and specifically refers to credit granting and pricing, credit risk measurement and monitoring, and credit management, stating this must be 'in line with the EBA Guidelines on loan origination and monitoring'. This establishes a clear overlap in the regulatory subject of governance, credit granting, pricing, and monitoring expectations for financial institutions.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_85.json",
      "excerpt1": "FINAL REPORT - GUIDELINES ON LOAN ORIGINATION AND MONITORING The BSG expressed concerns that the requirements for governance and credit granting are too standardised and prescriptive. It is argued that the guidelines do not clarify the difference between credit risk and creditworthiness assessment. ... With respect to creditworthiness assessment, the BSG also suggested that there needs to be a clarification in the credit decision-making process between acceptance and refusal thresholds linked to default rates. ... The BSG also requested more flexibility and streamlining of the requirements for the monitoring framework, as the proposal of the draft guidelines is perceived as overly complex, burdensome and not proportionate to the average size of the loan portfolios. Furthermore, the BSG expressed concerns that the general monitoring requirements do not adequately reflect the specificities of institutions, borrower groups and specific loan products.",
      "pageNumber1": 85,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_83.json",
      "excerpt2": "ii. the FX lending risk is taken into account when borrowers are assessed and FX loans are underwritten also considering the guidance for creditworthiness assessment of borrowers applying for foreign currency loans as specified in the EBA Guidelines on loan origination and monitoring32;",
      "pageNumber2": 83,
      "explanation": "Both excerpts explicitly refer to the 'EBA Guidelines on loan origination and monitoring'. The original document highlights concerns from the BSG regarding the creditworthiness assessment requirements within these guidelines. The related document specifies that 'guidance for creditworthiness assessment of borrowers applying for foreign currency loans as specified in the EBA Guidelines on loan origination and monitoring' should be considered, directly referencing a key component of the guidelines that is under discussion in the original text.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_85.json",
      "excerpt1": "FINAL REPORT - GUIDELINES ON LOAN ORIGINATION AND MONITORING The BSG suggested that the EBA consider extending the deadline for the implementation of the guidelines and introducing some phase-in arrangements. ... With respect to sustainable finance, the BSG stressed the need to align all ESG-related requirements with the relevant upcoming ESG regulatory initiatives and the EBA mandates in CRR 2/CRD V and avoid front-loading the future regulatory requirements in these guidelines.",
      "pageNumber1": 85,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_87.json",
      "excerpt2": "3. Specifically, competent authorities should consider: ... b. collateral values, for performing and non-performing exposures, including to what degree they meet the requirements of the EBA Guidelines on management of non- performing and forborne exposures (for collateral used to secure non-performing exposures) and EBA Guidelines on loan origination and monitoring (for all collateral); ... e. where relevant, the guarantors' creditworthiness following the requirements of the EBA Guidelines on loan origination and monitoring.",
      "pageNumber2": 87,
      "explanation": "Both excerpts address the EBA Guidelines on loan origination and monitoring. The original document discusses general concerns and suggestions regarding the implementation and scope of these guidelines. The related document explicitly states that competent authorities should assess collateral values and guarantors' creditworthiness following the 'requirements of the EBA Guidelines on loan origination and monitoring', directly indicating that these guidelines contain requirements related to these aspects of lending, which falls under the broad subject of loan origination and monitoring.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_85.json",
      "excerpt1": "FINAL REPORT - GUIDELINES ON LOAN ORIGINATION AND MONITORING The BSG expressed concerns that the requirements for governance and credit granting are too standardised and prescriptive. It is argued that the guidelines do not clarify the difference between credit risk and creditworthiness assessment. ... The BSG also requested more flexibility and streamlining of the requirements for the monitoring framework, as the proposal of the draft guidelines is perceived as overly complex, burdensome and not proportionate to the average size of the loan portfolios. Furthermore, the BSG expressed concerns that the general monitoring requirements do not adequately reflect the specificities of institutions, borrower groups and specific loan products.",
      "pageNumber1": 85,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_88.json",
      "excerpt2": "220. To achieve a comprehensive understanding of the institution's credit risk profile, competent authorities should also review the governance and risk management framework underlying its credit activities throughout the life cycle of a loan. To this end, competent authorities should assess the following elements, also having regard to the EBA Guidelines on loan origination and monitoring and the EBA Guidelines on management of non-performing and forborne exposures:",
      "pageNumber2": 88,
      "explanation": "Both excerpts refer to the 'EBA Guidelines on loan origination and monitoring'. The original text details stakeholder concerns regarding the prescriptive nature of requirements for governance and credit granting, and the complexity of the monitoring framework within these guidelines. The related document specifies that competent authorities should review the 'governance and risk management framework underlying its credit activities throughout the life cycle of a loan' with 'regard to the EBA Guidelines on loan origination and monitoring', establishing a direct link to the same regulatory subject of governance, credit risk management, and the monitoring of credit activities.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}