{
  "summary": "The primary document, EBA GL 2020/06, discusses feedback received on its draft guidelines on loan origination and monitoring, noting concerns about the level of detail and the application of proportionality. Specifically, respondents requested more flexibility, recognition of diverse industry practices, and greater proportionality, especially for consumer and SME lending, alongside practical examples. The related content includes several documents that either explicitly reference the EBA Guidelines on loan origination and monitoring (EBA/GL/2020/06) or discuss the principle of proportionality in the context of other EBA guidelines and financial regulations. While no direct contradictions were found, there are several overlaps where other documents acknowledge or recommend compliance with the EBA Guidelines on loan origination and monitoring, or generally discuss the application of proportionality in regulatory frameworks, which was a key concern highlighted in the primary document.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_86.json",
      "excerpt1": "Many respondents thought the draft guidelines were broad, in terms of topics covered, and prescriptive and put limitations on prevailing industry practices. To this end, respondents requested more flexibility in the requirements set out in the guidelines, recognition of different current and emerging industry practices and greater proportionality in the application of the guidelines, considering that the scope of the guidelines covers a wide range of loans, from small ticket consumer credit to lending to large corporates. The respondents also cautioned against creating a 'one size fits all' approach to credit risk taking, decision-making and creditworthiness assessment.",
      "pageNumber1": 86,
      "filename2": "Final%20Guidelines%20on%20Accounting%20for%20Expected%20Credit%20Losses%20(EBA-GL-2017-06).di_page_9.json",
      "excerpt2": "14.In particular, on the considerations on proportionate application of the EBA guidelines, the EBA notes that all credit institutions applying IFRS 9 should ensure that they meet the objectives of IFRS 9 when applying the standard. However, the EBA understands that the way of meeting these objectives may differ across credit institutions; for example, different techniques or models may be used in the measurement of ECL. Credit institutions should comply with these guidelines in a proportionate manner taking into account various criteria, such as their size and internal organisation and the nature, scope and complexity of their activities and portfolios, as described in paragraph 17 of the guidelines. Credit institutions should, however, take into consideration if using practical expedients that the objective of IFRS 9 is to estimate ECL to reflect an unbiased and probability-weighted amount that is determined by evaluating a range of possible outcomes (IFRS 9, paragraph 5.5.17)",
      "pageNumber2": 9,
      "explanation": "The primary document highlights respondents' request for greater proportionality and flexibility in the application of the loan origination guidelines, especially noting concerns about a 'one size fits all' approach. The related document, EBA Guidelines on Accounting for Expected Credit Losses, explicitly details the EBA's understanding of proportionate application, stating that credit institutions should comply in a proportionate manner, taking into account their size, internal organisation, and the nature, scope, and complexity of their activities and portfolios. This demonstrates an overlap in the recognition of the proportionality principle in EBA guidelines, which directly addresses the type of concern raised by respondents in the primary document.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_86.json",
      "excerpt1": "Many respondents thought the draft guidelines were broad, in terms of topics covered, and prescriptive and put limitations on prevailing industry practices. To this end, respondents requested more flexibility in the requirements set out in the guidelines, recognition of different current and emerging industry practices and greater proportionality in the application of the guidelines, considering that the scope of the guidelines covers a wide range of loans, from small ticket consumer credit to lending to large corporates. The respondents also cautioned against creating a 'one size fits all' approach to credit risk taking, decision-making and creditworthiness assessment. The application of proportionality Respondents not only noted three types of proportionality consideration in the guidelines but also requested that additional dimensions be considered, such as the materiality of portfolios, the risk profile of the borrower and the risk profile of the portfolio or specific loan. Many respondents requested that general proportionality considerations be supplemented with practical examples of how the principle of proportionality can be applied in practice. With respect to proportionality in the creditworthiness assessment, many have pointed to the idea of having simpler approaches when dealing with consumer lending and lending to SMEs, including recognising ongoing developments in model-based assessments and credit decisions.",
      "pageNumber1": 86,
      "filename2": "EBA%20revised%20Guidelines%20on%20outsourcing%20arrangements.di_page_72.json",
      "excerpt2": "Prescriptiveness Many respondents highlighted that the guidelines should maintain sufficient flexibility for EU institutions to react and adapt to market innovations and should not introduce burdensome requirements or restrictions, which could potentially reduce competition and/or increase the costs associated with the supply of services to institutions. Respondents suggested that the guidelines should differentiate between regulatory requirements (which are mandatory) and guidance (which allows flexible and proportionate application). Overall, it was suggested that the level of detail of the guidelines be reduced. The principle of proportionality applies to the CRD, CRR and PSD and to all of the EBA guidelines. The guidelines provide further criteria for the application of this principle to ensure the consistent application of regulatory requirements. The guidelines specify the requirements set out under Level-1 text and therefore should clarify, with sufficient detail, how the requirements are to be applied in a consistent way. Please refer to the impact assessment included in this document.",
      "pageNumber2": 72,
      "explanation": "The primary document notes that respondents found the draft loan origination guidelines too prescriptive and requested more flexibility and proportionality. The related document, EBA Guidelines on Outsourcing, discusses similar feedback regarding prescriptiveness, with respondents suggesting a differentiation between mandatory requirements and flexible guidance. The EBA's response explicitly states that 'The principle of proportionality applies to the CRD, CRR and PSD and to all of the EBA guidelines,' and that the guidelines aim to clarify how these requirements are to be applied consistently. This demonstrates a general, consistent approach by the EBA to acknowledging and addressing proportionality concerns across different guidelines, which directly relates to the feedback received on the loan origination guidelines.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_86.json",
      "excerpt1": "Many respondents thought the draft guidelines were broad, in terms of topics covered, and prescriptive and put limitations on prevailing industry practices. To this end, respondents requested more flexibility in the requirements set out in the guidelines, recognition of different current and emerging industry practices and greater proportionality in the application of the guidelines, considering that the scope of the guidelines covers a wide range of loans, from small ticket consumer credit to lending to large corporates. The respondents also cautioned against creating a 'one size fits all' approach to credit risk taking, decision-making and creditworthiness assessment. The application of proportionality Respondents not only noted three types of proportionality consideration in the guidelines but also requested that additional dimensions be considered, such as the materiality of portfolios, the risk profile of the borrower and the risk profile of the portfolio or specific loan. Many respondents requested that general proportionality considerations be supplemented with practical examples of how the principle of proportionality can be applied in practice. With respect to proportionality in the creditworthiness assessment, many have pointed to the idea of having simpler approaches when dealing with consumer lending and lending to SMEs, including recognising ongoing developments in model-based assessments and credit decisions.",
      "pageNumber1": 86,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_87.json",
      "excerpt2": "In terms of the application of the proportionality principle, in the guidelines the EBA provided some examples and included considerations for institutions and competent authorities in order to indicate how the principle of proportionality should be applied in practice. These considerations include, for example, references to four distinct SREP categories and considerations in relation to NPE governance and operational aspects.",
      "pageNumber2": 87,
      "explanation": "The primary document details respondents' requests for practical examples and additional dimensions for applying the proportionality principle in the loan origination guidelines, particularly for consumer and SME lending. The related document, EBA Guidelines on Management of Non-Performing and Forborne Exposures, explicitly states that 'in the guidelines the EBA provided some examples and included considerations for institutions and competent authorities in order to indicate how the principle of proportionality should be applied in practice.' This shows a consistent approach by the EBA in addressing proportionality concerns, indicating that they do provide such practical guidance in their other guidelines, which overlaps with the requests made for the loan origination guidelines.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_86.json",
      "excerpt1": "Many respondents thought the draft guidelines were broad, in terms of topics covered, and prescriptive and put limitations on prevailing industry practices. To this end, respondents requested more flexibility in the requirements set out in the guidelines, recognition of different current and emerging industry practices and greater proportionality in the application of the guidelines, considering that the scope of the guidelines covers a wide range of loans, from small ticket consumer credit to lending to large corporates. The respondents also cautioned against creating a 'one size fits all' approach to credit risk taking, decision-making and creditworthiness assessment.",
      "pageNumber1": 86,
      "filename2": "2018_04.m3_en.di_page_11.json",
      "excerpt2": "(1) On 29 May 2020, the European Banking Authority (EBA) issued guidelines on loan origination and monitoring (EBA/GL/2020/06). The guidelines clarify, in particular, the internal governance and control framework for the credit-granting and decision-making process, specify the requirements for assessing the creditworthiness of borrowers at the point of credit granting to consumers and enterprises, and set out requirements for the information to be used in assessments. In addition, the guidelines set out supervisory expectations for the risk-based pricing of loans and provide guidance on, among other things, the valuation of immovable and movable property collateral at the point of credit granting, and the monitoring and review of the value of such collateral. The guidelines also provide specifications on the ongoing monitoring of credit risks. (Issued on 20 October 2020, valid from 30 June 2021) (2) In accordance with Article 16(3) of the EBA Regulation (1093/2010), financial institutions shall make every effort to comply with the EBA Guidelines referred to in paragraph (1). (Issued on 20 October 2020, valid from 30 June 2021) (3) The FIN-FSA recommends that supervised entities falling within the scope of these regulations and guidelines comply with the EBA Guidelines mentioned in paragraph (1), which is available at the https://www.finanssivalvonta.fi/en/. (Issued on 20 October 2020, valid from 30 June 2021) (4) The FIN-FSA recommends that all supervised entities as referred to in section 4 of the FIN-FSA Act and other financial market participants as referred to in section 5 and foreign supervised entities as referred to in section 6 comply with chapter 5 on loan origination procedures of the EBA Guidelines mentioned in paragraph (1), excluding paragraph 93 of the Guidelines, when they offer consumer loans falling within the scope of chapter 7 of the Consumer Protection Act or consumer loans related to residential property falling within the scope of chapter 7a of the Consumer Protection Act. (Issued on 20 October 2020, valid from 30 June 2021)",
      "pageNumber2": 11,
      "explanation": "The primary document is a report on the feedback received for the EBA GL on loan origination and monitoring (EBA/GL/2020/06). The related document directly references and describes the EBA/GL/2020/06, stating that the guidelines \"clarify... the internal governance and control framework for the credit-granting and decision-making process, specify the requirements for assessing the creditworthiness of borrowers... and set out requirements for the information to be used in assessments.\" It also recommends that financial institutions comply with these guidelines. This constitutes a direct overlap as both documents concern the exact same EBA Guidelines on loan origination and monitoring.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_86.json",
      "excerpt1": "Many respondents thought the draft guidelines were broad, in terms of topics covered, and prescriptive and put limitations on prevailing industry practices. To this end, respondents requested more flexibility in the requirements set out in the guidelines, recognition of different current and emerging industry practices and greater proportionality in the application of the guidelines, considering that the scope of the guidelines covers a wide range of loans, from small ticket consumer credit to lending to large corporates. The respondents also cautioned against creating a 'one size fits all' approach to credit risk taking, decision-making and creditworthiness assessment. The application of proportionality Respondents not only noted three types of proportionality consideration in the guidelines but also requested that additional dimensions be considered, such as the materiality of portfolios, the risk profile of the borrower and the risk profile of the portfolio or specific loan. Many respondents requested that general proportionality considerations be supplemented with practical examples of how the principle of proportionality can be applied in practice. With respect to proportionality in the creditworthiness assessment, many have pointed to the idea of having simpler approaches when dealing with consumer lending and lending to SMEs, including recognising ongoing developments in model-based assessments and credit decisions.",
      "pageNumber1": 86,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_83.json",
      "excerpt2": "ii. the FX lending risk is taken into account when borrowers are assessed and FX loans are underwritten also considering the guidance for creditworthiness assessment of borrowers applying for foreign currency loans as specified in the EBA Guidelines on loan origination and monitoring32;",
      "pageNumber2": 83,
      "explanation": "The primary document discusses feedback on the EBA Guidelines on loan origination and monitoring (EBA/GL/2020/06), specifically mentioning creditworthiness assessment and proportionality. The related document from the SREP Guidelines directly references the EBA Guidelines on loan origination and monitoring (EBA/GL/2020/06) as providing guidance for creditworthiness assessment of borrowers. This establishes a clear overlap where both documents pertain to the same core regulatory subject: creditworthiness assessment within the context of the EBA Guidelines on loan origination and monitoring.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_86.json",
      "excerpt1": "The level of detail Many respondents thought the draft guidelines were broad, in terms of topics covered, and prescriptive and put limitations on prevailing industry practices. To this end, respondents requested more flexibility in the requirements set out in the guidelines, recognition of different current and emerging industry practices and greater proportionality in the application of the guidelines, considering that the scope of the guidelines covers a wide range of loans, from small ticket consumer credit to lending to large corporates. The respondents also cautioned against creating a 'one size fits all' approach to credit risk taking, decision-making and creditworthiness assessment.",
      "pageNumber1": 86,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_88.json",
      "excerpt2": "220. To achieve a comprehensive understanding of the institution's credit risk profile, competent authorities should also review the governance and risk management framework underlying its credit activities throughout the life cycle of a loan. To this end, competent authorities should assess the following elements, also having regard to the EBA Guidelines on loan origination and monitoring and the EBA Guidelines on management of non-performing and forborne exposures:",
      "pageNumber2": 88,
      "explanation": "The primary document is a report on the feedback received for the EBA Guidelines on loan origination and monitoring. The related document, which focuses on SREP and supervisory stress testing, explicitly refers to the 'EBA Guidelines on loan origination and monitoring' as a document to be considered when competent authorities review the governance and risk management framework for credit activities throughout the life cycle of a loan. This directly links the two documents to the same regulatory subject and specific EBA guidelines, indicating an overlap.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_86.json",
      "excerpt1": "The application of proportionality Respondents not only noted three types of proportionality consideration in the guidelines but also requested that additional dimensions be considered, such as the materiality of portfolios, the risk profile of the borrower and the risk profile of the portfolio or specific loan. Many respondents requested that general proportionality considerations be supplemented with practical examples of how the principle of proportionality can be applied in practice. With respect to proportionality in the creditworthiness assessment, many have pointed to the idea of having simpler approaches when dealing with consumer lending and lending to SMEs, including recognising ongoing developments in model-based assessments and credit decisions.",
      "pageNumber1": 86,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_90.json",
      "excerpt2": "General comments Level of details prescriptiveness and Two stakeholders commented that the guidelines were overly prescriptive, that the EBA should follow The objective of these guidelines is to create greater convergence of supervisory practices and promote a structured approach to managing and ultimately reducing NPEs. The EBA is of the view that the framework and requirements set out in these guidelines are proportionate to these objectives and reflect the existing best practices in the area as Where applicable, the EBA has reviewed the wording used throughout the guidelines to ensure that the requirements are proportionate and in line with the objectives of the guidelines.",
      "pageNumber2": 90,
      "explanation": "The primary document describes feedback on the draft loan origination guidelines, where respondents found them prescriptive and requested more flexibility and proportionality. The related document, EBA Guidelines on Management of Non-Performing and Forborne Exposures, contains similar feedback from stakeholders complaining about prescriptiveness. The EBA's response indicates that they reviewed the wording in their guidelines to ensure requirements are proportionate. This shows a common theme of addressing concerns regarding prescriptiveness and proportionality across different EBA guidelines, creating an overlap in the regulatory approach to these principles.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_86.json",
      "excerpt1": "The application of proportionality Respondents not only noted three types of proportionality consideration in the guidelines but also requested that additional dimensions be considered, such as the materiality of portfolios, the risk profile of the borrower and the risk profile of the portfolio or specific loan. Many respondents requested that general proportionality considerations be supplemented with practical examples of how the principle of proportionality can be applied in practice. With respect to proportionality in the creditworthiness assessment, many have pointed to the idea of having simpler approaches when dealing with consumer lending and lending to SMEs, including recognising ongoing developments in model-based assessments and credit decisions.",
      "pageNumber1": 86,
      "filename2": "Final%20Guidelines%20on%20Accounting%20for%20Expected%20Credit%20Losses%20(EBA-GL-2017-06).di_page_86.json",
      "excerpt2": "Question 5 (Impact assessment) A few respondents expressed preference for approach 2.1, 'Application of the guidelines in a proportionate manner without defining specific criteria'. A few respondents mentioned that the application of the proportionality approach and Please refer to Question 3 (proportionality approach), where it is explained that the guidelines have been amended to remove the reference to smaller and less complex credit institutions. The EBA acknowledges that the proposed reference in the Amendment in impact assessment section (options 2.2, 2.3 and preferred option) of the draft",
      "pageNumber2": 86,
      "explanation": "The primary document indicates respondents requested a more flexible and proportionate application of the loan origination guidelines. The related document, EBA Guidelines on Accounting for Expected Credit Losses, discusses similar feedback on its draft, where respondents preferred an 'Application of the guidelines in a proportionate manner without defining specific criteria'. The EBA's response refers to amendments made regarding the proportionality approach. This signifies an overlap in the ongoing discussion and refinement of the proportionality principle within various EBA guidelines in response to stakeholder feedback.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_86.json",
      "excerpt1": "The implementation timeline Many respondents requested a longer implementation period and/or transitional/phase-in arrangements. It was argued that the implementation of the guidelines would be costly and time- consuming, especially for IT developments and the collection of missing information from borrowers. Another argument for the delay was the ongoing and future regulatory developments and the need to ensure better consistency between the requirements of the draft guidelines and (future) Level 1 regulatory requirements. On this point, respondents suggested waiting for the finalisation of the reviews of the MCD and the CCD, in order to ensure consistency with future potential changes to the creditworthiness requirements set out in those directives. Respondents suggested that the EBA delay the introduction, in these guidelines, of any requirements for sustainable finance, green lending and ESG factors as part of credit analysis until the finalisation of other planned developments in the policy area, such as at the EU Commission Taxonomy or the EBA's ongoing and future initiatives and mandates.",
      "pageNumber1": 86,
      "filename2": "EBA%20revised%20Guidelines%20on%20outsourcing%20arrangements.di_page_107.json",
      "excerpt2": "Some respondents pointed out that, despite the importance of the ESG factors, no agreed taxonomy exists and guidance on how to integrate them into outsourcing arrangements would be more appropriate than simply mandating specific standards that may not be suitable for the service to be provided each time. The guidelines refer to the code of conduct of the institution and to human rights; institutions need to comply with both, even if they have outsourced functions. The framework for sustainable finance, including ESG factors, will be developed in more detail in the future.",
      "pageNumber2": 107,
      "explanation": "The primary document includes respondents' suggestion to delay the introduction of sustainable finance, green lending, and ESG factors in credit analysis within the loan origination guidelines, citing ongoing policy developments (e.g., EU Commission Taxonomy, other EBA initiatives). The related document, EBA Guidelines on Outsourcing, also addresses concerns about ESG factors, noting that 'no agreed taxonomy exists' and that the 'framework for sustainable finance, including ESG factors, will be developed in more detail in the future.' This common recognition of the evolving nature and lack of finality in ESG taxonomy and sustainable finance frameworks, and the implication for regulatory implementation, represents an overlap in the practical challenges faced by institutions and regulators in integrating ESG factors.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}