{
  "summary": "The analysis reveals several overlaps concerning the monitoring of credit exposures, borrowers, and collateral, as well as the management of credit concentration risk. The EBA Guidelines on Loan Origination and Monitoring set out direct obligations for institutions regarding what they should monitor. Several other documents, particularly those related to SREP and CRR, either refer to these EBA Guidelines as the standard for institutions to follow or describe the supervisory assessment of institutions' compliance with similar monitoring requirements, thereby establishing an overlap in the regulatory subject and the expected rules of conduct.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_62.json",
      "excerpt1": "251. As part of the monitoring of credit exposures and borrowers, institutions should monitor all outstanding amounts and limits, and whether the borrower is meeting repayment obligations, as laid down in the credit agreement, and is in line with the conditions set at the point of credit granting, such as adherence to credit metrics and covenants. 252. 2. Institutions should also monitor whether the borrower and collateral are in line with the credit risk policies and conditions set at the point of credit granting, e.g. whether the value of collateral and other credit enhancement techniques are maintained, whether any applicable covenants are maintained, and whether there has been a negative development in these factors or in other factors that affect the risk profile of the borrower and/or credit facilities. 253. Institutions should continuously monitor and assess the quality of credit exposures and the financial situation of borrowers, to ensure that subsequent changes in credit risk, in respect of the initial recognition of the lending exposures, can be identified and quantified. 254. The ongoing monitoring should be based on internal information regarding the credit facilities and borrowers' payment practices, as well as the use of external sources (e.g. credit bureaux, directly from the borrower), when relevant. 255. In addition, institutions should also monitor concentration measures against the values specified in their credit risk appetite, policies and procedures, including, where relevant, by product, geography, industry, collateral features (type, location), and quality of portfolios, sub- portfolios and exposures.",
      "pageNumber1": 62,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_92.json",
      "excerpt2": "226. In this regard, competent authorities should consider whether the institutions have adequate data infrastructure that meets the requirements of the EBA Guidelines on loan origination and monitoring, and of the EBA Guidelines on management of non-performing and forborne exposures and whether analytical techniques are appropriate to enable the institution to adequately manage their credit risk, and to fulfil supervisory reporting requirements, and to detect, measure and regularly monitor the credit risk inherent in all on- and off-balance-sheet activities (where relevant at group level), in particular with regard to: a. the borrower/counterparty/transaction's credit risk and eligibility; b. credit exposures (irrespective of their nature) of borrowers and, where relevant, of groups of connected borrowers; c. guarantee and collateral coverage (including netting agreements) and eligibility of this coverage; d. ongoing compliance with the contractual terms and agreements (covenants); e. unauthorised overdrafts and conditions for reclassification of credit exposures; and f. relevant sources of credit concentration risk.",
      "pageNumber2": 92,
      "explanation": "Both excerpts address the monitoring of credit exposures and borrowers, including adherence to covenants, collateral coverage, and concentration risk. The first excerpt (EBA GL on Loan Origination and Monitoring) specifies the requirements for institutions to monitor these aspects, while the second excerpt (SREP Guidelines) outlines how competent authorities should assess institutions' compliance with such monitoring, explicitly referencing the EBA Guidelines on loan origination and monitoring. This indicates a clear overlap in the regulatory subject and the expected standards of conduct for institutions.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_62.json",
      "excerpt1": "252. 2. Institutions should also monitor whether the borrower and collateral are in line with the credit risk policies and conditions set at the point of credit granting, e.g. whether the value of collateral and other credit enhancement techniques are maintained, whether any applicable covenants are maintained, and whether there has been a negative development in these factors or in other factors that affect the risk profile of the borrower and/or credit facilities. 253. Institutions should continuously monitor and assess the quality of credit exposures and the financial situation of borrowers, to ensure that subsequent changes in credit risk, in respect of the initial recognition of the lending exposures, can be identified and quantified. 254. The ongoing monitoring should be based on internal information regarding the credit facilities and borrowers' payment practices, as well as the use of external sources (e.g. credit bureaux, directly from the borrower), when relevant.",
      "pageNumber1": 62,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_131.json",
      "excerpt2": "3. The following requirements on monitoring of property values and on property valuation shall be met: (a) institutions monitor the value of the property on a frequent basis and at a minimum once every year for commercial immovable property and once every three years for resi- dential real estate. Institutions carry out more frequent monitoring where the market is subject to significant changes in conditions; (b) the property valuation is reviewed when information available to institutions indicates that the value of the property may have declined materially relative to general market prices and that review is carried out by a valuer who possesses the necessary qualifications, ability and experience to execute a valuation and who is independent from the credit decision process. For loans exceeding EUR 3 million or 5% of the own funds of an institution, the property valuation shall be reviewed by such valuer at least every three years. Institutions may use statistical methods to monitor the value of the property and to identify property that needs revaluation. 5. Institutions shall have in place procedures to monitor that the property taken as credit protection is adequately insured against the risk of damage. Article 209 Requirements for receivables 3. The following requirements on risk management shall be met: (b) ... Institutions shall maintain a continuous monitoring process appropriate to the receiv- ables. They shall also review, on a regular basis, compliance with loan covenants, environmental restrictions, and other legal requirements;",
      "pageNumber2": 131,
      "explanation": "Both excerpts establish requirements for institutions to monitor the value and conditions of collateral (immovable property and receivables) and compliance with loan covenants. Excerpt 1 (EBA GL) states that institutions should monitor if collateral is in line with policies and if its value is maintained. Excerpt 2 (CRR) provides specific rules for the frequency of property value monitoring, valuation review processes, and monitoring of compliance with loan covenants for receivables. This represents an overlap in the obligation to monitor collateral and covenants.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_62.json",
      "excerpt1": "252. 2. Institutions should also monitor whether the borrower and collateral are in line with the credit risk policies and conditions set at the point of credit granting, e.g. whether the value of collateral and other credit enhancement techniques are maintained, whether any applicable covenants are maintained, and whether there has been a negative development in these factors or in other factors that affect the risk profile of the borrower and/or credit facilities. 253. Institutions should continuously monitor and assess the quality of credit exposures and the financial situation of borrowers, to ensure that subsequent changes in credit risk, in respect of the initial recognition of the lending exposures, can be identified and quantified.",
      "pageNumber1": 62,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_87.json",
      "excerpt2": "213. 3. Specifically, competent authorities should consider: b. collateral values, for performing and non-performing exposures, including to what degree they meet the requirements of the EBA Guidelines on management of non- performing and forborne exposures (for collateral used to secure non-performing exposures) and EBA Guidelines on loan origination and monitoring (for all collateral); e. where relevant, the guarantors' creditworthiness following the requirements of the EBA Guidelines on loan origination and monitoring.",
      "pageNumber2": 87,
      "explanation": "Both excerpts deal with the monitoring and assessment of collateral values and creditworthiness. The EBA GL on Loan Origination and Monitoring (excerpt 1) establishes the institution's responsibility to monitor collateral and borrower financial situation. The SREP Guidelines (excerpt 2) explicitly states that competent authorities should consider whether institutions' collateral values and guarantor creditworthiness meet the requirements of the EBA Guidelines on Loan Origination and Monitoring. This direct reference indicates an overlap in the regulatory subject and the expected standards.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_62.json",
      "excerpt1": "255. In addition, institutions should also monitor concentration measures against the values specified in their credit risk appetite, policies and procedures, including, where relevant, by product, geography, industry, collateral features (type, location), and quality of portfolios, sub- portfolios and exposures.",
      "pageNumber1": 62,
      "filename2": "BaselFramework.di_page_1280.json",
      "excerpt2": "30.22 The growth of market-based intermediation has increased the possibility that different areas of a bank are exposed to a common set of products, risk factors or counterparties. This has created new challenges for risk aggregation and concentration management. Through its risk management processes and MIS, a bank should be able to identify and aggregate similar risk exposures across the firm, including across legal entities, asset types (eg loans, derivatives and structured products), risk areas (eg the trading book) and geographic regions. The typical situations in which risk concentrations can arise include: (1) exposures to a single counterparty, borrower or group of connected counterparties or borrowers; (2) industry or economic sectors, including exposures to both regulated and nonregulated financial institutions such as hedge funds and private equity firms; (3) geographical regions; (4) exposures arising from credit risk mitigation techniques, including exposure to similar collateral types or to a single or closely related credit protection provider; (5) trading exposures/market risk; (6) exposures to counterparties (eg hedge funds and hedge counterparties) through the execution or processing of transactions (either product or service); (7) funding sources; (8) assets that are held in the banking book or trading book, such as loans, derivatives and structured products; and (9) off-balance sheet exposures, including guarantees, liquidity lines and other commitments.",
      "pageNumber2": 1280,
      "explanation": "Both excerpts address the monitoring and management of credit concentration risk. The EBA GL (excerpt 1) requires institutions to monitor concentration measures by various factors including product, geography, industry, and collateral features. The Basel Framework (excerpt 2) details typical situations where risk concentrations arise, covering similar categories like exposures to single counterparties/groups, industry/economic sectors, geographical regions, and exposures arising from credit risk mitigation techniques (collateral types). This constitutes an overlap in the specific aspects of concentration risk that institutions must monitor.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_62.json",
      "excerpt1": "255. In addition, institutions should also monitor concentration measures against the values specified in their credit risk appetite, policies and procedures, including, where relevant, by product, geography, industry, collateral features (type, location), and quality of portfolios, sub- portfolios and exposures.",
      "pageNumber1": 62,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_36.json",
      "excerpt2": "105. Credit institutions should carry out such monitoring activities at transaction/borrower level, and portfolio or subportfolio levels, as appropriate, considering aspects such as business line, borrower segment, geographical area, products, concentration risk, level of collateralisation and type of collateral provided, and debt-service ability.",
      "pageNumber2": 36,
      "explanation": "Both excerpts mandate institutions to monitor concentration risk. The EBA GL on Loan Origination and Monitoring (excerpt 1) requires monitoring concentration measures by product, geography, industry, collateral features, and portfolio quality. The EBA GL on NPLs (excerpt 2) specifies monitoring activities at transaction/borrower and portfolio levels, considering aspects like business line, geographical area, products, and concentration risk, including type of collateral. This is a direct overlap in the requirement for institutions to monitor credit concentration risk across similar categories.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_62.json",
      "excerpt1": "252. 2. Institutions should also monitor whether the borrower and collateral are in line with the credit risk policies and conditions set at the point of credit granting, e.g. whether the value of collateral and other credit enhancement techniques are maintained, whether any applicable covenants are maintained, and whether there has been a negative development in these factors or in other factors that affect the risk profile of the borrower and/or credit facilities.",
      "pageNumber1": 62,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_132.json",
      "excerpt2": "Article 210 Requirements for other physical collateral Physical collateral other than immovable property collateral shall qualify as eligible collateral under the IRB Approach where all the following conditions are met: (c) institutions shall monitor the value of the collateral on a frequent basis and at least once every year. Institutions shall carry out more frequent monitoring where the market is subject to significant changes in conditions; (d) the loan agreement shall include detailed descriptions of the collateral as well as detailed specifications of the manner and frequency of revaluation; (i) the collateral taken as protection shall be adequately insured against the risk of damage and institutions shall have in place procedures to monitor this.",
      "pageNumber2": 132,
      "explanation": "Both excerpts impose obligations on institutions to monitor collateral. The EBA GL (excerpt 1) broadly requires institutions to monitor if collateral is in line with credit risk policies and if its value is maintained. The CRR (excerpt 2) provides more specific requirements for 'other physical collateral,' mandating frequent monitoring of collateral value (at least annually, more frequently if market changes significantly), detailed descriptions and revaluation frequency in loan agreements, and procedures to monitor adequate insurance of collateral. This demonstrates an overlap in the general requirement to monitor collateral value and condition, with CRR adding specific details.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_62.json",
      "excerpt1": "252. 2. Institutions should also monitor whether the borrower and collateral are in line with the credit risk policies and conditions set at the point of credit granting, e.g. whether the value of collateral and other credit enhancement techniques are maintained, whether any applicable covenants are maintained, and whether there has been a negative development in these factors or in other factors that affect the risk profile of the borrower and/or credit facilities.",
      "pageNumber1": 62,
      "filename2": "2018_04.m3_en.di_page_17.json",
      "excerpt2": "(41) Supervised entities must have documented procedures and guidelines for: · accepting different types of collateral · regularly monitoring and assessing collateral values4 · collateral valuation (hair-cut) · ensuring that collateral is binding, adequate and realisable · identifying any concentrations of risk arising from collateral. (42) Supervised entities must establish acceptable types of collateral as well as collateral valuation percentages for each type of acceptable collateral. The valuation percentages shall be consistent with a prudential maximum limit for the relevant types of collateral. However, collateral value must always be based on a case-specific assessment, and special attention should be paid on collateral whose fair value cannot be considered stable.",
      "pageNumber2": 17,
      "explanation": "Both excerpts address the monitoring and valuation of collateral by institutions. The EBA GL (excerpt 1) requires institutions to monitor if collateral is in line with credit risk policies and if its value is maintained. The FIN-FSA Regulations (excerpt 2) specify that supervised entities must have documented procedures for regularly monitoring and assessing collateral values, including valuation percentages, and ensuring collateral is binding, adequate, and realisable. This represents an overlap in the requirement to monitor and assess collateral values.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_62.json",
      "excerpt1": "253. Institutions should continuously monitor and assess the quality of credit exposures and the financial situation of borrowers, to ensure that subsequent changes in credit risk, in respect of the initial recognition of the lending exposures, can be identified and quantified.",
      "pageNumber1": 62,
      "filename2": "Final%20Guidelines%20on%20Accounting%20for%20Expected%20Credit%20Losses%20(EBA-GL-2017-06).di_page_21.json",
      "excerpt2": "33. Sound methodologies for assessing credit risk and measuring the level of allowances (subject to exposure type, for example retail or wholesale) should, in particular: a. include a robust process that is designed to equip the credit institution with the ability to identify the level, nature and drivers of credit risk upon initial recognition of the lending exposure, to ensure that subsequent changes in credit risk can be identified and quantified;",
      "pageNumber2": 21,
      "explanation": "Both excerpts impose a requirement for institutions to identify and quantify changes in credit risk over time. The EBA GL on Loan Origination and Monitoring (excerpt 1) states that institutions should continuously monitor and assess exposure quality and borrower financial situation to identify and quantify subsequent changes in credit risk. The EBA GL on ECL (excerpt 2) specifies that sound methodologies for assessing credit risk should include a robust process to identify the level, nature, and drivers of credit risk upon initial recognition to ensure subsequent changes can be identified and quantified. This is a clear overlap in the objective and requirement for institutions to track credit risk evolution.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_62.json",
      "excerpt1": "252. 2. Institutions should also monitor whether the borrower and collateral are in line with the credit risk policies and conditions set at the point of credit granting, e.g. whether the value of collateral and other credit enhancement techniques are maintained, whether any applicable covenants are maintained, and whether there has been a negative development in these factors or in other factors that affect the risk profile of the borrower and/or credit facilities.",
      "pageNumber1": 62,
      "filename2": "BaselFramework.di_page_415.json",
      "excerpt2": "36.140The bank must maintain a continuous monitoring process that is appropriate for the specific exposures (either immediate or contingent) attributable to the collateral to be utilised as a risk mitigant. This process may include, as appropriate and relevant, ageing reports, control of trade documents, borrowing base certificates, frequent audits of collateral, confirmation of accounts, control of the proceeds of accounts paid, analyses of dilution (credits given by the borrower to the issuers) and regular financial analysis of both the borrower and the issuers of the receivables, especially in the case when a small number of large-sized receivables are taken as collateral. Observance of the bank's overall concentration limits should be monitored. Additionally, compliance with loan covenants, environmental restrictions, and other legal requirements should be reviewed on a regular basis.",
      "pageNumber2": 415,
      "explanation": "Both excerpts address the continuous monitoring of collateral and compliance with loan covenants. The EBA GL (excerpt 1) requires institutions to monitor whether collateral is in line with policies, its value is maintained, and covenants are met. The Basel Framework (excerpt 2) states that banks must maintain a continuous monitoring process for collateral and regularly review compliance with loan covenants. This is a clear overlap in the ongoing monitoring requirements for collateral and covenants.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_62.json",
      "excerpt1": "255. In addition, institutions should also monitor concentration measures against the values specified in their credit risk appetite, policies and procedures, including, where relevant, by product, geography, industry, collateral features (type, location), and quality of portfolios, sub- portfolios and exposures.",
      "pageNumber1": 62,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_516.json",
      "excerpt2": "Paragraph 35M requires the disclosure of information about an entity's credit risk exposure and significant concentrations of credit risk at the reporting date. A concentration of credit risk exists when a number of counterparties are located in a geographical region or are engaged in similar activities and have similar economic characteristics that would cause their ability to meet contractual obligations to be similarly affected by changes in economic or other conditions. An entity should provide information that enables users of financial statements to understand whether there are groups or portfolios of financial instruments with particular features that could affect a large portion of that group of financial instruments such as concentration to particular risks. This could include, for example, loan-to-value groupings, geographical, industry or issuer-type concentrations.",
      "pageNumber2": 516,
      "explanation": "Both excerpts address the monitoring and reporting of credit concentration risk by institutions. The EBA GL (excerpt 1) requires institutions to monitor concentration measures by product, geography, industry, collateral features, and portfolio quality. The IFRS (excerpt 2) requires disclosure of information about significant concentrations of credit risk, specifying that a concentration exists when counterparties are located in a geographical region or are engaged in similar activities and mentions examples such as geographical and industry concentrations. This is an overlap in the recognition and monitoring of credit concentration risk across similar dimensions.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_62.json",
      "excerpt1": "252. 2. Institutions should also monitor whether the borrower and collateral are in line with the credit risk policies and conditions set at the point of credit granting, e.g. whether the value of collateral and other credit enhancement techniques are maintained, whether any applicable covenants are maintained, and whether there has been a negative development in these factors or in other factors that affect the risk profile of the borrower and/or credit facilities.",
      "pageNumber1": 62,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_57.json",
      "excerpt2": "227. Credit institutions should have databases of transactions to enable the proper assessment, monitoring and control of credit risk, to respond to requests from management and supervisors, and to enable the provision of information in periodic reports and other timely and comprehensive documentation. In particular, databases should comply with the following requirements: a) sufficient depth and breadth, in that they cover all the significant risk factors; b) accuracy, integrity, reliability and timeliness of data; c) consistency - they should be based on common sources of information and uniform definitions of the concepts used for credit risk control; d) traceability, such that the source of information can be identified. 228. These databases should include all the relevant information on properties and other collateral for the credit institutions' transactions and on the links between collateral and specific transactions.",
      "pageNumber2": 57,
      "explanation": "Both excerpts relate to the monitoring of collateral and credit risk by institutions. The EBA GL on Loan Origination and Monitoring (excerpt 1) requires institutions to monitor collateral in line with policies and the maintenance of its value. The EBA GL on NPLs (excerpt 2) specifies that credit institutions should have databases for proper assessment, monitoring, and control of credit risk, which should include all relevant information on properties and other collateral and their links to transactions. This is an overlap in the requirement for institutions to maintain robust systems and data for monitoring collateral as part of credit risk management.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_62.json",
      "excerpt1": "251. As part of the monitoring of credit exposures and borrowers, institutions should monitor all outstanding amounts and limits, and whether the borrower is meeting repayment obligations, as laid down in the credit agreement, and is in line with the conditions set at the point of credit granting, such as adherence to credit metrics and covenants.",
      "pageNumber1": 62,
      "filename2": "BaselFramework.di_page_1789.json",
      "excerpt2": "(3) The supervisor requires and regularly determines that such policies and processes establish an appropriate and properly controlled credit risk environment, including: (c) effective credit administration policies and processes, including: continued analysis of a borrower's ability and willingness to make all payments associated with the contractual arrangements (including reviews of the performance of underlying assets, eg for securitisation exposures or project finance); monitoring of documentation, legal covenants, contractual requirements, collateral and other forms of credit risk mitigation; and an appropriate exposure grading or classification system;",
      "pageNumber2": 1789,
      "explanation": "Both excerpts address the monitoring of borrowers' repayment obligations and compliance with covenants. The EBA GL on Loan Origination and Monitoring (excerpt 1) requires institutions to monitor if the borrower is meeting repayment obligations and adhering to credit metrics and covenants. The Basel Framework (excerpt 2) states that supervisors require effective credit administration policies and processes, including continued analysis of a borrower's ability/willingness to pay and monitoring of legal covenants and contractual requirements. This represents an overlap in the regulatory subject of monitoring borrower performance and adherence to contractual terms.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_62.json",
      "excerpt1": "252. 2. Institutions should also monitor whether the borrower and collateral are in line with the credit risk policies and conditions set at the point of credit granting, e.g. whether the value of collateral and other credit enhancement techniques are maintained, whether any applicable covenants are maintained, and whether there has been a negative development in these factors or in other factors that affect the risk profile of the borrower and/or credit facilities.",
      "pageNumber1": 62,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_130.json",
      "excerpt2": "4. Institutions shall fulfil all the following operational requirements: (d) they shall calculate the market value of the collateral, and revalue it accordingly, at least once every six months and whenever they have reason to believe that a significant decrease in the market value of the collateral has occurred;",
      "pageNumber2": 130,
      "explanation": "Both excerpts define rules for institutions regarding the monitoring and revaluation of collateral. The EBA GL (excerpt 1) requires institutions to monitor whether the value of collateral is maintained. The CRR (excerpt 2) provides a specific frequency for this monitoring, stating that institutions shall calculate and revalue the market value of collateral at least once every six months, and whenever a significant decrease in value is believed to have occurred. This is a clear overlap in the requirement for ongoing collateral valuation, with CRR adding specific frequency rules.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}