{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring (EBA GL 2020/06) outline various quantitative and qualitative criteria that institutions should specify for general loan origination and, more specifically, for commercial real estate (CRE) lending. These include maximum loan amounts, maturities, various ratio limits (LTV, DSCR, IRR, EBITDA, leverage, D/E, L/C, CFFDS, RoE, capitalization rate), risk-based limits, and environmental risk standards. For CRE, it adds criteria like specific forms of CRE to finance, minimum equity levels, and standards for development lending stages. The Basel Framework (BaselFramework.di_page_296.json and BaselFramework.di_page_235.json) provides definitions for different types of real estate exposures, such as Income-Producing Real Estate (IPRE), High-Volatility Commercial Real Estate (HVCRE), and 'materially dependent on cash flows generated by the property'. While the EBA GL prescribes the *types of limits and standards* institutions should set for CRE lending, the Basel Framework defines *categories* of CRE lending, which informs the application of such limits. This constitutes an overlap in the regulatory subject of defining and categorizing commercial real estate exposures for the purpose of lending, where both documents contribute to the understanding and structuring of these lending activities for institutions.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_69.json",
      "excerpt1": "Commercial real estate lending In addition to the general criteria for lending to micro, small, medium-sized and large enterprises specified above, institutions should specify the following product type-specific criteria: 1. Specific forms of CRE that an institution intends to finance (office, retail, industrial and multi- family residential, which is not owned and occupied by households; it can be defined as land, and the building(s) on it, that generates profit or income from capital gains or rents)",
      "pageNumber1": 69,
      "filename2": "BaselFramework.di_page_296.json",
      "excerpt2": "30.14 IPRE lending refers to a method of providing funding to real estate (such as, office buildings to let, retail space, multifamily residential buildings, industrial or warehouse space, or hotels) where the prospects for repayment and recovery on the exposure depend primarily on the cash flows generated by the asset. The primary source of these cash flows would generally be lease or rental payments or the sale of the asset. The borrower may be, but is not required to be, an SPE, an operating company focused on real estate construction or holdings, or an operating company with sources of revenue other than real estate. The distinguishing characteristic of IPRE versus other corporate exposures that are collateralised by real estate is the strong positive correlation between the prospects for repayment of the exposure and the prospects for recovery in the event of default, with both depending primarily on the cash flows generated by a property. High-volatility commercial real estate lending 30.15 HVCRE lending is the financing of commercial real estate that exhibits higher loss rate volatility (ie higher asset correlation) compared to other types of SL. HVCRE includes: (1) Commercial real estate exposures secured by properties of types that are categorised by the national supervisor as sharing higher volatilities in portfolio default rates; (2) Loans financing any of the land acquisition, development and construction (ADC) phases for properties of those types in such jurisdictions; and 3) Loans financing ADC of any other properties where the source of repayment at origination of the exposure is either the future uncertain sale of the property or cash flows whose source of repayment is substantially uncertain (eg the property has not yet been leased to the occupancy rate prevailing in that geographic market for that type of commercial real estate), unless the borrower has substantial equity at risk. Commercial ADC loans exempted from treatment as HVCRE loans on the basis of certainty of repayment or borrower equity are, however, ineligible for the additional reductions for SL exposures described in CRE33.4.",
      "pageNumber2": 296,
      "explanation": "Both excerpts address the classification and definition of commercial real estate (CRE) lending for institutions. The EBA GL requires institutions to specify the 'Specific forms of CRE that an institution intends to finance', providing examples like 'office, retail, industrial and multi-family residential'. The Basel Framework defines 'IPRE lending' (Income-Producing Real Estate) which includes 'office buildings to let, retail space, multifamily residential buildings, industrial or warehouse space, or hotels' and also defines 'HVCRE lending' (High-Volatility Commercial Real Estate) which includes 'Commercial real estate exposures secured by properties of types that are categorised by the national supervisor as sharing higher volatilities in portfolio default rates' and 'Loans financing any of the land acquisition, development and construction (ADC) phases'. These definitions and requirements overlap as they pertain to the precise categorization and description of commercial real estate types that institutions are involved in financing.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_69.json",
      "excerpt1": "Commercial real estate lending In addition to the general criteria for lending to micro, small, medium-sized and large enterprises specified above, institutions should specify the following product type-specific criteria: [...] 3. Risk-based limits for lending for speculative development lending 4. Standards to assess the various stages of the CRE development/construction in relation to the loan drawdown",
      "pageNumber1": 69,
      "filename2": "BaselFramework.di_page_296.json",
      "excerpt2": "30.15 HVCRE lending is the financing of commercial real estate that exhibits higher loss rate volatility (ie higher asset correlation) compared to other types of SL. HVCRE includes: (1) Commercial real estate exposures secured by properties of types that are categorised by the national supervisor as sharing higher volatilities in portfolio default rates; (2) Loans financing any of the land acquisition, development and construction (ADC) phases for properties of those types in such jurisdictions; and 3) Loans financing ADC of any other properties where the source of repayment at origination of the exposure is either the future uncertain sale of the property or cash flows whose source of repayment is substantially uncertain (eg the property has not yet been leased to the occupancy rate prevailing in that geographic market for that type of commercial real estate), unless the borrower has substantial equity at risk. Commercial ADC loans exempted from treatment as HVCRE loans on the basis of certainty of repayment or borrower equity are, however, ineligible for the additional reductions for SL exposures described in CRE33.4.",
      "pageNumber2": 296,
      "explanation": "Both excerpts address 'speculative development lending' or 'land acquisition, development and construction (ADC) phases' within commercial real estate. The EBA GL mandates institutions to establish 'Risk-based limits for lending for speculative development lending' and 'Standards to assess the various stages of the CRE development/construction in relation to the loan drawdown'. The Basel Framework explicitly includes 'Loans financing any of the land acquisition, development and construction (ADC) phases' as part of High-Volatility Commercial Real Estate (HVCRE) lending. This indicates a shared regulatory subject concerning the specific risks and categorization of development and construction financing in CRE, requiring institutions to establish policies and limits around such activities.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_69.json",
      "excerpt1": "Commercial real estate lending In addition to the general criteria for lending to micro, small, medium-sized and large enterprises specified above, institutions should specify the following product type-specific criteria: [...] 2. The minimum levels of equity to be provided by the borrower and the market value of the CRE mortgaged property",
      "pageNumber1": 69,
      "filename2": "BaselFramework.di_page_296.json",
      "excerpt2": "30.15 HVCRE lending is the financing of commercial real estate that exhibits higher loss rate volatility (ie higher asset correlation) compared to other types of SL. HVCRE includes: [...] 3) Loans financing ADC of any other properties where the source of repayment at origination of the exposure is either the future uncertain sale of the property or cash flows whose source of repayment is substantially uncertain (eg the property has not yet been leased to the occupancy rate prevailing in that geographic market for that type of commercial real estate), unless the borrower has substantial equity at risk. Commercial ADC loans exempted from treatment as HVCRE loans on the basis of certainty of repayment or borrower equity are, however, ineligible for the additional reductions for SL exposures described in CRE33.4.",
      "pageNumber2": 296,
      "explanation": "Both excerpts address the role of borrower equity in commercial real estate (CRE) lending, particularly in the context of development or high-risk lending. The EBA GL requires institutions to specify 'The minimum levels of equity to be provided by the borrower' for CRE lending. The Basel Framework, in its definition of HVCRE lending, states that certain ADC loans are considered HVCRE 'unless the borrower has substantial equity at risk'. This directly links the presence of borrower equity to the risk assessment and categorization of CRE loans, creating an overlap in the regulatory focus on borrower equity as a critical factor in CRE lending.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_69.json",
      "excerpt1": "Commercial real estate lending In addition to the general criteria for lending to micro, small, medium-sized and large enterprises specified above, institutions should specify the following product type-specific criteria: [...] 1. Specific forms of CRE that an institution intends to finance (office, retail, industrial and multi- family residential, which is not owned and occupied by households; it can be defined as land, and the building(s) on it, that generates profit or income from capital gains or rents)",
      "pageNumber1": 69,
      "filename2": "BaselFramework.di_page_235.json",
      "excerpt2": "Definition of exposures that are \"materially dependent on cash flows generated by the property\" 20.79 Regulatory real estate exposures (both residential and commercial) are classified as exposures that are \"materially dependent on cash flows generated by the property\" when the prospects for servicing the loan materially depend on the cash flows generated by the property securing the loan rather than on the underlying capacity of the borrower to service the debt from other sources. The primary source of these cash flows would generally be lease or rental payments, or the sale of the property. The distinguishing characteristic of these exposures compared to other regulatory real estate exposures is that both the servicing of the loan and the prospects for recovery in the event of default depend materially on the cash flows generated by the property securing the exposure.",
      "pageNumber2": 235,
      "explanation": "Both excerpts address the nature of Commercial Real Estate (CRE) lending and the source of repayment. The EBA GL defines CRE as 'land, and the building(s) on it, that generates profit or income from capital gains or rents'. The Basel Framework defines exposures 'materially dependent on cash flows generated by the property' where 'the prospects for servicing the loan materially depend on the cash flows generated by the property securing the loan' and specifies that 'The primary source of these cash flows would generally be lease or rental payments, or the sale of the property'. This creates an overlap in the characterization of CRE loans based on their income-generating capacity and reliance on property-specific cash flows for repayment.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_69.json",
      "excerpt1": "8. Maximum loan amounts 9. Appropriate limits on partial recourse or non-recourse loans 10. Maximum loan maturities 11. Amortisation schedules and standards for the acceptability of and limits on non-amortising loans and on the use of interest reserves and cash sweep structures 12. Risk-based limits (towards concentration, type of product, etc.) 13. Acceptable loan-to-value ratio limits (for secured lending) 14. Acceptable debt-servicing coverage ratio limits 15. Acceptable interest coverage ratio limits 16. Acceptable EBITDA limits 17. Acceptable leverage ratio limits 18. Acceptable debt-to-equity ratio limits 19. Acceptable loan-to-cost ratio limits 20. Acceptable cash-flow-to-debt-service ratio limits 21. Acceptable return on equity ratio limits 22. Acceptable capitalisation rate (net operating income/market value) limits 23. Standards to address and mitigate risks associated with environmental risk 24. Compliance policy with macroprudential requirements, when relevant",
      "pageNumber1": 69,
      "filename2": "L_2023029EN.01000101.json",
      "excerpt2": "For the purposes of paragraph 1, the authorities designated in accordance with Article 124 (1a) of Regulation (EU) No 575/2013 shall have regard to other macroprudential measures in force that already address the identified systemic risks affecting the appropriateness of the risk weights referred to in Article 124 (2), first subparagraph, of that Regulation, including the following measures in national law designed to enhance the resilience of the financial system: • (a) loan-to-value (LTV) limits; • (b) debt-to-income limits; • (c) debt-service-to-income limits; • (d) other instruments addressing lending standards.",
      "pageNumber2": 1,
      "explanation": "Both excerpts address the use of macroprudential measures and specific quantitative limits in lending. The EBA GL states that institutions should have a 'Compliance policy with macroprudential requirements, when relevant' and lists specific 'Acceptable loan-to-value ratio limits', 'Acceptable debt-servicing coverage ratio limits', and other ratio limits. The Delegated Regulation mentions that authorities should consider 'macroprudential measures in force' including 'loan-to-value (LTV) limits' and 'debt-service-to-income limits' (similar to debt-servicing coverage ratio). This represents an overlap in the regulatory subject of applying and complying with macroprudential tools and specific lending limits like LTV and debt-servicing ratios.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}