{
  "summary": "This analysis identifies overlaps between the EBA Guidelines on Loan Origination and Monitoring and other regulatory texts. The overlaps primarily concern the obligations of institutions and creditors (supervised entities) to collect, verify, and maintain customer information for creditworthiness assessment, particularly regarding groups of connected clients. Both the EBA Guidelines and the FIN-FSA Regulations and Guidelines 4/2018, as well as the EBA Guidelines on Connected Clients, impose similar requirements for obtaining and validating customer data, assessing repayment capacity, and identifying connected clients as part of the credit granting and monitoring process. There is also an overlap regarding the documentation of information leading to credit approval and its retention for a specified period.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_34.json",
      "excerpt1": "88. If the information and data are not readily available, institutions and creditors should collect the necessary information and data from the borrower and/or third parties, including relevant databases, when relevant. For the collection of information and data on the borrower from third parties, institutions and creditors should ensure that the requirements of Regulation (EU) No 2016/679 are met. 89. If institutions and creditors have concerns regarding the accuracy and reliability of the information and data, they should make necessary checks and reasonable enquiries with the borrower and third parties (e.g. employer, public authorities, relevant databases), and take reasonable steps to verify the information and data collected. Before making such enquiries with third parties regarding borrower's personal data, institutions and creditors should ensure that the requirements, in particular with regard to informing and seeking permission from the borrower, of Regulation (EU) No 2016/679 are met.",
      "pageNumber1": 34,
      "filename2": "2018_04.m3_en.di_page_14.json",
      "excerpt2": "(22) In considering the granting of credit, supervised entities must study thoroughly enough the capacity of the applicant to meet its obligations. To analyse the financial status and creditworthiness, sufficient information must be obtained about the customer. Corporate customers' financial statements information and personal customers' income and expense information as well as credit register details constitute basic information likely to assist the supervised entity in making the right credit decisions. The accuracy of the information must be ascertained in an appropriate manner.",
      "pageNumber2": 14,
      "explanation": "Both excerpts address the obligation of institutions/creditors (supervised entities) to collect sufficient information to assess a borrower's financial status and creditworthiness, and to ascertain the accuracy of this information. The EBA GL mentions collecting from borrowers and third parties and verifying accuracy, while the FIN-FSA GL specifies obtaining information like financial statements, income/expense, and credit register details, and ensuring accuracy.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_34.json",
      "excerpt1": "93. If the borrower is a member of a group of connected clients, institutions should collect the necessary information on relevant related connected clients, in accordance with the EBA Guidelines on connected clients, especially when repayment is reliant on cash flow emanating from other connected parties in the same group.",
      "pageNumber1": 34,
      "filename2": "Final Guidelines on connected clients (EBA-GL-2017-15).di_page_25.json",
      "excerpt2": "36.Institutions should identify all control relationships among their clients and document as appropriate. Institutions should also investigate, and document as appropriate, any potential economic dependencies among their clients. Institutions should take reasonable steps and use readily available information to identify these connections. If, for example, an institution becomes aware that clients have been considered interconnected by another institution (e.g. because of the existence of a public register), it should take into account that information. 37. The efforts that institutions put into the investigation of economic dependencies among their clients should be proportionate to the size of the exposures. Therefore, institutions should strengthen their investigations, by extensive research of any type of 'soft information' as well as information that goes beyond the institutions' clients, in all cases where the sum of all exposures to one individual client exceeds 5% of Tier 1 capital. 18 38.To assess grouping requirements based on a combination of control and economic dependency relationships, institutions should collect information on all entities forming a chain of contagion.",
      "pageNumber2": 25,
      "explanation": "Both excerpts require institutions to collect information on connected clients. The EBA GL on loan origination explicitly refers to collecting 'necessary information on relevant related connected clients' in accordance with 'EBA Guidelines on connected clients'. The EBA GL on connected clients further details the process for identifying and documenting control relationships and economic dependencies among clients, and collecting information on entities forming a chain of contagion.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_34.json",
      "excerpt1": "94. Institutions and creditors should document the information and data that lead to credit approval, including the actions and assessments carried out by them, and maintain this documentation in an accessible form (readily available for competent authorities) for at least the duration of the loan agreement.",
      "pageNumber1": 34,
      "filename2": "2018_04.m3_en.di_page_18.json",
      "excerpt2": "(47) Credit decisions shall be made in accordance with written instructions approved by the executive management. There shall be a clear audit trail documenting the whole process, from credit application to credit decision, and it shall be approved by the appropriate level of management. The credit decision or documents appended thereto shall give a detailed account of the contents and date of the decision, the grounds for granting or turning down the application and the decision makers. The entire credit granting process must be verifiable after the event. (51) Credit documents must be retained at least until the credit has been repaid.",
      "pageNumber2": 18,
      "explanation": "Both excerpts impose an obligation on institutions to document information and decisions related to credit approval and to retain this documentation. The EBA GL specifies 'information and data that lead to credit approval' for 'at least the duration of the loan agreement', while the FIN-FSA GL requires a 'clear audit trail documenting the whole process' and that 'Credit documents must be retained at least until the credit has been repaid'. The requirements are substantially the same for the same regulatory subject.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}