{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring (EBA/GL/2020/06) and the EBA Guidelines on Credit Institutions' Credit Risk Management Practices and Accounting for Expected Credit Losses (EBA/GL/2017/06) both provide lists of signals that institutions should consider when assessing credit quality deterioration or a significant increase in credit risk. While the former focuses on general monitoring for loan origination, the latter specifically targets the assessment of 'significant increase in credit risk' (SICR) for IFRS 9 purposes. Several listed signals overlap, indicating that institutions should consider similar factors for both general credit risk monitoring and IFRS 9 SICR assessment. Additionally, the EBA Guidelines on Management of Non-Performing and Forborne Exposures (EBA/GL/2018/06) also includes similar factors for identifying signs of possible future financial difficulties in borrowers, further reinforcing the common themes in credit risk monitoring across different EBA guidelines.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_65.json",
      "excerpt1": "274. As part of their ongoing monitoring of credit risk, institutions should consider the following credit quality deterioration signals: a. negative macroeconomic events (including but not limited to economic development, changes in legislation and technological threats to an industry) affecting the future profitability of an industry, a geographical segment, a group of borrowers or an individual corporate borrower, as well as the increased risk of unemployment for groups of individuals; b. known adverse changes in the financial position of borrowers, such as a significant increase in debt levels or significant increases in debt service ratios; c. a significant drop in turnover or, in general, in recurring cash flow (including the loss of a major contract/client/tenant); d. significant narrowing of operating margins or income; e. a significant deviation in actual earnings from the forecast or a significant delay in the business plan of a project or an investment; f. changes in the credit risk of a transaction that would cause the terms and conditions to be significantly different if the transaction were newly originated or issued at the reporting date (such as increased amounts of required collateral or guarantees, or a higher recurring income coverage of the borrower); g. an actual or expected significant decrease in the main transaction's external credit rating, or in other external market indicators of credit risk for a particular transaction or similar transaction with the same expected life; h. changes in the conditions of access to markets, a worsening in financing conditions or known reductions in financial support provided by third parties to the borrower; i. a slowdown in the business or adverse tendencies in the operations of the borrower that may cause a significant change in the borrower's ability to meet its debt obligations;",
      "pageNumber1": 65,
      "filename2": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_42.json",
      "excerpt2": "108. When assessing whether there has been a significant increase in credit risk for a lending exposure, credit institutions should also take into account the following factors which are related to the environment in which a credit institution or the borrower operates: a. deterioration of the macroeconomic outlook relevant to a particular borrower or to a group of borrowers. Macroeconomic assessments should be sufficiently rich to include factors relevant to sovereign, corporate, household and other types of borrower. Furthermore, they should address any relevant regional differences in economic performance within a jurisdiction 31; and b. deterioration of prospects for the sector or industries within which a borrower operates.",
      "pageNumber2": 42,
      "explanation": "Both excerpts address the same regulatory subject: factors indicating credit quality deterioration, to be considered by institutions as part of credit risk assessment. Filename1 lists 'negative macroeconomic events' and 'technological threats to an industry' as signals, while filename2 specifies 'deterioration of the macroeconomic outlook' and 'deterioration of prospects for the sector or industries'. These are largely overlapping categories of macroeconomic and industry-specific signals that impact credit risk.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_65.json",
      "excerpt1": "274. As part of their ongoing monitoring of credit risk, institutions should consider the following credit quality deterioration signals: ... f. changes in the credit risk of a transaction that would cause the terms and conditions to be significantly different if the transaction were newly originated or issued at the reporting date (such as increased amounts of required collateral or guarantees, or a higher recurring income coverage of the borrower); g. an actual or expected significant decrease in the main transaction's external credit rating, or in other external market indicators of credit risk for a particular transaction or similar transaction with the same expected life; h. changes in the conditions of access to markets, a worsening in financing conditions or known reductions in financial support provided by third parties to the borrower;",
      "pageNumber1": 65,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_627.json",
      "excerpt2": "(a) significant changes in internal price indicators of credit risk as a result of a change in credit risk since inception, including, but not limited to, the credit spread that would result if a particular financial instrument or similar financial instrument with the same terms and the same counterparty were newly originated or issued at the reporting date. (b) other changes in the rates or terms of an existing financial instrument that would be significantly different if the instrument was newly originated or issued at the reporting date (such as more stringent covenants, increased amounts of collateral or guarantees, or higher income coverage) because of changes in the credit risk of the financial instrument since initial recognition. (c) significant changes in external market indicators of credit risk for a particular financial instrument or similar financial instruments with the same expected life. Changes in market indicators of credit risk include, but are not limited to: (i) the credit spread; (ii) the credit default swap prices for the borrower; (iii) the length of time or the extent to which the fair value of a financial asset has been less than its amortised cost; and (iv) other market information related to the borrower, such as changes in the price of a borrower's debt and equity instruments. (d) an actual or expected significant change in the financial instrument's external credit rating. (e) an actual or expected internal credit rating downgrade for the borrower or decrease in behavioural scoring used to assess credit risk internally.",
      "pageNumber2": 627,
      "explanation": "Both excerpts require institutions to consider similar factors related to changes in credit risk and external indicators. Filename1 mentions 'changes in the credit risk of a transaction that would cause the terms and conditions to be significantly different if the transaction were newly originated' (274.f) and 'an actual or expected significant decrease in the main transaction's external credit rating, or in other external market indicators of credit risk' (274.g). Filename2 details similar points under criteria for a significant increase in credit risk: 'other changes in the rates or terms of an existing financial instrument that would be significantly different if the instrument was newly originated' (b) and 'significant changes in external market indicators of credit risk' (c), and 'an actual or expected significant change in the financial instrument's external credit rating' (d). These are closely aligned requirements for monitoring credit risk changes.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_65.json",
      "excerpt1": "274. As part of their ongoing monitoring of credit risk, institutions should consider the following credit quality deterioration signals: ... a. negative macroeconomic events (including but not limited to economic development, changes in legislation and technological threats to an industry) affecting the future profitability of an industry, a geographical segment, a group of borrowers or an individual corporate borrower, as well as the increased risk of unemployment for groups of individuals; ... i. a slowdown in the business or adverse tendencies in the operations of the borrower that may cause a significant change in the borrower's ability to meet its debt obligations;",
      "pageNumber1": 65,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_627.json",
      "excerpt2": "(f) existing or forecast adverse changes in business, financial or economic conditions that are expected to cause a significant change in the borrower's ability to meet its debt obligations, such as an actual or expected increase in interest rates or an actual or expected significant increase in unemployment rates. (g) an actual or expected significant change in the operating results of the borrower. Examples include actual or expected declining revenues or margins, increasing operating risks, working capital deficiencies, decreasing asset quality, increased balance sheet leverage, liquidity, management problems or changes in the scope of business or organisational structure (such as the discontinuance of a segment of the business) that results in a significant change in the borrower's ability to meet its debt obligations. (i) an actual or expected significant adverse change in the regulatory, economic, or technological environment of the borrower that results in a significant change in the borrower's ability to meet its debt obligations, such as a decline in the demand for the borrower's sales product because of a shift in technology.",
      "pageNumber2": 627,
      "explanation": "Both excerpts mandate considering adverse changes in macroeconomic, business, and operational conditions as signals of credit deterioration. Filename1 lists 'negative macroeconomic events' (274.a) and 'a slowdown in the business or adverse tendencies in the operations of the borrower' (274.i). Filename2 specifies 'existing or forecast adverse changes in business, financial or economic conditions' (f), 'an actual or expected significant change in the operating results of the borrower' (g), and 'an actual or expected significant adverse change in the regulatory, economic, or technological environment of the borrower' (i). These are highly consistent in the types of external and internal business factors to be monitored.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_65.json",
      "excerpt1": "274. As part of their ongoing monitoring of credit risk, institutions should consider the following credit quality deterioration signals: ... b. known adverse changes in the financial position of borrowers, such as a significant increase in debt levels or significant increases in debt service ratios; c. a significant drop in turnover or, in general, in recurring cash flow (including the loss of a major contract/client/tenant); d. significant narrowing of operating margins or income; e. a significant deviation in actual earnings from the forecast or a significant delay in the business plan of a project or an investment;",
      "pageNumber1": 65,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_627.json",
      "excerpt2": "(g) an actual or expected significant change in the operating results of the borrower. Examples include actual or expected declining revenues or margins, increasing operating risks, working capital deficiencies, decreasing asset quality, increased balance sheet leverage, liquidity, management problems or changes in the scope of business or organisational structure (such as the discontinuance of a segment of the business) that results in a significant change in the borrower's ability to meet its debt obligations. (h) significant increases in credit risk on other financial instruments of the same borrower.",
      "pageNumber2": 627,
      "explanation": "Both excerpts identify changes in the borrower's financial position and operating results as signals of credit deterioration. Filename1 lists 'adverse changes in the financial position of borrowers, such as a significant increase in debt levels or significant increases in debt service ratios' (274.b), 'a significant drop in turnover or... recurring cash flow' (274.c), and 'significant narrowing of operating margins or income' (274.d). Filename2 mentions 'an actual or expected significant change in the operating results of the borrower. Examples include actual or expected declining revenues or margins... increased balance sheet leverage' (g). These explicitly refer to overlapping financial and operational indicators.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_65.json",
      "excerpt1": "274. As part of their ongoing monitoring of credit risk, institutions should consider the following credit quality deterioration signals: ... a. negative macroeconomic events (including but not limited to economic development, changes in legislation and technological threats to an industry) affecting the future profitability of an industry, a geographical segment, a group of borrowers or an individual corporate borrower, as well as the increased risk of unemployment for groups of individuals;",
      "pageNumber1": 65,
      "filename2": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_21.json",
      "excerpt2": "33. Sound methodologies for assessing credit risk and measuring the level of allowances (subject to exposure type, for example retail or wholesale) should, in particular: ... b. include criteria to duly consider the impact of forward-looking information, including macroeconomic factors. Whether the evaluation of credit risk is conducted on a collective or individual basis, a credit institution should be able to demonstrate that this consideration has occurred so that the recognition of ECL is not delayed. Such criteria should result in the identification of factors that affect repayment, whether related to borrower incentives, willingness or ability to perform on the contractual obligations, or lending exposure terms and conditions. Economic factors considered (such as unemployment rates or occupancy rates) should be relevant to the assessment and, depending on the circumstances, this may be at the international, national, regional or local level;",
      "pageNumber2": 21,
      "explanation": "Both excerpts emphasize the importance of considering macroeconomic factors, including forward-looking information, when assessing credit risk. Filename1 lists 'negative macroeconomic events... as well as the increased risk of unemployment' (274.a) as credit quality deterioration signals. Filename2 states that credit risk assessment methodologies should 'include criteria to duly consider the impact of forward-looking information, including macroeconomic factors,' and gives examples like 'unemployment rates' (33.b). This demonstrates an overlap in the mandated consideration of macroeconomic indicators like unemployment for credit risk assessment.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_65.json",
      "excerpt1": "273. When the actions include interaction with the borrower, institutions should have regard to their individual circumstances. The level of contact and communication with the borrower during payment difficulties should be commensurate to the information requirements, as defined in the EBA Guidelines on arrears and foreclosure.",
      "pageNumber1": 65,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_44.json",
      "excerpt2": "150. For the purpose of implementing forbearance measures, credit institutions should be able to identify signs of possible future financial difficulties at an early stage. In order to do so, the assessment of the financial situation of the borrower should not be limited to exposures with apparent signs of financial difficulties. An assessment of financial difficulties should also be conducted for exposures with regard to which the borrower does not have apparent financial difficulties but in relation to which market conditions have changed significantly in a way that could impact the borrower's ability to repay (e.g. bullet loans the repayment of which will depend on the sale of immovable property or foreign currency loans). 151. The assessment of any financial difficulties on the part of a borrower should be based on the situation of the borrower only, disregarding collateral or any guarantees provided by third parties. When assessing the financial difficulties of the borrower, credit institutions, in accordance with Annex V to Commission Implementing Regulation (EU) No 680/2014, should consider at least the following rebuttable circumstances: a) borrower/facility more than 30 days past due during the three months prior to its modification or refinancing; b) increase in probability of default (PD) of credit institution's internal rating class during the three months prior to its modification or refinancing; c) presence on a watch list during the three months prior to its modification or refinancing.",
      "pageNumber2": 44,
      "explanation": "Both excerpts concern the assessment of a borrower's financial difficulties by institutions. Filename1 states that institutions should have regard to individual circumstances and that the level of contact with the borrower during payment difficulties should be commensurate to information requirements, cross-referencing 'EBA Guidelines on arrears and foreclosure' (now superseded by the EBA GL on NPEs). Filename2 directly details how credit institutions should identify 'signs of possible future financial difficulties at an early stage' (150) and specifies factors to consider for 'financial difficulties of the borrower' (151). This constitutes an overlap as both guidelines provide requirements for institutions to assess and respond to a borrower's financial difficulties, with filename2 providing more specific criteria for the assessment.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}