{
  "summary": "The provided excerpts demonstrate overlaps regarding the obligation of institutions to identify, assess, and manage ML/TF risks within their credit granting and loan origination processes, specifically focusing on ensuring the legitimacy of the source of funds. Multiple guidelines reiterate this requirement, emphasizing that institutions' policies and procedures must address this, and that prudential authorities will assess the presence of such systems and controls.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_24.json",
      "excerpt1": "b. at the level of the individual relationship, identify, assess and manage the ML/TF risk associated with this relationship - as part of this, institutions should: (...) iii. in particular, in situations in which the ML/TF risk associated with the individual relationship is established, institutions should take risk-sensitive measures to understand if the funds used to repay the credit, including cash or equivalents provided as collateral, are from legitimate sources. When considering the legitimacy of the source of funds, institutions should have regard to the activity that generated the funds and whether this information is credible and consistent with the institution's knowledge of the customer and the customer's professional activity. (...) 46. Institutions should have policies and procedures in place to ensure that the disbursement of loans is made in line with the credit decision and the loan agreement. They should also ensure that there are appropriate checks in place to identify, assess and manage ML/TF risks, and that relevant records are kept, in line with institutions' wider AML/CFT obligations under Directive (EU) 2015/849.",
      "pageNumber1": 24,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_91.json",
      "excerpt2": "d. the policies and procedures also specify how ML/TF risks to which the institution is exposed as a result of the credit granting activities are identified, assessed and managed both at the level of the business (in terms of types of customers served, lending products provided, geographies to which they are exposed and distribution channels used) and at the level of the individual relationship (considering the purpose of the credit, the extent to which the counterparty gives rise to ML/TF risk, and the legitimacy of the source of funds used to repay the credit);",
      "pageNumber2": 91,
      "explanation": "Both excerpts impose on institutions the obligation to identify, assess, and manage ML/TF risks arising from credit granting activities, specifically requiring consideration of the legitimacy of the source of funds used to repay credit at the individual relationship level. The wording and scope of the obligation are nearly identical.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_24.json",
      "excerpt1": "b. at the level of the individual relationship, identify, assess and manage the ML/TF risk associated with this relationship - as part of this, institutions should: (...) iii. in particular, in situations in which the ML/TF risk associated with the individual relationship is established, institutions should take risk-sensitive measures to understand if the funds used to repay the credit, including cash or equivalents provided as collateral, are from legitimate sources. When considering the legitimacy of the source of funds, institutions should have regard to the activity that generated the funds and whether this information is credible and consistent with the institution's knowledge of the customer and the customer's professional activity. (...) 46. Institutions should have policies and procedures in place to ensure that the disbursement of loans is made in line with the credit decision and the loan agreement. They should also ensure that there are appropriate checks in place to identify, assess and manage ML/TF risks, and that relevant records are kept, in line with institutions' wider AML/CFT obligations under Directive (EU) 2015/849.",
      "pageNumber1": 24,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_77.json",
      "excerpt2": "171. In addition, competent authorities should also pay attention to whether ML/TF risks are considered within the context of the credit-granting process, including whether the institution has systems and controls in place to ensure funds used to repay loans are from legitimate sources in accordance with the EBA Guidelines on loan origination and monitoring.30",
      "pageNumber2": 77,
      "explanation": "Both excerpts address the same regulatory subject concerning institutions' responsibility for managing ML/TF risks in the credit-granting process, specifically ensuring the legitimacy of the source of funds. The second excerpt explicitly references and reinforces the requirement from the first document (EBA Guidelines on loan origination and monitoring), indicating an overlap in the underlying obligation.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_24.json",
      "excerpt1": "45. Institutions should have internal processes to ensure that the information obtained for the purposes of creditworthiness assessment, such as the information specified in Section 5.1 and Annex 2 of these guidelines, also informs their anti-money laundering and countering financing of terrorism (AML/CFT) processes.",
      "pageNumber1": 24,
      "filename2": "Final%20Report%20on%20Guidelines%20on%20common%20procedures%20and%20methodologies%20for%20SREP%20and%20supervisory%20stress%20testing.di_page_251.json",
      "excerpt2": "One respondent suggested to reword paragraph 170 of the CP in order to clarify that the verification of whether the institution has included the consideration of ML/TF risks in the context of the credit granting process, and whether the institutions has put in place systems and controls to ensure funds to repay loans are from legitimate sources and are within the remit of the AML/CFT supervisor. (...) The EBA notes the comment and would like to clarify that the provision in paragraph 171 does not make reference to the assessment of individual transactions, but rather to the verification of whether systems and controls have been put in place. The provision also refers to the verification of whether such systems and controls are in place rather than the actual assessment of the effectiveness of these systems and controls, which indeed would be within the remit of the AML/CFT supervisor.",
      "pageNumber2": 251,
      "explanation": "Both excerpts address the integration of ML/TF risk considerations into the credit granting process. The first excerpt sets the obligation for institutions to integrate information from creditworthiness assessment into AML/CFT processes. The second excerpt, while part of a response to comments, clarifies the supervisory expectation that institutions (as 'the institution') have 'systems and controls' in place for ML/TF risks in the credit granting process, thereby overlapping on the regulatory requirement for institutions to establish such systems.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}