{
  "summary": "The documents present overlapping requirements for institutions regarding the monitoring and revaluation of immovable property collateral. Both sets of guidelines (Loan Origination and Monitoring, and Management of Non-Performing and Forborne Exposures) and the CRR specify conditions for frequency of monitoring, methods for valuation (including the use of statistical models and independent appraisers), and triggers for revaluation, particularly referencing Article 208(3) of Regulation (EU) No 575/2013. While some provide more detail, the core obligations for institutions to monitor and revalue collateral using specific approaches and frequencies, especially for immovable property, are largely consistent across the texts.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_56.json",
      "excerpt1": "222. Institutions should set out appropriate frequencies for monitoring the value of the collateral, considering the type and value of the collateral at origination, and, in relation to the credit agreement, consider the following:\na. the frequency of monitoring of properties and parts in development, e.g. unfinished buildings, is higher than that of similar finished properties and parts;\nb. the frequency of monitoring of properties and parts with a high carrying amount or with a high LTV ratio is higher than that of similar properties and parts with a low carrying amount or with a low LTV ratio;\nc. the frequency of monitoring of loans secured by immovable property or parts of the property with lower credit quality is higher than that of similar loans secured by immovable property or parts of the property with higher credit quality.",
      "pageNumber1": 56,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_131.json",
      "excerpt2": "3. The following requirements on monitoring of property values and on property valuation shall be met:\n(a) institutions monitor the value of the property on a frequent basis and at a minimum once every year for commercial immovable property and once every three years for resi- dential real estate. Institutions carry out more frequent monitoring where the market is subject to significant changes in conditions;",
      "pageNumber2": 131,
      "explanation": "Both excerpts address the frequency of monitoring the value of collateral by institutions. Excerpt 222 from the EBA GL on Loan Origination and Monitoring specifies factors that should lead to higher monitoring frequency (e.g., properties in development, high LTV, lower credit quality). Article 208(3)(a) of CRR mandates minimum monitoring frequencies (annually for commercial, every three years for residential) and requires more frequent monitoring when market conditions change significantly, aligning with the spirit of dynamic monitoring based on risk factors.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_56.json",
      "excerpt1": "223. Institutions should ensure that any indices and statistical models used to monitor the value of the collateral are sufficiently granular and that the methodology is appropriate for the type of asset and lending product and based on a sufficient time series of observed empirical evidence of previous transactions and appraisals of the collateral or similar collateral.",
      "pageNumber1": 56,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_51.json",
      "excerpt2": "187. Indices used to carry out this indexation may be internal or external as long as they are:\na) reviewed regularly, with the results of this review being documented and readily available, and with the review cycle and governance requirements being clearly defined in a policy document approved by the management body;\nb) sufficiently granular, with the methodology being adequate and appropriate for the type of collateral in question;\nc) based on a sufficient time series of observed empirical evidence of actual property transactions.",
      "pageNumber2": 51,
      "explanation": "Both excerpts establish requirements for the use of indices and statistical models in monitoring collateral value. The EBA GL on Loan Origination and Monitoring states that models should be granular, appropriate, and based on sufficient empirical evidence. The EBA GL on NPEs reinforces these points, adding that indices must be regularly reviewed, granular, appropriate for the collateral type, and based on sufficient empirical evidence of transactions.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_56.json",
      "excerpt1": "224. Institutions should have policies and procedures for the revaluation of immovable property collateral, specifying the approaches to revaluation (e.g. desktop valuation, drive-by valuation, full visit with internal and external assessment of the property, statistical models) for different types of immovable property collateral, ensuring that the approach or combination of approaches is prudent and proportionate to the type and potential values of the collateral and in relation to the credit agreements. Furthermore, institutions should set out specific triggers (e.g. a change in the assumptions made in the appraisals), indicating when monitoring leads to revaluation or collateral needs revaluation.",
      "pageNumber1": 56,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_53.json",
      "excerpt2": "201. Credit institutions should define criteria in their collateral valuation policy and procedures for determining if a significant decline in collateral value has taken place. Where possible, these will include quantitative thresholds for each type of collateral, based on the observed empirical data and any relevant qualitative credit institution experience, bearing in mind relevant factors such as market price trends or the opinion of independent appraisers.",
      "pageNumber2": 53,
      "explanation": "Both documents require institutions to have policies and procedures for the revaluation of immovable property collateral and to define triggers for such revaluation. The EBA GL on Loan Origination and Monitoring explicitly mentions 'specific triggers' and different 'approaches to revaluation'. The EBA GL on NPEs specifies that institutions should 'define criteria... for determining if a significant decline in collateral value has taken place', which acts as a trigger for revaluation, and can include 'quantitative thresholds'.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_56.json",
      "excerpt1": "225. When the conditions for a review in accordance with Article 208(3)(b) of Regulation (EU) No 575/2013 are met, institutions should update the value of the immovable property collateral by means of a revaluation carried out by a valuer who is potentially supported by appropriate advanced statistical models that meet the conditions set out in Section 7.4 and account for individual characteristics of the property and geographical area. Institutions should not use these models as the sole means of the revaluation.\n226. When the conditions for a review in accordance with Article 208(3)(b) of Regulation (EU) No 575/2013 are not met, institutions may update the value of the immovable property collateral by means of either a revaluation carried out by a valuer or appropriate statistical models that meet the conditions set out in Section 7.4 and account for the individual characteristics of the property and geographical area.",
      "pageNumber1": 56,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_51.json",
      "excerpt2": "188. Valuations and revaluations of immovable property collateral should be performed on an individual and a property-specific basis. Valuations and revaluations of immovable property collateral should not be carried out using a statistical model as the sole means of undertaking the review of the property valuation.\n190. All valuations of immovable property, including updated valuations, should be performed by an independent and qualified appraiser, internal or external, who possesses the necessary qualifications, ability and experience to execute a valuation, as specified in Article 208(3)(b) and Article 229 of Regulation (EU) No 575/2013.",
      "pageNumber2": 51,
      "explanation": "Both documents lay down requirements for the methods of revaluation of immovable property collateral, specifically in the context of Article 208(3)(b) of CRR. The EBA GL on Loan Origination and Monitoring mandates revaluation by a valuer (potentially supported by statistical models, but not as the sole means) when 208(3)(b) conditions are met, and allows either valuer or statistical models when conditions are not met. The EBA GL on NPEs explicitly states that statistical models should not be the sole means of revaluation and that all valuations/revaluations should be performed by an independent and qualified appraiser, as per Article 208(3)(b) CRR.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}