{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring and the EBA Guidelines on Credit Institutions' Credit Risk Management Practices and Accounting for Expected Credit Losses contain overlapping provisions regarding the responsibilities of the management body for approving and reviewing the credit institution's credit risk strategy and ensuring its consistency with the risk appetite framework. Additionally, both the Loan Origination Guidelines and the SREP Guidelines emphasize the management body's role in setting and overseeing the credit risk strategy and appetite. There are also overlaps in the requirement for the management body to ensure adequate resources and skills for staff involved in credit risk.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_19.json",
      "excerpt1": "The management body, as referred to in the EBA Guidelines on internal governance, in relation to credit granting, should: a. approve the institution's credit risk strategy, within the overall risk strategy, and business strategy, to ensure that they are in line with the institution's risk appetite framework (RAF), capital and liquidity planning, and are in line with the internal capital adequacy assessment process (ICAAP) and internal liquidity adequacy assessment process (ILAAP), when relevant; b. set the credit risk appetite within the overall RAF, including credit-granting standards, qualitative statements, quantitative metrics and limits, and escalation thresholds, without business performance biases;",
      "pageNumber1": 19,
      "filename2": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_19.json",
      "excerpt2": "The credit institution's management body should be responsible for approving and regularly reviewing a credit institution's credit risk management strategy and the main policies and processes for identifying, measuring, evaluating, monitoring, reporting and mitigating credit risk consistent with the approved risk appetite set by the management body.",
      "pageNumber2": 19,
      "explanation": "Both excerpts establish the responsibility of the management body to approve and regularly review the credit institution's credit risk strategy and to ensure consistency with the risk appetite framework. The first excerpt details what the strategy should encompass, while the second provides a general statement of responsibility for approving and reviewing the strategy and related processes.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_19.json",
      "excerpt1": "The management body, as referred to in the EBA Guidelines on internal governance, in relation to credit granting, should: a. approve the institution's credit risk strategy, within the overall risk strategy, and business strategy, to ensure that they are in line with the institution's risk appetite framework (RAF), capital and liquidity planning, and are in line with the internal capital adequacy assessment process (ICAAP) and internal liquidity adequacy assessment process (ILAAP), when relevant; b. set the credit risk appetite within the overall RAF, including credit-granting standards, qualitative statements, quantitative metrics and limits, and escalation thresholds, without business performance biases; ... f. ensure that all staff involved in credit risk taking, and the managing, monitoring and controlling of credit risk, are adequately skilled, resourced and experienced; g. set, approve and oversee the implementation of the institution's risk culture, core values and expectations regarding credit risk;",
      "pageNumber1": 19,
      "filename2": "Final Report on Guidelines on common procedures and methodologies for SREP and supervisory stress testing.di_page_89.json",
      "excerpt2": "Competent authorities should assess whether the institution has a sound, clearly formulated and documented credit risk appetite, strategy and limits approved by the management body. For this assessment, among other factors, competent authorities should take into account: a. whether the management body clearly expresses the credit risk strategy and appetite, as well as the process for their review; b. whether senior management properly implements and monitors the credit risk strategy approved by the management body, ensuring that the institution's activities are consistent with the established strategy, that written procedures are drawn up and implemented, and that responsibilities are clearly and properly assigned; ... d. whether the institution has an appropriate framework in place to ensure that the credit risk strategy is effectively communicated to all relevant staff.",
      "pageNumber2": 89,
      "explanation": "Both excerpts address the management body's responsibility for the credit risk strategy and appetite. The first document (EBA GL 2020/06) states the management body 'should approve the institution's credit risk strategy' and 'set the credit risk appetite'. The second document (SREP GL) requires competent authorities to assess 'whether the institution has a sound, clearly formulated and documented credit risk appetite, strategy and limits approved by the management body' and 'whether the management body clearly expresses the credit risk strategy and appetite'. This is a direct overlap in the management body's responsibility concerning credit risk strategy and appetite.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_19.json",
      "excerpt1": "The management body, as referred to in the EBA Guidelines on internal governance, in relation to credit granting, should: ... f. ensure that all staff involved in credit risk taking, and the managing, monitoring and controlling of credit risk, are adequately skilled, resourced and experienced;",
      "pageNumber1": 19,
      "filename2": "Final Report on Guidelines on common procedures and methodologies for SREP and supervisory stress testing.di_page_90.json",
      "excerpt2": "Competent authorities should assess whether the institution has an appropriate organisational framework and governance arrangements to enable effective credit risk taking, management, measurement and control, with sufficient (both qualitative and quantitative) human and technical resources to carry out the required tasks. Among other factors, they should take into account whether: ... d. the staff involved in credit-granting activities, credit risk management and management of NPEs, in particular NPE workout units (both in business areas and in management and control areas) have appropriate skills and experience to perform their tasks.",
      "pageNumber2": 90,
      "explanation": "Both excerpts stipulate requirements regarding the competence and resources of staff involved in credit risk activities. The first excerpt (EBA GL 2020/06) explicitly states the management body should 'ensure that all staff involved in credit risk taking... are adequately skilled, resourced and experienced'. The second excerpt (SREP GL) states competent authorities should assess whether 'the staff involved in credit-granting activities, credit risk management... have appropriate skills and experience to perform their tasks', indicating an underlying requirement for institutions to ensure this, which falls under the management body's responsibility.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}