{
  "summary": "The EBA Guidelines on loan origination and monitoring (filename1) outline supervisory expectations for risk-based pricing and provide guidance on the valuation, monitoring, and review of collateral, as well as the ongoing monitoring of credit risk. Several related documents (filename2) reference these guidelines or impose similar requirements. Specifically, there are overlaps regarding the monitoring and review frequency of collateral value and the need for institutions to have policies and procedures for collateral valuation.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_5.json",
      "excerpt1": "d. provide guidance on the approaches to the valuation of immovable and movable property collateral at the point of credit granting, and the monitoring and review of the value of such collateral, based on the outcomes of the monitoring (Section 7);",
      "pageNumber1": 5,
      "filename2": "CELEX_32013R0575_EN_TXT.di_page_131.json",
      "excerpt2": "3. The following requirements on monitoring of property values and on property valuation shall be met:\n(a) institutions monitor the value of the property on a frequent basis and at a minimum once every year for commercial immovable property and once every three years for resi- dential real estate. Institutions carry out more frequent monitoring where the market is subject to significant changes in conditions;\n(b) the property valuation is reviewed when information available to institutions indicates that the value of the property may have declined materially relative to general market prices and that review is carried out by a valuer who possesses the necessary qualifications, ability and experience to execute a valuation and who is independent from the credit decision process. For loans exceeding EUR 3 million or 5% of the own funds of an institution, the property valuation shall be reviewed by such valuer at least every three years.",
      "pageNumber2": 131,
      "explanation": "Both excerpts address the monitoring and review of immovable property collateral value. Excerpt 1 (EBA GL 2020/06) provides guidance on approaches to valuation and monitoring. Excerpt 2 (CRR Article 208(3)) specifies concrete requirements for the frequency of monitoring (annually for commercial, every three years for residential, more frequent for significant market changes) and the review conditions for property valuation. While one is guidance and the other a direct requirement, they regulate the same subject of collateral value monitoring and review for institutions, with CRR providing specific frequencies and conditions that the EBA GL's guidance would likely elaborate upon or align with.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_5.json",
      "excerpt1": "d. provide guidance on the approaches to the valuation of immovable and movable property collateral at the point of credit granting, and the monitoring and review of the value of such collateral, based on the outcomes of the monitoring (Section 7);",
      "pageNumber1": 5,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_53.json",
      "excerpt2": "197. For prudential purposes, credit institutions should update valuations of all secured exposures in accordance with the requirements of Article 208(3) and Article 210(c) of Regulation (EU) No 575/2013.\n198. The group of collaterals that are subject to individual valuations and revaluations on a regular basis should be updated at the time when the exposure is classified as non- performing and at least annually while it continues to be classified as such. Credit institutions should make sure that, for the collateral subject to indexation or other similar methods, the indexation is updated at least annually.\n200. Credit institutions should carry out more frequent monitoring where the market is subject to significant negative changes and/or where there are signs of significant decline in the value of the individual collateral.\n201. Therefore, credit institutions should define criteria in their collateral valuation policy and procedures for determining if a significant decline in collateral value has taken place.",
      "pageNumber2": 53,
      "explanation": "Both excerpts concern the monitoring and valuation of collateral. Excerpt 1 (EBA GL 2020/06) states its purpose to provide guidance on collateral valuation and monitoring. Excerpt 2 (EBA GL on NPLs) provides specific requirements for credit institutions to update valuations of secured exposures, revalue collateral regularly (at least annually for NPLs), and monitor more frequently under specific market conditions, including defining criteria for significant decline in collateral value in their policies. Both address the core subject of collateral valuation frequency and conditions for review.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_5.json",
      "excerpt1": "d. provide guidance on the approaches to the valuation of immovable and movable property collateral at the point of credit granting, and the monitoring and review of the value of such collateral, based on the outcomes of the monitoring (Section 7);",
      "pageNumber1": 5,
      "filename2": "2018_04.m3_en.di_page_17.json",
      "excerpt2": "(41) Supervised entities must have documented procedures and guidelines for:\n· accepting different types of collateral\n· regularly monitoring and assessing collateral values4\n· collateral valuation (hair-cut)\n· ensuring that collateral is binding, adequate and realisable\n· identifying any concentrations of risk arising from collateral.\n(42) Supervised entities must establish acceptable types of collateral as well as collateral valuation percentages for each type of acceptable collateral. The valuation percentages shall be consistent with a prudential maximum limit for the relevant types of collateral. However, collateral value must always be based on a case-specific assessment, and special attention should be paid on collateral whose fair value cannot be considered stable.\n(43) The valuer of collateral must be competent and adequately independent of the granting of credit. Supervised entities must comply with the provisions in section 1 of Decree 1031/2016 of the Council of State on the professional requirements for a valuer of residential property or collateral for credit in consumer credit related to housing, also with respect to the valuer of collateral for other credit.\n(44) Supervised entities must ensure that the valuation of acceptable collateral is based on reliable appraisal methods, taking internationally recognised valuation standards into account.",
      "pageNumber2": 17,
      "explanation": "Both excerpts address collateral valuation and monitoring. Excerpt 1 (EBA GL 2020/06) provides guidance on approaches to collateral valuation and monitoring. Excerpt 2 (FIN-FSA regulations) mandates supervised entities to have documented procedures for monitoring and assessing collateral values, establishing valuation percentages, ensuring valuer competence and independence, and using reliable appraisal methods. These are specific requirements for practices that align with the general guidance provided by the EBA GL.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}