{
  "summary": "The EBA Guidelines specify detailed information and evidence that institutions must obtain when originating real estate development loans, including proof of experience, permits, contracts, cost estimates, and market reviews. The Basel Framework, in its definition of Land Acquisition, Development and Construction (ADC) exposures, also refers to loans for these purposes and sets criteria for their risk weighting, including the need for prudential underwriting standards that align with general regulatory real estate requirements. While the Basel Framework focuses on definitions and risk weights for supervisory purposes, and the EBA GL details operational requirements for institutions, the underlying subject of 'loans financing land acquisition, development and construction' or 'real estate development lending' is common. Specifically, the Basel Framework refers to 'prudential underwriting standards' without detailing them, whereas the EBA GL provides explicit examples of such standards.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_73.json",
      "excerpt1": "D. Real estate development lending In addition to the items specified in Section B above: 1. Evidence of experience in similar projects and similar asset types, e.g. offices, retail and industrial 2. Information on any ongoing project being developed by the borrower 3. Evidence of planning and building permits 4. Information on builders, architects, engineers and contractors 5. Evidence of contracts with contractors and relevant documentation on the development, including information on penalties, guarantees and the cost of overruns 6. Information on the rationale for the development, supported by a location-specific review of supply and demand in the market by a reputable estate agent with relevant expertise 7. Evidence of cost estimates and a timeline for the development, including contingencies for the development",
      "pageNumber1": 73,
      "filename2": "BaselFramework.di_page_241.json",
      "excerpt2": "20.90 Land ADC exposures41 refers to loans to companies or SPVs financing any of the land acquisition for development and construction purposes, or development and construction of any residential or commercial property. ADC exposures will be risk-weighted at 150%, unless they meet the criteria in CRE20.91. Footnotes 41 ADC exposures do not include the acquisition of forest or agricultural land, where there is no planning consent or intention to apply for planning consent. 20.91 ADC exposures to residential real estate may be risk weighted at 100%, provided that the following criteria are met: (1) prudential underwriting standards meet the requirements in CRE20.71 (ie the requirements that are used to classify regulatory real estate exposures) where applicable; (2) pre-sale or pre-lease contracts amount to a significant portion of total contracts or substantial equity at risk.42 Pre-sale or pre-lease contracts must be legally binding written contracts and the purchaser/renter must have made a substantial cash deposit which is subject to forfeiture if the contract is terminated. Equity at risk should be determined as an appropriate amount of borrower-contributed equity to the real estate's appraised as-completed value.",
      "pageNumber2": 241,
      "explanation": "Both excerpts address 'real estate development lending' or 'Land Acquisition, Development and Construction (ADC) exposures'. The EBA GL provides detailed examples of 'prudential underwriting standards' (e.g., evidence of experience, permits, contracts, cost estimates, market review) that institutions must follow for these loans. The Basel Framework (CRE20.91(1)) explicitly states that ADC exposures are eligible for a lower risk weight only if 'prudential underwriting standards meet the requirements in CRE20.71', which implies a requirement for sound underwriting for these types of loans. While CRE20.71 focuses on 'finished property' and 'legal enforceability' for general regulatory real estate, the EBA GL expands on the specific underwriting standards necessary for the *development* phase, which aligns with the spirit of 'prudential underwriting standards' for such complex exposures. The EBA GL provides the specific content of those standards for institutions, while the Basel Framework refers to their existence for risk-weighting purposes.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}