{
  "summary": "The EBA Guidelines on Loan Origination and Monitoring and the Basel Framework both address aspects of financing for physical assets, including ships. The EBA GL provides detailed criteria for assessing creditworthiness in shipping finance, considering factors like vessel earnings, age, fleet characteristics, and valuations. The Basel Framework defines 'Object Finance' as a method of funding physical asset acquisition (including ships) where repayment depends primarily on cash flows generated by the specific financed assets. This represents an overlap in the underlying subject matter of asset-backed financing, with the EBA GL providing granular, actor-specific obligations for creditworthiness assessment within this category, while the Basel Framework offers a broader definition of the financing type.",
  "overlaps": [
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_48.json",
      "excerpt1": "184. When assessing the creditworthiness of borrowers in the case of shipping finance, in addition to the general provisions on the creditworthiness assessment set out in Section 5.2.5 and Section 5.2.6, institutions should apply the specific criteria set out in this section. In particular, institutions should assess the following: a. the vessel's earnings to costs (operation expenses, including insurance, wages, maintenance, lubricants and interest cost) ratio; b. the ratio of the vessel's current age to its expected useful life; C. characteristics of the borrower's fleet in relation to the global fleet population (the size of the new build activity, the number of vessels laid up, the number of vessels scrapped for each segment and the age of the vessels will determine over-tonnage and influence freight rates); d. vessel valuations with or without haircut (if those are included as a repayment source), to reflect selling costs, the time value of money and uncertainties regarding the liquidity and marketability of the asset, unless single valuations are not possible if vessels are operated as part of a larger fleet with widely different types of earnings.",
      "pageNumber1": 48,
      "filename2": "BaselFramework.di_page_295.json",
      "excerpt2": "30.11 OF refers to a method of funding the acquisition of physical assets (eg ships, aircraft, satellites, railcars, or fleets) where the repayment of the exposure is dependent on the cash flows generated by the specific assets that have been financed and pledged or assigned to the lender. A primary source of these cash flows might be rental or lease contracts with one or several third parties.",
      "pageNumber2": 295,
      "explanation": "Both excerpts address the financing of physical assets, specifically including ships, and acknowledge the importance of the asset's cash flow in the repayment assessment. The EBA GL provides detailed requirements for assessing creditworthiness in shipping finance, which falls under the broader definition of 'Object Finance' described in the Basel Framework. The EBA GL's detailed criteria, such as assessing vessel's earnings-to-costs ratio, age, fleet characteristics, and valuations, are specific applications of creditworthiness assessment within the category of object finance as defined by the Basel Framework.",
      "type": "OVERLAP"
    },
    {
      "filename1": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_48.json",
      "excerpt1": "183. Institutions should conduct a comprehensive assessment of a borrower's capacity to repay or deleverage to sustainable levels of debt within a reasonable period of time. 184. When assessing the creditworthiness of borrowers in the case of shipping finance, in addition to the general provisions on the creditworthiness assessment set out in Section 5.2.5 and Section 5.2.6, institutions should apply the specific criteria set out in this section. In particular, institutions should assess the following: a. the vessel's earnings to costs (operation expenses, including insurance, wages, maintenance, lubricants and interest cost) ratio; b. the ratio of the vessel's current age to its expected useful life; C. characteristics of the borrower's fleet in relation to the global fleet population (the size of the new build activity, the number of vessels laid up, the number of vessels scrapped for each segment and the age of the vessels will determine over-tonnage and influence freight rates); d. vessel valuations with or without haircut (if those are included as a repayment source), to reflect selling costs, the time value of money and uncertainties regarding the liquidity and marketability of the asset, unless single valuations are not possible if vessels are operated as part of a larger fleet with widely different types of earnings. 185. Institutions should also consider other factors, such as the supply and demand in the market for the type of vessel in question, present and future trade patterns for the type of vessel in question, the necessity for the loan to be non-recourse or have guarantees, or have a long-term charter with an acceptable end user, and if the ship owner can provide other securities, such as assignments of charters and insurances, charges of shares and cash collateral or mortgages of other assets, such as real property and sister vessels.",
      "pageNumber1": 48,
      "filename2": "BaselFramework.di_page_294.json",
      "excerpt2": "30.7 In addition to general corporates, within the corporate asset class five sub-classes of specialised lending (SL) are identified. Such lending possesses all the following characteristics, in legal form or economic substance:\n(1) The exposure is typically to an entity (often a special purpose entity (SPE)) that was created specifically to finance and/or operate physical assets,\n(2) The borrowing entity has little or no other material assets or activities, and therefore little or no independent capacity to repay the obligation, apart from the income that it receives from the asset(s) being financed;\n(3) The terms of the obligation give the lender a substantial degree of control over the asset(s) and the income that it generates; and\n(4) As a result of the preceding factors, the primary source of repayment of the obligation is the income generated by the asset(s), rather than the independent capacity of a broader commercial enterprise.\n30.8 The five sub-classes of SL are project finance (PF), object finance (OF), commodities finance (CF), income-producing real estate (IPRE) lending, and high- volatility commercial real estate (HVCRE) lending. Each of these sub-classes is defined below.",
      "pageNumber2": 294,
      "explanation": "Both documents define and categorize types of specialized lending where repayment is heavily reliant on the financed asset. The EBA GL provides specific guidelines for assessing creditworthiness in 'shipping finance' and 'loans to shipbuilding', emphasizing factors directly related to the assets and their income generation. The Basel Framework defines 'specialized lending' (which includes 'object finance' for ships) by explicitly stating that the primary source of repayment is the income generated by the asset, and the borrower has little independent capacity to repay. This fundamental characteristic of reliance on asset-generated income for repayment is a core overlap in their treatment of these specific types of financing.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}