{
  "summary": "The EBA Guidelines on Credit Institutions' Credit Risk Management Practices and Accounting for Expected Credit Losses (EBA/GL/2017/06) mentions a 'minimum two year' probation period from the ITS on Non-performing loans and forbearance and requires credit institutions to consider supervisory disclosure requirements for this probation period. Several related documents discuss probation periods for defaulted exposures, primarily in the context of returning to non-defaulted status. The EBA Guidelines on the Application of the Definition of Default (EBA/GL/2016/07) explicitly specifies a minimum probation period of 3 months for returning from default to non-defaulted status, with flexibility for institutions to apply longer periods or differentiate lengths for different exposure types. This creates a potential overlap regarding the length of the 'probation period' although the context may differ slightly (general accounting/disclosure vs. definition of default). Additionally, there is an overlap in the general requirement for institutions to establish robust policies and procedures for ECL model validation, with the original document referencing paragraphs 64-67 and IFRS 9 (CELEX_32023R1803_EN_TXT.di_page_500) outlining specific disclosure requirements related to ECL estimation techniques, inputs, assumptions, and significant changes.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_80.json",
      "excerpt1": "A few respondents proposed to exclude the 'minimum two year' probation period included in the ITS on Non-performing loans and forbearance in order to promote institution-specific internal credit risk assessment. ... According to paragraph 41, credit institutions should consider the relevant supervisory disclosure requirements for the probation period when preparing their financial statements to the extent relevant.",
      "pageNumber1": 80,
      "filename2": "Final Report on Guidelines on default definition (EBA-GL-2016-07).di_page_59.json",
      "excerpt2": "Option e develops option d further, clarifying that different lengths of probation periods may be applied to different types of exposures. This adds more flexibility to the framework and allows institutions to better capture the specificities of different types of exposures, as requested by the industry in the responses to the consultation paper. ... The approach taken by the GL with regard to Stage 2 exposures is that they should be classified as defaulted if other indications of default apply but the fact that they are classified as Stage 2 should not automatically be treated as a trigger of default.",
      "pageNumber2": 59,
      "explanation": "Both documents refer to a 'probation period' for credit exposures. The original document mentions a 'minimum two year' probation period from the ITS on NPLs and forbearance and discusses supervisory disclosure for it in financial statements. The EBA Guidelines on the Application of the Definition of Default, from which the quoted excerpt is taken (page 59, option e), also discusses probation periods, including the flexibility to apply different lengths for different types of exposures, with a minimum duration of 3 months. While the 'two year' and 'three month' figures relate to different aspects (NPL/forbearance vs. definition of default return criteria), the core regulatory subject of 'probation period' for credit risk management and accounting contexts overlaps, especially as the original document mentions proposals to exclude the 'two year' period in favor of institution-specific assessment, which aligns with the flexibility discussed in the related document for different probation period lengths.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_80.json",
      "excerpt1": "Principle 5 (ECL model validation): one respondent mentioned that this section covers model development requirements which should not be listed as validation requirements, as it is potentially confusing and misleading. One respondent disagreed with the detailed requirements in paragraphs 64-67 on model validation. ... This principle and the paragraphs below aim to provide guidance on how a credit institution should establish robust policies and procedures to validate models used in the ECL measurement, as such models will play a key role in",
      "pageNumber1": 80,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_500.json",
      "excerpt2": "35G An entity shall explain the inputs, assumptions and estimation techniques used to apply the requirements in Section 5.5 of IFRS 9. For this purpose an entity shall disclose: (a) the basis of inputs and assumptions and the estimation techniques used to: (i) measure the 12-month and lifetime expected credit losses; (ii) determine whether the credit risk of financial instruments has increased significantly since initial recognition; and (iii) determine whether a financial asset is a credit-impaired financial asset. (b) how forward-looking information has been incorporated into the determination of expected credit losses, including the use of macroeconomic information; and (c) changes in the estimation techniques or significant assumptions made during the reporting period and the reasons for those changes.",
      "pageNumber2": 500,
      "explanation": "Both excerpts address the subject of Expected Credit Loss (ECL) models, specifically the policies, procedures, assumptions, and validation relating to their measurement. The original document refers to 'ECL model validation' and guidance on 'robust policies and procedures to validate models used in the ECL measurement'. The related document, which describes disclosure requirements for financial instruments under IFRS 9, details what an entity must disclose regarding the 'inputs, assumptions and estimation techniques used' for ECL measurement and how 'changes in the estimation techniques or significant assumptions' are handled. This demonstrates an overlap in the regulatory subject of establishing and validating ECL models and the underlying estimation methodology.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}