{
  "summary": "The EBA Guidelines on Expected Credit Losses specify their applicability to credit institutions using IFRS 9 and that competent authorities should ensure compliance on an individual, sub-consolidated, and consolidated basis. They also clarify that section 4.4 supplements the SREP for assessing credit risk management and ECL. The EBA Guidelines on Management of Non-Performing and Forborne Exposures contain similar provisions regarding competent authorities ensuring credit institutions comply with guidelines on an individual, sub-consolidated, and consolidated basis, and how SREP relates to the assessment of credit risk management and provisions for NPLs and FBEs. The Guidelines on Common Procedures and Methodologies for SREP and Supervisory Stress Testing further detail the SREP assessment of credit risk and provisioning for expected losses. Finally, Commission Implementing Regulation (EU) 2024/348 extends IFRS 9 benchmarking to high-default portfolios to understand inconsistencies in ECL outcomes.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_14.json",
      "excerpt1": "11. Competent authorities should ensure that credit institutions comply with these guidelines on an individual, sub-consolidated and consolidated basis in accordance with Article 109 of Directive 2013/36/EU.",
      "pageNumber1": 14,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_14.json",
      "excerpt2": "8. Competent authorities should ensure that credit institutions comply with these guidelines on an individual, sub-consolidated and consolidated basis in accordance with Article 109 of Directive 2013/36/EU.",
      "pageNumber2": 14,
      "explanation": "Both excerpts state that competent authorities should ensure credit institutions comply with the respective guidelines on an individual, sub-consolidated, and consolidated basis in accordance with Article 109 of Directive 2013/36/EU. This is a direct overlap in the requirement for consolidated supervision regarding compliance with EBA guidelines.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_14.json",
      "excerpt1": "12. Guidelines set out in section 4.4 should be considered as supplementing and further specifying the supervisory review and evaluation process (SREP) referred to in Article 97 and 107(1)(a) of Directive 2013/36/EU, in particular with regard to the assessment of credit risk management and controls and accounting for expected credit losses. Competent authorities should therefore comply with guidelines set out in section 4.4 in line with the EBA Guidelines on common procedures and methodologies for the supervisory review and evaluation process (SREP)18.",
      "pageNumber1": 14,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_9.json",
      "excerpt2": "19. In accordance with Article 97 of Directive 2013/36/EU, competent authorities should review the arrangements, strategies, processes and mechanisms implemented by credit institutions to determine whether the own funds and liquidity held by them ensure a sound management and coverage of their risk. Competent authorities, when conducting the SREP, must review whether credit institutions observe the provisions of these guidelines. As an outcome of the SREP, and in accordance with Article 104(1)(d) of Directive 2013/36/EU, competent authorities may require an institution to apply a specific provisioning policy, which may - where permitted by accounting rules and regulations - result in an increase in impairments, or the need to hold additional own funds.",
      "pageNumber2": 9,
      "explanation": "Both excerpts define the role of the Supervisory Review and Evaluation Process (SREP) in assessing credit institutions' risk management, specifically credit risk management and provisioning/accounting for expected losses, under Article 97 of Directive 2013/36/EU. The first excerpt states its guidelines supplement SREP for assessing credit risk management and accounting for expected credit losses. The second states that competent authorities, during SREP, review risk management arrangements and may require specific provisioning policies.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_14.json",
      "excerpt1": "12. Guidelines set out in section 4.4 should be considered as supplementing and further specifying the supervisory review and evaluation process (SREP) referred to in Article 97 and 107(1)(a) of Directive 2013/36/EU, in particular with regard to the assessment of credit risk management and controls and accounting for expected credit losses. Competent authorities should therefore comply with guidelines set out in section 4.4 in line with the EBA Guidelines on common procedures and methodologies for the supervisory review and evaluation process (SREP)18.",
      "pageNumber1": 14,
      "filename2": "Final Report on Guidelines on common procedures and methodologies for SREP and supervisory stress testing.di_page_88.json",
      "excerpt2": "216. Competent authorities should assess whether the level of loan loss provisions and credit valuation adjustments are appropriate for the quality of the exposures and, where relevant, for the level of collateral. Competent authorities should assess: a. whether the level of loan loss provisions is consistent with the level of risk in different portfolios, over time and compared with the institution's relevant peers; b. whether the credit valuation adjustments to derivatives' market values reflect the creditworthiness of relevant counterparties; c. whether accounting loan loss provisions are in line with applicable accounting principles and are assessed as sufficient to cover expected losses; d. whether non-performing, forborne exposures and foreclosed assets have been subject to sufficient loan loss provisions, taking into account the level of existing collateral and the vintage of such exposures and applicable legal requirements for the minimum loss coverage of non-performing exposures; and e. whether loan loss provisions are consistent with historical losses and relevant macroeconomic developments and reflect any changes to relevant regulations (e.g. foreclosure, repossession, creditor protection, etc.). 217. Where deemed necessary, competent authorities should use on-site inspections or other appropriate supervisory actions to assess whether or not the level of loan loss provisioning and risk coverage is adequate, by assessing a sample of loans, for example. 218. Competent authorities should also take into consideration any findings raised by internal and external auditors, where available. Stress testing 219. When evaluating the inherent credit risk of an institution, competent authorities should take into account the results of stress tests performed by the institution to identify any previously unidentified sources of credit risk, such as those emerging from changes in credit quality, credit concentrations, collateral value and credit exposure during a stressed period. 6.2.3 Assessment of credit risk management and controls 220. To achieve a comprehensive understanding of the institution's credit risk profile, competent authorities should also review the governance and risk management framework underlying its credit activities throughout the life cycle of a loan. To this end, competent authorities should assess the following elements, also having regard to the EBA Guidelines on loan origination and monitoring and the EBA Guidelines on management of non-performing and forborne exposures:",
      "pageNumber2": 88,
      "explanation": "The first excerpt states that its guidelines on expected credit losses supplement SREP regarding the assessment of credit risk management and accounting for expected credit losses. The second excerpt from the SREP guidelines details how competent authorities should assess loan loss provisions and credit risk management and controls, including the sufficiency of provisions to cover expected losses, directly aligning with the 'assessment of credit risk management and controls and accounting for expected credit losses' mentioned in the first excerpt as a SREP component.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_14.json",
      "excerpt1": "9. Guidelines set out in section 4.3 only apply in relation to credit institutions which prepare their financial statements in conformity with the International Financial Reporting Standards® ('IFRS® Standards') adopted in accordance with Regulation (CE) 1606/200217 and for which IFRS 9 Financial Instruments ('IFRS 9') applies.",
      "pageNumber1": 14,
      "filename2": "L_202400348EN.000101.fmx.json",
      "excerpt2": "(3) The IFRS 9 Benchmarking exercise is currently limited to low default portfolios, which does not provide the supervisors with a comprehensive view of the variability of the IFRS 9 Expected Credit Loss (ECL) models’ outcomes. To enable competent authorities to have a broader understanding of the sources of material inconsistencies in ECL outcomes, as stated in the EBA IFRS 9 Monitoring Report and following the staggered approach presented in the IFRS 9 roadmap, it is necessary to integrate additional portfolios and templates to gradually extend the IFRS 9 benchmarking exercise to the high default portfolios.",
      "pageNumber2": 1,
      "explanation": "Both excerpts address the application and monitoring of IFRS 9 related to expected credit losses (ECL) for credit institutions. The first excerpt defines the scope of its guidelines to credit institutions applying IFRS 9. The second discusses the IFRS 9 benchmarking exercise, specifically extending it to high-default portfolios to improve the understanding of ECL model outcomes. This shows a direct alignment in the regulatory subject of IFRS 9 and ECL application and supervision for credit institutions.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}