{
  "summary": "The EBA Guidelines (EBA-GL-2017-06) specify detailed documentation requirements for credit institutions regarding their Expected Credit Loss (ECL) assessment and measurement methods. This includes documenting the basis for grouping exposures, identifying and justifying measurement methods (e.g., loss rate, PD/LGD), detailing inputs, data, assumptions, how exposure life is determined, the historical loss evaluation period, and adjustments for current and forecasted economic conditions. Similarly, IFRS 9 (via CELEX_32023R1803_EN_TXT) outlines requirements for entities to use reasonable and supportable information, including historical data adjusted for current and future economic conditions, when measuring ECL. It also mandates considering factors specific to the borrower, general economic conditions, and forecasts of future conditions. There is a clear overlap in the requirement for entities to consider and document the use of historical data, adjustments for current and future economic conditions, and the use of various data sources in their ECL estimation process.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_22.json",
      "excerpt1": "f. document: i. the inputs, data and assumptions used in the allowance estimation process, such as historical loss rates, PD/LGD estimates and economic forecasts; [...] iv. any adjustments necessary for the estimation of ECL in accordance with the applicable accounting framework. For example, if current and forecasted economic conditions are different from those that existed during the historical estimation period being used, adjustments that are directionally consistent with those differences should be made. In addition, a credit institution may have experienced little to no actual losses in the historical period analysed; however, current or forward-looking conditions can differ from conditions during the historical period, and the impact of these changes on ECL should be assessed and measured; g. include a process for evaluating the appropriateness of significant inputs and assumptions in the ECL measurement method chosen. The basis for inputs and assumptions used in the process of the estimation of allowances should generally be consistent from period to period. Where the inputs and assumptions or the basis for these change, the rationale should be documented;",
      "pageNumber1": 22,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_633.json",
      "excerpt2": "B5.5.49 For the purpose of this Standard, reasonable and supportable information is that which is reasonably available at the reporting date without undue cost or effort, including information about past events, current conditions and forecasts of future economic conditions. [...] B5.5.51 An entity need not undertake an exhaustive search for information but shall consider all reasonable and supportable information that is available without undue cost or effort and that is relevant to the estimate of expected credit losses, including the effect of expected prepayments. The information used shall include factors that are specific to the borrower, general economic conditions and an assessment of both the current as well as the forecast direction of conditions at the reporting date. An entity may use various sources of data, that may be both internal (entity-specific) and external. Possible data sources include internal historical credit loss experience, internal ratings, credit loss experience of other entities and external ratings, reports and statistics. [...] B5.5.52 Historical information is an important anchor or base from which to measure expected credit losses. However, an entity shall adjust historical data, such as credit loss experience, on the basis of current observable data to reflect the effects of the current conditions and its forecasts of future conditions that did not affect the period on which the historical data is based, and to remove the effects of the conditions in the historical period that are not relevant to the future contractual cash flows. [...] An entity shall regularly review the methodology and assumptions used for estimating expected credit losses to reduce any differences between estimates and actual credit loss experience.",
      "pageNumber2": 633,
      "explanation": "Both texts require entities (credit institutions in the EBA GL) to document and use specific inputs, data, and assumptions for ECL estimation. They both emphasize the importance of historical loss data but mandate adjustments to reflect current and forecasted economic conditions. Both also mention the need for a process to evaluate the appropriateness of these inputs and assumptions, and to review methodologies.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_22.json",
      "excerpt1": "d. identify and document the ECL assessment and measurement methods (such as a loss rate method, probability of default (PD)/loss-given-default (LGD) method, or another method) to be applied to each exposure or portfolio; e. document the reasons why the selected method is appropriate, especially if different ECL measurement methods are applied to different portfolios and types of individual exposures. Credit institutions should be able to explain to the competent authorities the rationale for any changes in measurement approach (for example, a move from a loss rate method to a PD/LGD method) and the quantitative impacts of such changes;",
      "pageNumber1": 22,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_499.json",
      "excerpt2": "35B The credit risk disclosures made in accordance with paragraphs 35F-35N shall enable users of financial statements to understand the effect of credit risk on the amount, timing and uncertainty of future cash flows. To achieve this objective, credit risk disclosures shall provide: (a) information about an entity's credit risk management practices and how they relate to the recognition and measurement of expected credit losses, including the methods, assumptions and information used to measure expected credit losses;",
      "pageNumber2": 499,
      "explanation": "Both the EBA Guidelines and IFRS 9 (via CELEX_32023R1803_EN_TXT) require documentation and disclosure of the methods used for measuring expected credit losses. The EBA GL specifically states to 'identify and document the ECL assessment and measurement methods' and 'document the reasons why the selected method is appropriate', while IFRS 9 requires disclosure of 'information about an entity's credit risk management practices and how they relate to the recognition and measurement of expected credit losses, including the methods, assumptions and information used to measure expected credit losses'. These are substantially the same requirement.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_22.json",
      "excerpt1": "c. include, for collectively evaluated exposures, a description of the basis for creating groups of portfolios of exposures with shared credit risk characteristics;",
      "pageNumber1": 22,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_499.json",
      "excerpt2": "35F An entity shall explain its credit risk management practices and how they relate to the recognition and measurement of expected credit losses. To meet this objective an entity shall disclose information that enables users of financial statements to understand and evaluate: [...] (c) how the instruments were grouped if expected credit losses were measured on a collective basis;",
      "pageNumber2": 499,
      "explanation": "Both documents require information regarding the grouping of exposures for collective ECL measurement. The EBA GL specifies 'a description of the basis for creating groups of portfolios of exposures with shared credit risk characteristics', and IFRS 9 requires disclosing 'how the instruments were grouped if expected credit losses were measured on a collective basis'. This is a direct overlap in the requirement for documenting or disclosing the basis for collective grouping.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}