{
  "summary": "The EBA Guidelines (filename1) provide interpretations and expectations for credit institutions regarding IFRS 9's Expected Credit Loss (ECL) accounting, specifically addressing the use of practical expedients and the low credit risk exemption. It emphasizes that sound credit risk management should be applied to low credit risk exposures to demonstrate the appropriateness of this exemption. The related IFRS 9 text (CELEX_32023R1803_EN_TXT.di_page_629.json) defines the conditions for a financial instrument to be considered 'low credit risk' for the purpose of applying paragraph 5.5.10 of IFRS 9. There is an overlap in the subject of low credit risk exemptions and its application.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_86.json",
      "excerpt1": "On the use of the low credit risk exemption, the EBA guidelines aim to enhance timely assessment and tracking of significant increase of credit risk, including also cases of exposures with low credit risk. The EBA guidelines aim to ensure that the credit risk of these exposures is monitored adequately and that any increases in the ECL are recognised on a timely basis. Therefore, sound credit risk management should also be applied in the cases of low credit risk exposures, and this should allow a credit institution to demonstrate the appropriateness of the use of this exemption.",
      "pageNumber1": 86,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_629.json",
      "excerpt2": "B5.5.22 The credit risk on a financial instrument is considered low for the purposes of paragraph 5.5.10, if the financial instrument has a low risk of default, the borrower has a strong capacity to meet its contractual cash flow obligations in the near term and adverse changes in economic and business conditions in the longer term may, but will not necessarily, reduce the ability of the borrower to fulfil its contractual cash flow obligations. Financial instruments are not considered to have low credit risk when they are regarded as having a low risk of loss simply because of the value of collateral and the financial instrument without that collateral would not be considered low credit risk. Financial instruments are also not considered to have low credit risk simply because they have a lower risk of default than the entity's other financial instruments or relative to the credit risk of the jurisdiction within which an entity operates. B5.5.23 To determine whether a financial instrument has low credit risk, an entity may use its internal credit risk ratings or other methodologies that are consistent with a globally understood definition of low credit risk and that consider the risks and the type of financial instruments that are being assessed. An external rating of 'investment grade' is an example of a financial instrument that may be considered as having low credit risk. However, financial instruments are not required to be externally rated to be considered to have low credit risk. They should, however, be considered to have low credit risk from a market participant perspective taking into account all of the terms and conditions of the financial instrument.",
      "pageNumber2": 629,
      "explanation": "Both excerpts address the 'low credit risk exemption' for Expected Credit Losses (ECL) under IFRS 9 for credit institutions. Filename1 explains the EBA's expectations for credit institutions to apply sound credit risk management to these exposures to justify the exemption, emphasizing timely assessment and tracking of credit risk. Filename2 (IFRS 9 itself) provides the definition and criteria for when a financial instrument can be considered to have 'low credit risk' for the purposes of applying the exemption in paragraph 5.5.10 of IFRS 9. Both texts converge on the operational aspect of identifying and managing financial instruments qualifying for this exemption.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}