{
  "summary": "The provided texts contain overlaps regarding the responsibilities of a credit institution's management body and senior management in establishing and maintaining credit risk management strategies, policies, processes, and internal control systems. Both documents emphasize the need for sound practices in identifying, measuring, evaluating, monitoring, reporting, and mitigating credit risk, consistent with the institution's risk appetite.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_19.json",
      "excerpt1": "25. The credit institution's management body should be responsible for approving and regularly reviewing a credit institution's credit risk management strategy and the main policies and processes for identifying, measuring, evaluating, monitoring, reporting and mitigating credit risk consistent with the approved risk appetite set by the management body.",
      "pageNumber1": 19,
      "filename2": "BaselFramework.di_page_1787.json",
      "excerpt2": "40.39 Principle 17:41 The supervisor determines that banks have an adequate credit risk management process that considers their risk appetite, risk profile, market conditions, macroeconomic factors and forward-looking information. This includes prudent policies and processes to identify, measure, evaluate, monitor, report and control or mitigate credit risk42 (including counterparty credit risk43) on a timely basis.",
      "pageNumber2": 1787,
      "explanation": "Both excerpts address the responsibility for establishing and maintaining a credit risk management process that includes identifying, measuring, evaluating, monitoring, reporting, and mitigating credit risk, consistent with the institution's risk appetite. The first excerpt explicitly states the management body's responsibility, while the second outlines what a supervisor expects of a bank's credit risk management process.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_19.json",
      "excerpt1": "26. To fulfil these responsibilities, the management body should instruct senior management to: a. develop and maintain appropriate processes, which should be systematic and consistently applied, to determine appropriate allowances in accordance with the applicable accounting framework; b. establish and implement an effective internal control system for credit risk assessment and measurement; report periodically the results of the credit risk assessment and measurement processes, including estimates of its ECL allowances; c. establish, implement and, as necessary, update suitable policies and procedures to communicate the credit risk assessment and measurement process internally to all relevant staff, in particular staff members who are involved in that process. Senior management should be responsible for implementing the credit risk strategy approved by the management body and developing the aforementioned policies and processes. 27. An effective internal control system for credit risk assessment and measurement should include: a. measures to comply with applicable laws, regulations, internal policies and procedures; b. measures to provide oversight of the integrity of information used and reasonably ensure that the allowances reflected in the credit institution's financial statements and reports submitted to the competent authority are prepared in accordance with the applicable accounting framework and relevant supervisory requirements; c. well-defined credit risk assessment and measurement processes that are independent from (while taking appropriate account of) the lending function, which contain: i. an effective credit risk rating system that is consistently applied, accurately grades differentiating by credit risk characteristics, identifies changes in credit risk on a timely basis, and prompts appropriate action;",
      "pageNumber1": 19,
      "filename2": "BaselFramework.di_page_1789.json",
      "excerpt2": "(3) The supervisor requires and regularly determines that such policies and processes establish an appropriate and properly controlled credit risk environment, including: (a) a well documented and effectively implemented strategy and sound policies and processes for assuming credit risk, without undue reliance on external credit assessments; (b) well defined criteria and policies and processes for: (i) approving new exposures (including prudent underwriting standards), and ensuring a thorough understanding of the risk profile and characteristics of the borrowers (and in the case of securitisation exposures all features of securitisation transactions)44 that would materially impact the performance of these exposures; (ii) renewing and refinancing existing exposures; and (iii) identifying the appropriate approval authority for the size and complexity of the exposures; (c) effective credit administration policies and processes, including: continued analysis of a borrower's ability and willingness to make all payments associated with the contractual arrangements (including reviews of the performance of underlying assets, eg for securitisation exposures or project finance); monitoring of documentation, legal covenants, contractual requirements, collateral and other forms of credit risk mitigation; and an appropriate exposure grading or classification system; (d) effective information systems for accurate and timely identification, aggregation and reporting of credit risk exposures to the bank's board and senior management on an ongoing basis; (e) prudent and appropriate credit limits consistent with the bank's risk appetite, risk profile and capital strength, which are understood by and regularly communicated to relevant staff; (f) exception tracking and reporting processes that ensure prompt action at the appropriate level of the bank's senior management or board where necessary; and (g) effective controls (including in respect of the quality, reliability and relevance of data and in respect of validation procedures) around the use of models to identify and measure credit risk and set limits.",
      "pageNumber2": 1789,
      "explanation": "Both excerpts detail components of an effective internal control system and sound policies for credit risk management. The source lists elements like appropriate processes for allowances, an internal control system for assessment/measurement, and clear policies. The target describes specific requirements for a properly controlled credit risk environment, including documented strategies, defined criteria for approvals, effective administration/monitoring, information systems for reporting, prudent limits, and effective controls around model use, demonstrating a high degree of overlap in the required elements of a credit risk management framework.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}