{
  "summary": "The EBA Guidelines on Credit Institutions' Credit Risk Management Practices and Accounting for Expected Credit Losses (EBA-GL-2017-06) mandate that credit institutions consider various scenarios, document their processes for generating these, and demonstrate how Expected Credit Loss (ECL) estimates change with scenario alterations, including impacts on PD and LGD parameters. Similarly, the EBA Guidelines on Institutions' Stress Testing (EBA-GL-2018-04) require institutions to quantify the impact of stress scenarios on credit losses and other metrics. Both sets of guidelines focus on the use of scenario analysis in estimating credit losses and the impact on credit risk parameters like PD and LGD, indicating a clear overlap in the regulatory subject.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_25.json",
      "excerpt1": "38. Sound credit risk methodologies should consider different potential scenarios and should not rely purely on subjective, biased or overly optimistic considerations. Credit institutions should develop and document their processes to generate relevant scenarios to be used in the estimation of ECL. In particular: a. credit institutions should demonstrate and document how ECL estimates would alter with changes in scenarios, including changes to relevant external conditions that may impact ECL estimates or components of the ECL calculation (such as PD and LGD parameters);",
      "pageNumber1": 25,
      "filename2": "Guidelines on institutions stress testing (EBA-GL-2018-04).di_page_36.json",
      "excerpt2": "113. Institutions should consider, wherever possible, the following relevant parameters: PD, LGD, EAD, expected loss (EL) and risk exposure amount, and the impact on credit losses and own funds requirements. 114. For the estimation of future losses in stress tests, institutions should, where appropriate, rely on credit risk parameters different from the ones applied in the calculation of capital requirements, which are usually through-the-cycle or hybrid parameters (a combination of through-the-cycle and point-in-time parameters) for PD and under downturn conditions for LGD. In particular, institutions should, where relevant, apply estimates based on point-in-time parameters in accordance with the severity of the scenario for the purpose of estimating credit losses.",
      "pageNumber2": 36,
      "explanation": "Both excerpts address the same regulatory subject: the use of scenarios and the estimation of credit losses (ECL or 'future losses') by credit institutions. They both require institutions to consider different scenarios and how these scenarios, including changes to external conditions and credit risk parameters (PD and LGD), impact credit loss estimates. The core obligation for scenario-based impact assessment on credit losses and underlying parameters is consistent between accounting for ECL and stress testing.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_25.json",
      "excerpt1": "38. Sound credit risk methodologies should consider different potential scenarios and should not rely purely on subjective, biased or overly optimistic considerations. Credit institutions should develop and document their processes to generate relevant scenarios to be used in the estimation of ECL. In particular: a. credit institutions should demonstrate and document how ECL estimates would alter with changes in scenarios, including changes to relevant external conditions that may impact ECL estimates or components of the ECL calculation (such as PD and LGD parameters); b. credit institutions should have a documented process for determining the time horizon of the scenarios and, if relevant, how ECL is estimated for exposures whose lives exceed the period covered by the economic forecast(s) used; c. scenarios may be internally developed or outsourced. For internally developed scenarios, credit institutions should have a variety of experts, such as risk experts, economists, business managers and senior management, assisting in the selection of scenarios that are relevant to the credit institutions' credit risk exposure profile. For outsourced scenarios, credit institutions should ensure that the external provider tailors the scenarios to reflect the credit institutions' business and credit risk exposure profile, as credit institutions remain responsible for those scenarios; d. backtesting should be performed to ensure that the most relevant economic factors that affect collectability and credit risk are being considered and incorporated into ECL estimates; and e. where market indicators (such as credit default swaps ('CDS') spreads) are available, senior management may consider them to be a valid benchmark against which to check the consistency of its own judgements. 39. While a credit institution does not need to identify or model every possible scenario through scenario simulations, it should consider all reasonable and supportable information that is relevant to the product, borrower, business model or economic and regulatory environment",
      "pageNumber1": 25,
      "filename2": "BaselFramework.di_page_384.json",
      "excerpt2": "Stress tests used in assessment of capital adequacy 36.50 An IRB bank must have in place sound stress testing processes for use in the assessment of capital adequacy. Stress testing must involve identifying possible events or future changes in economic conditions that could have unfavourable effects on a bank's credit exposures and assessment of the bank's ability to withstand such changes. Examples of scenarios that could be used are: (1) economic or industry downturns; (2) market-risk events; and (3) liquidity conditions.",
      "pageNumber2": 384,
      "explanation": "Both excerpts address the need for financial institutions to perform scenario analysis to assess the impact of future changes in economic conditions on credit exposures. Document 1 focuses on generating scenarios for ECL estimation, while Document 2 specifies stress testing processes for capital adequacy, including identifying possible events or future changes in economic conditions that could impact credit exposures. The core requirement of using forward-looking scenarios to assess credit risk is consistent, although the specific context (ECL vs. capital adequacy) differs slightly, the underlying practice of scenario generation for credit risk assessment aligns.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}