{
  "summary": "The EBA Guidelines and the EU Regulation both address the use of forward-looking information, including macroeconomic factors, for estimating Expected Credit Losses (ECL) and the principles for performing collective assessments of credit risk. They converge on the need for institutions to consider such information and to group financial instruments based on shared credit risk characteristics to identify significant increases in credit risk in a timely manner.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_38.json",
      "excerpt1": "91. In formulating the estimate of the amount equal to 12-month ECL, credit institutions should consider reasonable and supportable information, as referred to in the Definitions and in Principle 6 of these guidelines, that affect credit risk, especially forward-looking information, including macroeconomic factors. Credit institutions should exercise experienced credit judgement to consider both qualitative and quantitative information that may affect the credit institution's assessment of credit risk. IFRS 9 provides that an entity does not need to undertake an exhaustive search for information when measuring an amount equal to 12- month ECL. However, credit institutions should actively incorporate information that may affect the estimate of ECL, and credit institutions should not exclude or ignore relevant information that is reasonably available.",
      "pageNumber1": 38,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_624.json",
      "excerpt2": "B5.5.4 In some circumstances an entity does not have reasonable and supportable information that is available without undue cost or effort to measure lifetime expected credit losses on an individual instrument basis. In that case, lifetime expected credit losses shall be recognised on a collective basis that considers compre- hensive credit risk information. This comprehensive credit risk information must incorporate not only past due information but also all relevant credit information, including forward-looking macroeconomic information, in order to approximate the result of recognising lifetime expected credit losses when there has been a significant increase in credit risk since initial recognition on an individual instrument level.",
      "pageNumber2": 624,
      "explanation": "Both excerpts emphasize the importance of considering forward-looking information, including macroeconomic factors, when estimating Expected Credit Losses (ECL). Excerpt 1 explicitly states that credit institutions should consider 'forward-looking information, including macroeconomic factors' for 12-month ECL, while Excerpt 2 requires 'comprehensive credit risk information [to] incorporate not only past due information but also all relevant credit information, including forward-looking macroeconomic information' for lifetime ECL on a collective basis. Both underline the need for this information in credit risk assessment and ECL measurement.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_38.json",
      "excerpt1": "94. Where a collective assessment is performed, exposures within that group should adhere to the requirements set out in Principle 3 of these guidelines. In particular, where information becomes available to the credit institution indicating that further or different segmentation within a group of lending exposures is required, the group should be split into subgroups and the measurement of the amount equal to 12-month ECL should be updated separately for each subgroup or, in the case of transient circumstances, a temporary adjustment should be applied (see Principle 3 of these guidelines and its detailed requirements on the use of temporary adjustments). Where information becomes available which indicates that a particular subgroup has suffered a significant increase in credit risk, then lifetime ECL should be recognised in respect of that subgroup. 95. Lending exposures should not be grouped in such a way as to obscure the identification of significant increases in credit risk on a timely basis (see also Principles 3 and 4 of these guidelines for additional requirements regarding grouping and collective assessments of ECL).",
      "pageNumber1": 38,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_624.json",
      "excerpt2": "B5.5.1 In order to meet the objective of recognising lifetime expected credit losses for significant increases in credit risk since initial recognition, it may be necessary to perform the assessment of significant increases in credit risk on a collective basis by considering information that is indicative of significant increases in credit risk on, for example, a group or sub-group of financial instruments. This is to ensure that an entity meets the objective of recognising lifetime expected credit losses when there are significant increases in credit risk, even if evidence of such significant increases in credit risk at the individual instrument level is not yet available. B5.5.5 For the purpose of determining significant increases in credit risk and recognising a loss allowance on a collective basis, an entity can group financial instruments on the basis of shared credit risk characteristics with the objective of facilitating an analysis that is designed to enable significant increases in credit risk to be identified on a timely basis. The entity should not obscure this information by grouping financial instruments with different risk characteristics.",
      "pageNumber2": 624,
      "explanation": "Both documents establish guidelines for the collective assessment of credit risk and the grouping of financial instruments. Excerpt 1, paragraphs 94 and 95, discusses splitting groups into subgroups for updated 12-month ECL measurement and emphasizes that grouping should not 'obscure the identification of significant increases in credit risk on a timely basis'. Excerpt 2, paragraphs B5.5.1 and B5.5.5, states that assessment may be performed on a 'collective basis by considering information that is indicative of significant increases in credit risk on, for example, a group or sub-group of financial instruments' and specifies that an entity can 'group financial instruments on the basis of shared credit risk characteristics with the objective of facilitating an analysis that is designed to enable significant increases in credit risk to be identified on a timely basis' and 'should not obscure this information by grouping financial instruments with different risk characteristics.' These provisions overlap in their objective and method for grouping exposures for collective assessment to ensure timely identification of credit risk increases.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}