{
  "summary": "The EBA Guidelines emphasize consistency with IFRS 7 and IFRS 9 for disclosures related to expected credit losses and asset quality for credit institutions, while aiming to avoid additional prescriptive requirements. Similarly, IFRS 7 (as part of Regulation (EU) 2023/1803) lays down detailed disclosure requirements for financial instruments, including specific information about credit risk management practices and expected credit losses, which are applicable to all entities, including credit institutions.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_82.json",
      "excerpt1": "Principle 8 (Disclosures): A few respondents mentioned that principle 8 (Disclosures) (and paragraphs 81 and 83) could add significant burden to the already existing requirements under IFRS 7 for credit institutions, and that there is a need for specific reference to IFRS 7, where the guidelines refer to them. Another respondent suggested that disclosure requirements be left to accounting and supervisory frameworks and that, if disclosures in addition to those required by IFRS 7 are introduced, the reason for that should be explained. One respondent mentioned that it would be better if the guidelines included only high-level disclosure principles and a request to comply with all relevant accounting rules and regulatory requirements, or a clear statement that they do not request disclosure beyond the requirements in the applicable accounting and regulatory rules. However, another respondent suggested that the guidelines should ensure industry-consistent disclosures on asset quality in each of the institution in meeting this requirement by various possible means. On disclosures, the guidelines are in line with BCBS guidance while avoiding the introduction of additional requirements, which are already seen as too prescriptive by other respondents. The EBA believes that the current text strikes the appropriate balance between providing guidance on disclosures and at the same time ensuring consistency with BCBS guidance. Regarding the consistency with the disclosure requirements under IFRS 7, the EBA believes that these guidelines are consistent with IFRS and that a high-quality implementation of IFRS 9 should enable credit institutions to provide high-quality disclosures.",
      "pageNumber1": 82,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_499.json",
      "excerpt2": "35B The credit risk disclosures made in accordance with paragraphs 35F-35N shall enable users of financial statements to understand the effect of credit risk on the amount, timing and uncertainty of future cash flows. To achieve this objective, credit risk disclosures shall provide: (a) information about an entity's credit risk management practices and how they relate to the recognition and measurement of expected credit losses, including the methods, assumptions and information used to measure expected credit losses; (b) quantitative and qualitative information that allows users of financial statements to evaluate the amounts in the financial statements arising from expected credit losses, including changes in the amount of expected credit losses and the reasons for those changes; and (c) information about an entity's credit risk exposure (ie the credit risk inherent in an entity's financial assets and commitments to extend credit) including significant credit risk concentrations. ... 35F An entity shall explain its credit risk management practices and how they relate to the recognition and measurement of expected credit losses. To meet this objective an entity shall disclose information that enables users of financial statements to understand and evaluate: (a) how an entity determined whether the credit risk of financial instruments has increased significantly since initial recognition, including, if and how: (i) financial instruments are considered to have low credit risk in accordance with paragraph 5.5.10 of IFRS 9, including the classes of financial instruments to which it applies; and (ii) the presumption in paragraph 5.5.11 of IFRS 9, that there have been significant increases in credit risk since initial recognition when financial assets are more than 30 days past due, has been rebutted; (b) an entity's definitions of default, including the reasons for selecting those definitions; (c) how the instruments were grouped if expected credit losses were measured on a collective basis; (d) how an entity determined that financial assets are credit-impaired financial assets; (e) an entity's write-off policy, including the indicators that there is no reasonable expectation of recovery and information about the policy for financial assets that are written-off but are still subject to enforcement activity; and",
      "pageNumber2": 499,
      "explanation": "Both excerpts address disclosure requirements for credit institutions related to expected credit losses (ECL) and credit risk management practices under IFRS 7 and IFRS 9. The EBA guidelines explicitly state their consistency with IFRS 7 and IFRS 9 regarding disclosures, aiming to strike a balance without introducing additional prescriptive requirements. The IFRS 7 text (within Regulation (EU) 2023/1803) details specific disclosures an entity (including credit institutions) must provide regarding credit risk management, the measurement of expected credit losses, and how these practices relate to IFRS 9. They regulate the same subject (disclosures on credit risk and ECL) for the same actor (credit institutions, as IFRS 7 applies to all entities with financial instruments, including credit institutions) within the same functional context (accounting and financial reporting).",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_82.json",
      "excerpt1": "Principle 8 (Disclosures): A few respondents mentioned that principle 8 (Disclosures) (and paragraphs 81 and 83) could add significant burden to the already existing requirements under IFRS 7 for credit institutions, and that there is a need for specific reference to IFRS 7, where the guidelines refer to them. Another respondent suggested that disclosure requirements be left to accounting and supervisory frameworks and that, if disclosures in addition to those required by IFRS 7 are introduced, the reason for that should be explained. One respondent mentioned that it would be better if the guidelines included only high-level disclosure principles and a request to comply with all relevant accounting rules and regulatory requirements, or a clear statement that they do not request disclosure beyond the requirements in the applicable accounting and regulatory rules. However, another respondent suggested that the guidelines should ensure industry-consistent disclosures on asset quality in each of the institution in meeting this requirement by various possible means. On disclosures, the guidelines are in line with BCBS guidance while avoiding the introduction of additional requirements, which are already seen as too prescriptive by other respondents. The EBA believes that the current text strikes the appropriate balance between providing guidance on disclosures and at the same time ensuring consistency with BCBS guidance. Regarding the consistency with the disclosure requirements under IFRS 7, the EBA believes that these guidelines are consistent with IFRS and that a high-quality implementation of IFRS 9 should enable credit institutions to provide high-quality disclosures.",
      "pageNumber1": 82,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_485.json",
      "excerpt2": "1 The objective of this IFRS is to require entities to provide disclosures in their financial statements that enable users to evaluate: (a) the significance of financial instruments for the entity's financial position and performance; and (b) the nature and extent of risks arising from financial instruments to which the entity is exposed during the period and at the end of the reporting period, and how the entity manages those risks. 2 The principles in this IFRS complement the principles for recognising, measuring and presenting financial assets and financial liabilities in IAS 32 Financial Instruments: Presentation and IFRS 9 Financial Instruments.",
      "pageNumber2": 485,
      "explanation": "Both excerpts address the objective and scope of disclosures related to financial instruments and risks for entities, including credit institutions. The EBA Guidelines refer to 'Principle 8 (Disclosures)' and specifically discuss alignment with 'IFRS 7 for credit institutions' and 'consistency with IFRS 9' for providing 'high-quality disclosures' on 'asset quality'. IFRS 7 itself (as presented in the second excerpt) states its objective to require entities to provide disclosures enabling users to evaluate the 'significance of financial instruments' and 'the nature and extent of risks arising from financial instruments', complementing IFRS 9. This directly overlaps as both refer to the overarching objective and principles for financial instrument disclosures for credit institutions under the IFRS framework.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}