{
  "summary": "The EBA Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06) specify criteria for credit institutions regarding the assessment of credit risk and Expected Credit Loss (ECL) measurement for renegotiated/modified lending exposures and purchased/originated credit-impaired exposures. This includes requirements for robust assessment methodologies, the need for strong evidence before considering decreased credit risk post-modification, careful consideration of principal collection, and prompt notification to accounting functions. The related documents from CELEX_32023R1803_EN_TXT (IFRS 9) also provide detailed requirements and guidance on the accounting for modifications of financial assets and the identification of purchased or originated credit-impaired financial assets, including how such events impact the measurement of expected credit losses and when a 'new' financial asset is recognized. There is a clear overlap in the specific rules and conditions for managing modified or credit-impaired exposures and their impact on ECL calculations.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_27.json",
      "excerpt1": "a. Credit institutions should take into account the following criteria regarding renegotiations/modifications of lending exposures: i. The allowance methodology should enable credit institutions to perform a robust assessment of credit risk and measurement of ECL such that the allowance level continues to reflect the collectability of the substance of the renegotiated/modified exposure, irrespective of whether or not the original asset is derecognised under the applicable accounting framework. ii. Renegotiations/modifications should not automatically lead to the conclusion that there has been an immediate decrease in the credit risk of the exposure. Any decrease in the reported allowance level due to improved credit risk should be supported by strong evidence. Customers should demonstrate consistently satisfactory payment performance over a reasonable period of time before credit risk would be considered to have decreased, considering also the relevant requirements for exposures in the probation period as defined in Part 2 of Annex V of Commission Implementing Regulation (EU) 680/2014.",
      "pageNumber1": 27,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_629.json",
      "excerpt2": "B5.5.25 In some circumstances, the renegotiation or modification of the contractual cash flows of a financial asset can lead to the derecognition of the existing financial asset in accordance with this Standard. When the modification of a financial asset results in the derecognition of the existing financial asset and the subsequent recognition of the modified financial asset, the modified asset is considered a 'new' financial asset for the purposes of this Standard. B5.5.26 Accordingly the date of the modification shall be treated as the date of initial recognition of that financial asset when applying the impairment requirements to the modified financial asset. This typically means measuring the loss allowance at an amount equal to 12-month expected credit losses until the requirements for the recognition of lifetime expected credit losses in paragraph 5.5.3 are met. However, in some unusual circumstances following a modification that results in derecognition of the original financial asset, there may be evidence that the modified financial asset is credit-impaired at initial recognition, and thus, the financial asset should be recognised as an originated credit-impaired financial asset. This might occur, for example, in a situation in which there was a substantial modification of a distressed asset that resulted in the derecognition of the original financial asset. In such a case, it may be possible for the modification to result in a new financial asset which is credit- impaired at initial recognition.",
      "pageNumber2": 629,
      "explanation": "Both excerpts address the accounting treatment of renegotiated or modified lending exposures, specifically focusing on whether the original asset is derecognized and how credit risk and expected credit losses (ECL) are assessed post-modification. The EBA guidelines emphasize that renegotiations should not automatically lead to a decrease in credit risk and require strong evidence for such a decrease, while IFRS 9 (through CELEX_32023R1803) details the implications of modifications leading to derecognition and the subsequent recognition of a 'new' financial asset for impairment purposes, including the possibility of a modified asset being credit-impaired at initial recognition.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_27.json",
      "excerpt1": "a. Credit institutions should take into account the following criteria regarding renegotiations/modifications of lending exposures: ii. Renegotiations/modifications should not automatically lead to the conclusion that there has been an immediate decrease in the credit risk of the exposure. Any decrease in the reported allowance level due to improved credit risk should be supported by strong evidence. Customers should demonstrate consistently satisfactory payment performance over a reasonable period of time before credit risk would be considered to have decreased, considering also the relevant requirements for exposures in the probation period as defined in Part 2 of Annex V of Commission Implementing Regulation (EU) 680/2014.",
      "pageNumber1": 27,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_630.json",
      "excerpt2": "B5.5.27 If the contractual cash flows on a financial asset have been renegotiated or otherwise modified, but the financial asset is not derecognised, that financial asset is not automatically considered to have lower credit risk. An entity shall assess whether there has been a significant increase in credit risk since initial recognition on the basis of all reasonable and supportable information that is available without undue cost or effort. This includes historical and forward-looking information and an assessment of the credit risk over the expected life of the financial asset, which includes information about the circumstances that led to the modification. Evidence that the criteria for the recognition of lifetime expected credit losses are no longer met may include a history of up-to-date and timely payment performance against the modified contractual terms. Typically a customer would need to demonstrate consistently good payment behaviour over a period of time before the credit risk is considered to have decreased. For example, a history of missed or incomplete payments would not typically be erased by simply making one payment on time following a modification of the contractual terms.",
      "pageNumber2": 630,
      "explanation": "Both excerpts deal with the assessment of credit risk after a renegotiation or modification of a financial asset. The EBA guidelines state that renegotiations should not automatically lead to a decrease in credit risk and require strong evidence, including consistently satisfactory payment performance over a reasonable period. IFRS 9 (through CELEX_32023R1803) echoes this by stating that a modified financial asset not derecognized is not automatically considered to have lower credit risk, requiring assessment based on all available information, and explicitly mentions that a customer typically needs to demonstrate consistently good payment behaviour over time for credit risk to be considered decreased.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_27.json",
      "excerpt1": "b. Credit institutions should take into account the following criteria regarding purchased or originated credit-impaired lending exposures: i. The methodology should enable appropriate identification and accounting for purchased or originated credit-impaired lending. ii. The cash flow estimates for these lending exposures should be reviewed each reporting period and updated as necessary. Such updates should be properly supported and documented, and approved by senior management.",
      "pageNumber1": 27,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_552.json",
      "excerpt2": "Purchased or originated credit-impaired financial assets 5.5.13 Despite paragraphs 5.5.3 and 5.5.5, at the reporting date, an entity shall only recognise the cumu- lative changes in lifetime expected credit losses since initial recognition as a loss allowance for purchased or originated credit-impaired financial assets. 5.5.14 At each reporting date, an entity shall recognise in profit or loss the amount of the change in lifetime expected credit losses as an impairment gain or loss. An entity shall recognise favourable changes in lifetime expected credit losses as an impairment gain, even if the lifetime expected credit losses are less than the amount of expected credit losses that were included in the estimated cash flows on initial recognition.",
      "pageNumber2": 552,
      "explanation": "Both excerpts discuss the treatment of purchased or originated credit-impaired lending/financial exposures. The EBA guidelines state that methodologies should enable appropriate identification and accounting, and that cash flow estimates should be reviewed and updated each reporting period. IFRS 9 (through CELEX_32023R1803) provides specific rules for accounting for these assets, requiring the recognition of cumulative changes in lifetime expected credit losses as a loss allowance and recognition of changes in profit or loss at each reporting date.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_27.json",
      "excerpt1": "b. Credit institutions should take into account the following criteria regarding purchased or originated credit-impaired lending exposures: i. The methodology should enable appropriate identification and accounting for purchased or originated credit-impaired lending. ii. The cash flow estimates for these lending exposures should be reviewed each reporting period and updated as necessary. Such updates should be properly supported and documented, and approved by senior management.",
      "pageNumber1": 27,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_549.json",
      "excerpt2": "5.4.1 Interest revenue shall be calculated by using the effective interest method (see Appendix A and paragraphs B5.4.1-B5.4.7). This shall be calculated by applying the effective interest rate to the gross carrying amount of a financial asset except for: (a) purchased or originated credit-impaired financial assets. For those financial assets, the entity shall apply the credit-adjusted effective interest rate to the amortised cost of the financial asset from initial recognition.",
      "pageNumber2": 549,
      "explanation": "Both excerpts address accounting for purchased or originated credit-impaired exposures. The EBA guidelines require a methodology for appropriate identification and accounting for such exposures, including reviewing and updating cash flow estimates. IFRS 9 (through CELEX_32023R1803) specifies how interest revenue is calculated for these assets, requiring the application of a credit-adjusted effective interest rate to the amortized cost from initial recognition, which is a key aspect of their accounting treatment.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}