{
  "summary": "Both excerpts address the obligations of credit institutions regarding the estimation of expected credit losses (ECL) and loss allowances. Excerpt 1 specifies that credit institutions applying IFRS 9 should comply with EBA guidelines in a proportionate manner when measuring ECL, taking into account their size, organization, and complexity. Excerpt 2 mandates that credit institutions estimate loss allowances for Non-Performing Exposures (NPEs) and Forborne Exposures (FBEs) in accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses (which is the source document for excerpt 1). This clearly indicates that both documents refer to the same set of guidelines and subject matter.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_9.json",
      "excerpt1": "14. In particular, on the considerations on proportionate application of the EBA guidelines, the EBA notes that all credit institutions applying IFRS 9 should ensure that they meet the objectives of IFRS 9 when applying the standard. However, the EBA understands that the way of meeting these objectives may differ across credit institutions; for example, different techniques or models may be used in the measurement of ECL. Credit institutions should comply with these guidelines in a proportionate manner taking into account various criteria, such as their size and internal organisation and the nature, scope and complexity of their activities and portfolios, as described in paragraph 17 of the guidelines. Credit institutions should, however, take into consideration if using practical expedients that the objective of IFRS 9 is to estimate ECL to reflect an unbiased and probability-weighted amount that is determined by evaluating a range of possible outcomes (IFRS 9, paragraph 5.5.17)",
      "pageNumber1": 9,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_48.json",
      "excerpt2": "167. Credit institutions should estimate loss allowances for NPEs and FBEs subject to impairment in accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses.",
      "pageNumber2": 48,
      "explanation": "Both excerpts govern the same regulatory subject: the obligations of credit institutions regarding the estimation and accounting for expected credit losses (ECL) and loss allowances. Excerpt 1 from the ECL Guidelines sets out the general principle of proportionate application for credit institutions when measuring ECL under IFRS 9. Excerpt 2 from the NPE Guidelines explicitly refers to the 'EBA Guidelines on credit risk management practices and accounting for expected credit losses' (the source of excerpt 1) as the standard that credit institutions should follow for estimating loss allowances for NPEs and FBEs. This creates an overlap by reinforcing the applicability of the ECL guidelines to a specific type of exposure (NPEs and FBEs) and ensuring consistency in the underlying methodology for loss allowance estimation across different EBA guidelines.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}