{
  "summary": "The two documents present an overlap in their requirements for credit institutions regarding the measurement of expected credit losses. Both sources mandate the use of 'reasonable and supportable information' and specify that institutions do not need to identify 'every possible scenario' when evaluating a range of possible outcomes. The EBA Guidelines additionally require documented justification in exceptional circumstances where relevant information is not deemed reasonable and supportable.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_79.json",
      "excerpt1": "Paragraph 23 of the guidelines is consistent with the requirements in BCBS guidance and it is explained that the cases when information relevant to the assessment and measurement of credit risk is not reasonable and supportable would be exceptional. It requires documentation in circumstances in which information is relevant to the assessment and measurement of credit risk but which is not reasonable and supportable, so the focus is likely to be on the bounds of what is reasonable and supportable. In addition, with regard to the comment on the justification for not including every possible scenario, paragraph 39 of the guidelines explicitly mentions that a credit institution does not need to identify or model every possible scenario through scenario simulations but should consider all reasonable and supportable information. Therefore, the EBA believes that, for these exceptional cases, the guidelines are sufficiently balanced by requiring justification without imposing significant additional burden. Similarly, paragraph 38 is consistent with the BCBS guidance and it requires that credit institutions develop and document their processes to generate relevant scenarios in line with sound credit risk methodologies.",
      "pageNumber1": 79,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_553.json",
      "excerpt2": "5.5.17 An entity shall measure expected credit losses of a financial instrument in a way that reflects: (a) an unbiased and probability-weighted amount that is determined by evaluating a range of possible outcomes; (b) the time value of money; and (c) reasonable and supportable information that is available without undue cost or effort at the reporting date about past events, current conditions and forecasts of future economic conditions. 5.5.18 When measuring expected credit losses, an entity need not necessarily identify every possible scenario. However, it shall consider the risk or probability that a credit loss occurs by reflecting the possibility that a credit loss occurs and the possibility that no credit loss occurs, even if the possibility of a credit loss occurring is very low.",
      "pageNumber2": 553,
      "explanation": "Both texts address the measurement of expected credit losses (ECLs) for credit institutions/entities. The EBA Guidelines' analysis of paragraph 39 states that 'a credit institution does not need to identify or model every possible scenario through scenario simulations but should consider all reasonable and supportable information'. This aligns directly with IFRS 9, paragraphs 5.5.17(c) and 5.5.18, which require measurement based on 'reasonable and supportable information' and state that 'an entity need not necessarily identify every possible scenario'. The EBA Guidelines further elaborate on the need for documented justification in exceptional cases, which complements but does not contradict the IFRS 9 requirements.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}