{
  "summary": "The comparison identifies multiple overlaps between the EBA Guidelines on credit institutions' credit risk management practices and accounting for expected credit losses (EBA-GL-2017-06) and other EBA guidelines, particularly those on loan origination and monitoring, and the management of non-performing and forborne exposures. These overlaps primarily concern the overarching requirements for credit institutions' internal credit risk management frameworks, including policies, procedures, governance, data infrastructure, and monitoring activities, all of which are fundamental to both prudent lending and the accurate assessment and accounting of expected credit losses and provisions.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_13.json",
      "excerpt1": "These guidelines specify sound credit risk management practices for credit institutions associated with the implementation and ongoing application of expected credit loss ('ECL') accounting frameworks. These guidelines apply in relation to those credit institutions' credit risk management practices affecting the assessment of credit risk and measurement of expected credit losses from lending exposures and allowances under the applicable accounting framework. These guidelines do not set out any additional requirements regarding the determination of expected loss for regulatory capital purposes.",
      "pageNumber1": 13,
      "filename2": "EBA%20GL%202020%2006%20Final%20Report%20on%20GL%20on%20loan%20origination%20and%20monitoring.di_page_21.json",
      "excerpt2": "Institutions should set out, in their credit risk policies and procedures, the criteria for identifying, assessing, approving, monitoring, reporting and mitigating credit risk, and the criteria for measuring allowances for both accounting and capital adequacy purposes. Institutions should document the framework and update it regularly.",
      "pageNumber2": 21,
      "explanation": "Both excerpts address credit institutions' obligations regarding credit risk management practices, specifically the policies and procedures for identifying, assessing, monitoring, and mitigating credit risk, and the measurement of allowances for accounting purposes. Filename1 sets the general scope for ECL accounting frameworks, while filename2 provides more detail on the policies and procedures for measuring allowances for accounting purposes within the credit risk management framework. The subject of 'measuring allowances for accounting purposes' is common to both, representing a divergent but related rule for the same regulatory subject.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_13.json",
      "excerpt1": "These guidelines specify sound credit risk management practices for credit institutions associated with the implementation and ongoing application of expected credit loss ('ECL') accounting frameworks. These guidelines also provide competent authorities with guidance on evaluating the effectiveness of an institution's credit risk management practices, policies, processes and procedures that affect allowance levels. These guidelines apply in relation to those credit institutions' credit risk management practices affecting the assessment of credit risk and measurement of expected credit losses from lending exposures and allowances under the applicable accounting framework.",
      "pageNumber1": 13,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_49.json",
      "excerpt2": "Credit institutions should adopt, document and adhere to sound policies, procedures and controls for assessing and measuring loss allowances and write-off on NPEs in accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses. Credit institutions should back-test their loss allowance estimations against actual losses. These methodologies should also include policies and procedures on write-offs and recoveries as defined in the EBA Guidelines on credit risk management practices and accounting for expected credit losses. The policy on write-offs should include indicators used to assess expectations of recovery and detailed information on those exposures that have been written off but are still subject to enforcement activity. In accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses, credit institutions should have in place common processes, systems, tools and data.",
      "pageNumber2": 49,
      "explanation": "Both excerpts deal with credit institutions' practices for assessing and measuring loss allowances. Filename1 broadly specifies sound credit risk management practices for ECL accounting, including assessment of credit risk and measurement of expected credit losses. Filename2 specifically mandates credit institutions to adopt, document, and adhere to sound policies, procedures, and controls for assessing and measuring loss allowances and write-offs on Non-Performing Exposures (NPEs), explicitly referencing filename1. This direct cross-reference and reiteration of requirements for 'assessing and measuring loss allowances' constitutes an overlap.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_13.json",
      "excerpt1": "These guidelines specify sound credit risk management practices for credit institutions associated with the implementation and ongoing application of expected credit loss ('ECL') accounting frameworks. These guidelines apply in relation to those credit institutions' credit risk management practices affecting the assessment of credit risk and measurement of expected credit losses from lending exposures and allowances under the applicable accounting framework. These guidelines also apply when, where permitted by the applicable accounting framework, the carrying amount of the lending exposure is reduced directly without the use of an allowance account. These guidelines do not set out any additional requirements regarding the determination of expected loss for regulatory capital purposes.",
      "pageNumber1": 13,
      "filename2": "Final%20Guidelines%20on%20management%20of%20non-performing%20and%20forborne%20exposures.di_page_48.json",
      "excerpt2": "Credit institutions should estimate loss allowances for NPEs and FBEs subject to impairment in accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses. This section sets out the key elements of governance and operations in relation to NPE impairment measurement and write-offs. In accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses, uncollectability should be recognised in the appropriate period through loss allowances or write-offs. When the credit institution has no reasonable expectation of recovering contractual cash flow of the exposure it should lead to a partial or full write-off of the exposure (IFRS 9.B3.2.16.r).",
      "pageNumber2": 48,
      "explanation": "Both excerpts address the practices for estimating loss allowances and write-offs for credit institutions. Filename1 establishes the general framework for credit risk management practices and accounting for ECL, including allowances. Filename2 explicitly mandates the estimation of loss allowances for NPEs and FBEs in accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses (filename1), and specifies the recognition of uncollectability through loss allowances or write-offs. This direct reference and shared subject matter on 'loss allowances' and 'write-offs' constitute an overlap.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}