{
  "summary": "The provided text segments discuss the application of the principle of proportionality and materiality for credit institutions within EBA guidelines. One segment (filename1) emphasizes that EBA guidelines on accounting for Expected Credit Losses (ECL) under IFRS 9 should be applied proportionately, considering the nature, scope, and complexity of institutions' activities, and that different firms will have different approaches to IFRS 9 application. It notes that paragraphs 17-18 of the main text address this. The other relevant segment (filename2 - Final Guidelines on management of non-performing and forborne exposures) states that credit institutions should comply with its guidelines in a manner appropriate to their size, internal organisation, nature, scope, and complexity of activities, specifically mentioning proportionality for operationalisation and governance arrangements of NPE strategies, especially for SREP Category 3 or 4 institutions. A third relevant segment (filename2 - EBA GL 2020 06 Final Report on GL on loan origination and monitoring) reiterates the implementation of its guidelines is subject to the proportionality principle, interpreted differently for various sections, based on the size, nature and complexity of institutions, and for creditworthiness assessment, collateral valuation and credit risk monitoring, by the type, size and complexity of credit facilities. All three segments explicitly state that their respective guidelines should be applied proportionally to the institution's characteristics (size, nature, scope, complexity of activities), covering credit risk management related areas, thus indicating overlaps.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_73.json",
      "excerpt1": "Therefore, these guidelines should be applied in a proportionate manner, considering also the principle of materiality. Both are mentioned in paragraphs 17- 18 of the main text of the guidelines, which do not rule out the application of the proportionality and materiality principle for credit institutions which are less complex or smaller.",
      "pageNumber1": 73,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_15.json",
      "excerpt2": "Credit institutions should comply with these guidelines in a manner that is appropriate to their size and internal organisation and the nature, scope and complexity of their activities; in particular, credit institutions may comply with sections 4 and 5 taking into account the proportionality criteria specified in section 4, Title I, of the EBA Guidelines on internal governance. Furthermore, if the credit institution is classified by the competent authorities for SREP purposes as SREP Category 3 or 4 (as assigned in accordance with the EBA Guidelines on common procedures and methodologies for the SREP11), then the guidelines should be applied in a proportionate manner. The principle of proportionality in the application of these guidelines will relate in particular to simplified obligations for the operationalisation and governance arrangements supporting the NPE strategies of credit institutions (section 5).",
      "pageNumber2": 15,
      "explanation": "Both excerpts state that the respective EBA guidelines should be applied by credit institutions in a proportionate manner, considering their size, internal organisation, and the nature, scope and complexity of their activities. They address the same regulatory subject of how credit institutions should apply EBA guidelines in a proportionate way.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_73.json",
      "excerpt1": "Therefore, these guidelines should be applied in a proportionate manner, considering also the principle of materiality. Both are mentioned in paragraphs 17- 18 of the main text of the guidelines, which do not rule out the application of the proportionality and materiality principle for credit institutions which are less complex or smaller.",
      "pageNumber1": 73,
      "filename2": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_10.json",
      "excerpt2": "The implementation of these guidelines is subject to the principle of proportionality, and the proportionality principle is interpreted and applied differently for various sections of the guidelines. First, for the implementation of the requirements related to internal governance, risk management and control, institutions and competent authorities should consider a proportionality principle that is based on, inter alia, the size, nature and complexity of the institutions and other criteria set out for the purposes of the principle of proportionality, defined in the EBA Guidelines on internal governance. Second, when implementing the requirements for the creditworthiness assessment, collateral valuation and credit risk monitoring, competent authorities and institutions, instead of the size and complexity of institutions, should consider the type, size and complexity of the credit facilities being originated or monitored, because these are the main drivers that could give rise to a disproportionate application of the guidelines.",
      "pageNumber2": 10,
      "explanation": "Both excerpts require the application of their respective guidelines in a proportionate manner, taking into account the characteristics of the institutions (size, nature, complexity) and/or the financial instruments/activities (type, size, complexity of credit facilities). This represents an overlap in the general principle of proportionality for credit risk related guidelines.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}