{
  "summary": "The two excerpts both address the information and methodology to be used by financial institutions when estimating Expected Credit Losses (ECLs). Both emphasize the importance of using a wide range of information, including forward-looking macroeconomic data, and applying expert judgment. They also highlight the need for consistency and regular review of methodologies.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_34.json",
      "excerpt1": "72. Macroeconomic forecasts and other relevant information should be applied consistently across portfolios where the credit risk drivers of the portfolios are affected by these forecasts/assumptions in the same way. Furthermore, when developing ECL estimates, credit institutions should apply their experienced credit judgement to consider their point in the credit cycle, which may differ across the jurisdictions in which they have lending exposures.",
      "pageNumber1": 34,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_633.json",
      "excerpt2": "B5.5.49 For the purpose of this Standard, reasonable and supportable information is that which is reasonably available at the reporting date without undue cost or effort, including information about past events, current conditions and forecasts of future economic conditions. Information that is available for financial reporting purposes is considered to be available without undue cost or effort. B5.5.51 An entity need not undertake an exhaustive search for information but shall consider all reasonable and supportable information that is available without undue cost or effort and that is relevant to the estimate of expected credit losses, including the effect of expected prepayments. The information used shall include factors that are specific to the borrower, general economic conditions and an assessment of both the current as well as the forecast direction of conditions at the reporting date. An entity may use various sources of data, that may be both internal (entity-specific) and external. Possible data sources include internal historical credit loss experience, internal ratings, credit loss experience of other entities and external ratings, reports and statistics. Entities that have no, or insufficient, sources of entity-specific data may use peer group experience for the comparable financial instrument (or groups of financial instruments).",
      "pageNumber2": 633,
      "explanation": "Both texts require the use of forward-looking information and macroeconomic forecasts when developing ECL estimates. The EBA GL emphasizes consistent application and experienced credit judgment, while IFRS 9 details what constitutes 'reasonable and supportable information,' including forecasts of future economic conditions and a wide range of data sources, encompassing both internal and external information. Both are in line with using forward-looking data and judgment for ECL estimation.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_34.json",
      "excerpt1": "74. Additionally, credit institutions should avail themselves of a wide range of information derived in the credit risk management process, including that of a forward-looking nature for risk management and capital adequacy purposes, in developing their estimate of ECL.",
      "pageNumber1": 34,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_633.json",
      "excerpt2": "B5.5.51 An entity need not undertake an exhaustive search for information but shall consider all reasonable and supportable information that is available without undue cost or effort and that is relevant to the estimate of expected credit losses, including the effect of expected prepayments. The information used shall include factors that are specific to the borrower, general economic conditions and an assessment of both the current as well as the forecast direction of conditions at the reporting date. An entity may use various sources of data, that may be both internal (entity-specific) and external. Possible data sources include internal historical credit loss experience, internal ratings, credit loss experience of other entities and external ratings, reports and statistics. Entities that have no, or insufficient, sources of entity-specific data may use peer group experience for the comparable financial instrument (or groups of financial instruments).",
      "pageNumber2": 633,
      "explanation": "Both excerpts state that institutions should use a wide range of relevant information for ECL estimation. The EBA GL refers to 'a wide range of information... including that of a forward-looking nature', while IFRS 9 specifies 'all reasonable and supportable information... including information about past events, current conditions and forecasts of future economic conditions' and mentions 'various sources of data, that may be both internal (entity-specific) and external'. This shows a clear overlap in the requirement for comprehensive data use.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_34.json",
      "excerpt1": "75. To the maximum extent possible, credit institutions should use common processes, systems, tools and data to assess credit risk, measure ECL for accounting purposes and determine expected losses for capital adequacy purposes in order to strengthen the reliability and consistency of the resulting ECL estimates, increase transparency and, through market discipline, provide incentives to follow sound credit risk practices.",
      "pageNumber1": 34,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_633.json",
      "excerpt2": "B5.5.52 Historical information is an important anchor or base from which to measure expected credit losses. However, an entity shall adjust historical data, such as credit loss experience, on the basis of current observable data to reflect the effects of the current conditions and its forecasts of future conditions that did not affect the period on which the historical data is based, and to remove the effects of the conditions in the historical period that are not relevant to the future contractual cash flows. In some cases, the best reasonable and supportable information could be the unadjusted historical information, depending on the nature of the historical information and when it was calculated, compared to circumstances at the reporting date and the characteristics of the financial instrument being considered. Estimates of changes in expected credit losses should reflect, and be directionally consistent with, changes in related observable data from period to period (such as changes in unemployment rates, property prices, commodity prices, payment status or other factors that are indicative of credit losses on the financial instrument or in the group of financial instruments and in the magnitude of those changes). An entity shall regularly review the methodology and assumptions used for estimating expected credit losses to reduce any differences between estimates and actual credit loss experience.",
      "pageNumber2": 633,
      "explanation": "Both texts emphasize the need for robust and consistent methodologies for ECL estimation. The EBA GL promotes 'common processes, systems, tools and data... to strengthen the reliability and consistency of the resulting ECL estimates'. IFRS 9 mandates that 'an entity shall regularly review the methodology and assumptions used for estimating expected credit losses to reduce any differences between estimates and actual credit loss experience' and that 'historical information is an important anchor or base' which should be 'adjusted... to reflect the effects of the current conditions and its forecasts of future conditions'. This implicitly requires a consistent and regularly reviewed methodology to ensure reliability and consistency.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}