{
  "summary": "The EBA Guidelines and the IFRS 9/IFRS 7 standards (as incorporated in EU law) both provide requirements for credit institutions regarding the assessment and disclosure of a 'significant increase in credit risk'. Both texts emphasize using the change in the risk of default over the expected life and provide lists of indicators to consider for this assessment, including changes in internal pricing, collateral requirements, and external market indicators. The EBA guidelines specifically reference the IFRS 9 and IFRS 7 requirements, ensuring alignment in the regulatory subject and the type of obligation. They reinforce the IFRS 9 principle that the assessment should be based on the risk of default, not the change in expected credit losses, and should not be restricted to situations where impairment is anticipated.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_41.json",
      "excerpt1": "105. Credit institutions should have a clear policy including well-developed criteria on what constitutes a 'significant' increase in credit risk for different types of lending exposures. Such criteria and the reasons why these approaches and definitions are considered appropriate should be disclosed in accordance with IFRS 7 Financial Instruments: Disclosures, paragraph 35F. IFRS 9, paragraph 5.5.9, requires that, when making the assessment of significant increases in credit risk, 'an entity shall use the change in the risk of default occurring over the expected life of the financial instrument instead of the change in the amount of expected credit losses'. For these purposes, institutions should make this assessment in terms of the risk of a default occurring and not expected credit loss (i.e. before consideration of the effects of credit risk mitigants such as collateral or guarantees).",
      "pageNumber1": 41,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_551.json",
      "excerpt2": "Determining significant increases in credit risk 5.5.9 At each reporting date, an entity shall assess whether the credit risk on a financial instrument has increased significantly since initial recognition. When making the assessment, an entity shall use the change in the risk of a default occurring over the expected life of the financial instrument instead of the change in the amount of expected credit losses. To make that assessment, an entity shall compare the risk of a default occurring on the financial instrument as at the reporting date with the risk of a default occurring on the financial instrument as at the date of initial recognition and consider reasonable and supportable information, that is available without undue cost or effort, that is indicative of significant increases in credit risk since initial recognition.",
      "pageNumber2": 551,
      "explanation": "Both excerpts address the assessment of a 'significant increase in credit risk' for financial instruments. The EBA Guidelines explicitly reference and reiterate the requirement from IFRS 9, paragraph 5.5.9, stating that the assessment should be based on the change in the risk of default over the expected life, rather than the change in expected credit losses. The EBA also states that the criteria for this assessment should be disclosed in accordance with IFRS 7, paragraph 35F.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_41.json",
      "excerpt1": "106. In developing their approach to determining a significant increase in credit risk, credit institutions should consider each of the 16 classes of indicators in IFRS 9 (insofar as they are relevant to the financial instrument being assessed) as set out in paragraphs B5.5.17(a)-(p) and, in addition, credit institutions should consider whether there is further information that should be taken into account. Such indicators (in both IFRS 9 and these guidelines) should not be viewed as a 'checklist'. Some may be more relevant than others to assessing whether a particular type of lending exposure exhibits a significant increase in credit risk. At the same time, credit institutions should take particular care to avoid the risk of a significant increase in credit risk not being acknowledged promptly when it is, in fact, present. In particular, credit institutions should not restrict significant increases in credit risk to situations when a financial instrument is anticipated to become credit impaired (i.e. the third stage of IFRS 9 impairment requirements). Rather, debtors may exhibit a significant increase in credit risk without evidence that the related lending exposures are likely to become impaired. The fact that credit risk has increased significantly does not necessarily mean that default is probable - merely that it is more likely than at initial recognition. This point is underlined by the symmetry of the IFRS 9 model: it is possible for lending exposures to move to lifetime ECL but subsequently be moved back to 12-month ECL if the threshold of a significant increase in credit risk is no longer met. 107. Credit institutions should consider in particular the following non-exhaustive list of indicators in assessing a significant increase in credit risk: a. a decision by the credit institution's senior management such that, if an existing lending exposure were newly originated at the reporting date, the element of the price of the lending exposure that reflects the credit risk of the exposure would be significantly higher than it was when the loan was actually originated, because of an increase in the credit risk of the specific borrower or class of borrowers since inception; b. a decision by the credit institution's senior management to strengthen collateral and/or covenant requirements for new lending exposures that are similar to lending exposures already originated, because of changes in the credit risk of those exposures since initial recognition;",
      "pageNumber1": 41,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_627.json",
      "excerpt2": "B5.5.17 The following non-exhaustive list of information may be relevant in assessing changes in credit risk: (a) significant changes in internal price indicators of credit risk as a result of a change in credit risk since inception, including, but not limited to, the credit spread that would result if a particular financial instrument or similar financial instrument with the same terms and the same counterparty were newly originated or issued at the reporting date. (b) other changes in the rates or terms of an existing financial instrument that would be significantly different if the instrument was newly originated or issued at the reporting date (such as more stringent covenants, increased amounts of collateral or guarantees, or higher income coverage) because of changes in the credit risk of the financial instrument since initial recognition. (c) significant changes in external market indicators of credit risk for a particular financial instrument or similar financial instruments with the same expected life. Changes in market indicators of credit risk include, but are not limited to: (i) the credit spread; (ii) the credit default swap prices for the borrower; (iii) the length of time or the extent to which the fair value of a financial asset has been less than its amortised cost; and (iv) other market information related to the borrower, such as changes in the price of a borrower's debt and equity instruments.",
      "pageNumber2": 627,
      "explanation": "Both excerpts provide guidance on indicators for assessing a 'significant increase in credit risk'. The EBA Guidelines explicitly refer to the 16 classes of indicators in IFRS 9, paragraphs B5.5.17(a)-(p). The quoted IFRS 9 excerpt (B5.5.17(a) and (b)) directly mirrors the EBA's specific examples in 107 (a) and (b) regarding internal price indicators and changes in terms like collateral/covenants. Both lists are non-exhaustive and aim to assist credit institutions in identifying such increases.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}