{
  "summary": "Both excerpts address the same regulatory subject: the assessment of a 'significant increase in credit risk' (SICR) on financial instruments for credit institutions, which triggers a change in the measurement of expected credit losses from 12-month to lifetime expected credit losses. The EBA Guidelines provide more detailed operational and governance expectations for credit institutions in applying the IFRS 9 requirements, while IFRS 9 (as incorporated in the CELEX document) lays down the core accounting standard for this assessment.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_39.json",
      "excerpt1": "97. The rationale for this approach is that the creditworthiness of the counterparty, and thus the ECL anticipated upon initial recognition, is taken into account in the pricing of credit at that time. It follows, then, that a post-origination increase in credit risk may not be fully compensated by the interest rate charged, and, as a consequence, credit institutions should carefully consider whether there has been a significant increase in credit risk30. If so, the lending exposure should be subject to lifetime ECL measurement. 98. In order to consider whether an exposure has suffered a significant increase in credit risk and the measurement of required 12-month ECL and lifetime ECL, credit institutions should have in place sound governance, systems and controls, in accordance with the principles specified in these guidelines. Unless already established, credit institutions should implement systems that are capable of handling and systematically assessing the large amounts of information that will be required to judge whether or not particular lending exposures or groups of lending exposures exhibit a significant increase in credit risk, and to measure lifetime ECL where that is the case.",
      "pageNumber1": 39,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_551.json",
      "excerpt2": "5.5.3 Subject to paragraphs 5.5.13-5.5.16, at each reporting date, an entity shall measure the loss allowance for a financial instrument at an amount equal to the lifetime expected credit losses if the credit risk on that financial instrument has increased significantly since initial recognition. 5.5.4 The objective of the impairment requirements is to recognise lifetime expected credit losses for all financial instruments for which there have been significant increases in credit risk since initial recognition - whether assessed on an individual or collective basis - considering all reasonable and supportable information, including that which is forward-looking. 5.5.5 Subject to paragraphs 5.5.13-5.5.16, if, at the reporting date, the credit risk on a financial instrument has not increased significantly since initial recognition, an entity shall measure the loss allowance for that financial instrument at an amount equal to 12-month expected credit losses.",
      "pageNumber2": 551,
      "explanation": "Both excerpts establish the fundamental requirement for credit institutions (referred to as 'credit institutions' in EBA GL and 'an entity' in IFRS 9, which applies to credit institutions) to assess whether there has been a 'significant increase in credit risk' on a financial instrument since initial recognition. This assessment directly dictates whether the loss allowance should be measured based on 12-month expected credit losses or lifetime expected credit losses. The EBA Guidelines operationalize this IFRS 9 principle by requiring institutions to have sound governance, systems, and controls in place for this determination, ensuring a timely shift to lifetime ECL measurement when a significant increase in credit risk occurs.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_39.json",
      "excerpt1": "99. Credit institutions' processes in place should enable them to determine on a timely and holistic basis whether there has been a significant increase in credit risk subsequent to the initial recognition of a lending exposure so that an individual exposure, or a group of exposures with similar credit risk characteristics, is transferred to lifetime ECL measurement as soon as credit risk has increased significantly, in accordance with the IFRS 9 impairment accounting requirements. 100. As noted in paragraph B5.5.17 of IFRS 9 on assessing significant increases in credit risk since initial recognition, the range of information that will need to be considered in making this determination is wide. In broad terms, it will include information on macroeconomic conditions, and the economic sector and geographical region relevant to a particular borrower or a group of borrowers with shared credit risk characteristics, in addition to borrower-specific strategic, operational and other characteristics.",
      "pageNumber1": 39,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_551.json",
      "excerpt2": "5.5.4 The objective of the impairment requirements is to recognise lifetime expected credit losses for all financial instruments for which there have been significant increases in credit risk since initial recognition - whether assessed on an individual or collective basis - considering all reasonable and supportable information, including that which is forward-looking. ... 5.5.9 At each reporting date, an entity shall assess whether the credit risk on a financial instrument has increased significantly since initial recognition. When making the assessment, an entity shall use the change in the risk of a default occurring over the expected life of the financial instrument instead of the change in the amount of expected credit losses. To make that assessment, an entity shall compare the risk of a default occurring on the financial instrument as at the reporting date with the risk of a default occurring on the financial instrument as at the date of initial recognition and consider reasonable and supportable information, that is available without undue cost or effort, that is indicative of significant increases in credit risk since initial recognition.",
      "pageNumber2": 551,
      "explanation": "Both documents specify that the assessment of a 'significant increase in credit risk' should be holistic and consider a wide range of information, including forward-looking elements. The EBA Guidelines explicitly reference IFRS 9 (paragraph B5.5.17) regarding the range of information, detailing macroeconomic, sectoral, geographical, and borrower-specific characteristics. IFRS 9 (paragraph 5.5.9) mandates the use of 'reasonable and supportable information, that is available without undue cost or effort, that is indicative of significant increases in credit risk since initial recognition,' emphasizing the individual or collective assessment based on the change in the risk of default, which aligns with the EBA's broader description of relevant information.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}