{
  "summary": "The EBA Guidelines emphasize the importance of the IFRS 9 Expected Credit Loss (ECL) model, highlighting its replacement of IAS 39, its requirement for earlier recognition of credit losses, and its distinctive feature of incorporating forward-looking information, including macroeconomic factors. The guidelines also stress the need for supervisory guidance due to the judgment required in applying IFRS 9 to ensure consistent application and comparability across institutions. Several related documents from the Basel Framework and IFRS 9 provide further detail on credit risk management, disclosure requirements for ECL, and the specific application of forward-looking information within the ECL framework, confirming and expanding on the principles outlined in the EBA guidelines.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_8.json",
      "excerpt1": "7. The ECL model should result in the earlier recognition of credit losses. In this respect, IFRS 9 is expected to address some prudential concerns and contribute to financial stability. In addition, consideration of forward-looking information, including macroeconomic factors, is a distinctive feature of an ECL model and is critical for the timely recognition of credit losses. The ECL model is also more aligned with existing regulatory practices (for credit institutions using an internal ratings-based ('IRB') approach) which require the calculation of expected credit losses rather than incurred credit losses in order to determine institutions' regulatory capital requirements.",
      "pageNumber1": 8,
      "filename2": "BaselFramework.di_page_1787.json",
      "excerpt2": "Principle 17:41 The supervisor determines that banks have an adequate credit risk management process that considers their risk appetite, risk profile, market conditions, macroeconomic factors and forward-looking information. This includes prudent policies and processes to identify, measure, evaluate, monitor, report and control or mitigate credit risk42 (including counterparty credit risk43) on a timely basis. The full credit life cycle is covered, including credit underwriting, credit evaluation and the ongoing management of the bank's loan and investment portfolios.",
      "pageNumber2": 1787,
      "explanation": "Both excerpts address credit risk management for credit institutions and explicitly state the importance of considering 'forward-looking information' and 'macroeconomic factors'. The EBA document highlights this as a distinctive feature of the ECL model, while the Basel Framework establishes it as a principle for an adequate credit risk management process. The reference to 'expected credit losses' in the EBA document directly relates to the 'credit risk management process' in the Basel Framework.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_8.json",
      "excerpt1": "9. In December 2015, the BCBS issued supervisory guidance on credit risk and accounting for expected credit losses10, which sets out supervisory expectations for credit institutions related to sound credit risk practices associated with implementing and applying an ECL accounting model. In addition, it contains an Annex specific to jurisdictions applying IFRS. 10.As indicated in the BCBS guidance, sound credit risk practices provide the basis for a high-quality, robust and consistent implementation of an ECL accounting model in accordance with the applicable accounting framework, and they support appropriate measures of capital adequacy.",
      "pageNumber1": 8,
      "filename2": "BaselFramework.di_page_1787.json",
      "excerpt2": "Footnotes 41 Reference documents: BCBS, High-level considerations on proportionality, July 2022; BCBS, Guidance on credit risk and accounting for expected credit losses, December 2015; FSB, Principles for sound residential mortgage underwriting practices, April 2012; CRE20, CRE40, CRE45, CRE50, CRE51, CRE54, MGN10, MGN20.",
      "pageNumber2": 1787,
      "explanation": "The EBA guidelines explicitly mention and refer to the 'BCBS, Guidance on credit risk and accounting for expected credit losses, December 2015'. The Basel Framework document directly lists this same BCBS guidance as a reference document for its Principle 17 on credit risk management. This indicates a direct alignment in the foundational supervisory guidance for credit risk and ECL accounting.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_8.json",
      "excerpt1": "7. The ECL model should result in the earlier recognition of credit losses. In this respect, IFRS 9 is expected to address some prudential concerns and contribute to financial stability. In addition, consideration of forward-looking information, including macroeconomic factors, is a distinctive feature of an ECL model and is critical for the timely recognition of credit losses. The ECL model is also more aligned with existing regulatory practices (for credit institutions using an internal ratings-based ('IRB') approach) which require the calculation of expected credit losses rather than incurred credit losses in order to determine institutions' regulatory capital requirements.",
      "pageNumber1": 8,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_500.json",
      "excerpt2": "35G An entity shall explain the inputs, assumptions and estimation techniques used to apply the requirements in Section 5.5 of IFRS 9. For this purpose an entity shall disclose: (a) the basis of inputs and assumptions and the estimation techniques used to: (i) measure the 12-month and lifetime expected credit losses; (ii) determine whether the credit risk of financial instruments has increased significantly since initial recognition; and (iii) determine whether a financial asset is a credit-impaired financial asset. (b) how forward-looking information has been incorporated into the determination of expected credit losses, including the use of macroeconomic information; and (c) changes in the estimation techniques or significant assumptions made during the reporting period and the reasons for those changes.",
      "pageNumber2": 500,
      "explanation": "The EBA Guidelines state that 'consideration of forward-looking information, including macroeconomic factors, is a distinctive feature of an ECL model'. This is directly mirrored by IFRS 9's disclosure requirements, which mandate entities to explain 'how forward-looking information has been incorporated into the determination of expected credit losses, including the use of macroeconomic information'. Both texts address the crucial role of forward-looking and macroeconomic information in ECL assessment.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_8.json",
      "excerpt1": "5. In addition, a significant number of credit institutions apply the IFRS Standards as these are incorporated into the EU legal framework through EU Regulations, in accordance with the procedures set out in Regulation (EC) No 1606/2002. IFRS 9, which will replace IAS 39 for the accounting periods beginning on or after 1 January 20188, requires the measurement of impairment loss provisions to be based on an ECL accounting model rather than on an incurred loss accounting model.",
      "pageNumber1": 8,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_551.json",
      "excerpt2": "5.5.3 Subject to paragraphs 5.5.13-5.5.16, at each reporting date, an entity shall measure the loss allowance for a financial instrument at an amount equal to the lifetime expected credit losses if the credit risk on that financial instrument has increased significantly since initial recognition. 5.5.4 The objective of the impairment requirements is to recognise lifetime expected credit losses for all financial instruments for which there have been significant increases in credit risk since initial recognition - whether assessed on an individual or collective basis - considering all reasonable and supportable information, including that which is forward-looking. 5.5.5 Subject to paragraphs 5.5.13-5.5.16, if, at the reporting date, the credit risk on a financial instrument has not increased significantly since initial recognition, an entity shall measure the loss allowance for that financial instrument at an amount equal to 12-month expected credit losses.",
      "pageNumber2": 551,
      "explanation": "The EBA Guidelines introduce IFRS 9 as requiring the measurement of impairment loss provisions based on an ECL accounting model. The IFRS 9 excerpt then specifies the core requirement of this model, detailing when to measure 'lifetime expected credit losses' (significant increase in credit risk) versus '12-month expected credit losses' (no significant increase). Both directly address the fundamental principle and application of the ECL accounting model.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_8.json",
      "excerpt1": "7. The ECL model should result in the earlier recognition of credit losses. In this respect, IFRS 9 is expected to address some prudential concerns and contribute to financial stability. In addition, consideration of forward-looking information, including macroeconomic factors, is a distinctive feature of an ECL model and is critical for the timely recognition of credit losses. The ECL model is also more aligned with existing regulatory practices (for credit institutions using an internal ratings-based ('IRB') approach) which require the calculation of expected credit losses rather than incurred credit losses in order to determine institutions' regulatory capital requirements.",
      "pageNumber1": 8,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_624.json",
      "excerpt2": "B5.5.2 Lifetime expected credit losses are generally expected to be recognised before a financial instrument becomes past due. Typically, credit risk increases significantly before a financial instrument becomes past due or other lagging borrower-specific factors (for example, a modification or restructuring) are observed. Consequently when reasonable and supportable information that is more forward-looking than past due information is available without undue cost or effort, it must be used to assess changes in credit risk. B5.5.4 In some circumstances an entity does not have reasonable and supportable information that is available without undue cost or effort to measure lifetime expected credit losses on an individual instrument basis. In that case, lifetime expected credit losses shall be recognised on a collective basis that considers compre- hensive credit risk information. This comprehensive credit risk information must incorporate not only past due information but also all relevant credit information, including forward-looking macroeconomic information, in order to approximate the result of recognising lifetime expected credit losses when there has been a significant increase in credit risk since initial recognition on an individual instrument level.",
      "pageNumber2": 624,
      "explanation": "The EBA guidelines state that 'consideration of forward-looking information, including macroeconomic factors, is a distinctive feature of an ECL model and is critical for the timely recognition of credit losses.' The IFRS 9 excerpt reinforces this by stating that 'when reasonable and supportable information that is more forward-looking than past due information is available... it must be used to assess changes in credit risk' and that comprehensive credit risk information 'must incorporate... forward-looking macroeconomic information'. Both texts emphasize the necessity and importance of forward-looking and macroeconomic data for ECL measurement and timely recognition of credit losses.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_8.json",
      "excerpt1": "5. In addition, a significant number of credit institutions apply the IFRS Standards as these are incorporated into the EU legal framework through EU Regulations, in accordance with the procedures set out in Regulation (EC) No 1606/2002. IFRS 9, which will replace IAS 39 for the accounting periods beginning on or after 1 January 20188, requires the measurement of impairment loss provisions to be based on an ECL accounting model rather than on an incurred loss accounting model. 8. However, the application of IFRS 9 also requires the use of judgement in the ECL assessment and measurement process, which could potentially affect the consistent application of IFRS 9 across institutions and the comparability of credit institutions' financial statements. Therefore, the existence of supervisory guidance emphasises the importance of high-quality and consistent application of IFRS 9 and could help to promote consistent interpretations and practices.",
      "pageNumber1": 8,
      "filename2": "BaselFramework.di_page_127.json",
      "excerpt2": "90.7 The Committee has determined that it may be appropriate for a jurisdiction to introduce a transitional arrangement for the impact on regulatory capital from the application of expected credit loss (ECL) accounting. Jurisdictions applying a transitional arrangement must implement such an arrangement as follows. 90.8 The transitional arrangement must apply only to provisions that are \"new\" under an ECL accounting model. \"New\" provisions are provisions which do not exist under accounting approaches applied prior to the adoption of an ECL accounting model. 90.9 The transitional arrangement must adjust Common Equity Tier 1 capital. Where there is a reduction in Common Equity Tier 1 capital due to new provisions, net of tax effect, upon adoption of an ECL accounting model, the decline in Common Equity Tier 1 capital (the \"transitional adjustment amount\") must be partially included (ie added back) to Common Equity Tier 1 capital over a number of years (the \"transition period\") commencing on the effective date of the transition to ECL accounting.",
      "pageNumber2": 127,
      "explanation": "Both documents recognize the impact of the transition to an ECL accounting model (IFRS 9) for credit institutions. The EBA highlights IFRS 9 replacing IAS 39 and the potential for inconsistent application, implying a need for careful implementation. The Basel Framework directly addresses the 'impact on regulatory capital from the application of expected credit loss (ECL) accounting' and specifies 'transitional arrangements' to manage this impact, thus acknowledging the significant change and the need for a structured approach to its adoption, which implicitly addresses the consistent application mentioned by the EBA.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}