{
  "summary": "The EBA Guidelines emphasize that when assessing a significant increase in credit risk, while IFRS 9 is a relative model, relevant facts and circumstances, including the absolute change in PD, should be considered. It clarifies that intensified monitoring is an indicator but not an automatic trigger. IFRS 9 itself (paragraph 5.5.9) requires assessing significant increases in credit risk by comparing the risk of default occurring since initial recognition, using reasonable and supportable information, but it explicitly states using the 'change in the risk of a default occurring over the expected life of the financial instrument instead of the change in the amount of expected credit losses.' The EBA's clarification regarding the 'absolute change in PD' as a factor to consider, while acknowledging IFRS 9 as a relative model, aligns with IFRS 9's broader requirement to use 'reasonable and supportable information' without specifically prescribing the 'absolute change in PD' as the primary metric for the 'change in risk of default'. The texts overlap in discussing the criteria for assessing significant increases in credit risk under IFRS 9, with the EBA providing specific guidance on interpreting IFRS 9's principles.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_84.json",
      "excerpt1": "Regarding the use of the absolute change in the PD when assessing significant increase of credit risk, the EBA acknowledges that IFRS 9 is a relative model (increase in the risk of default occurring since initial recognition). However, when assessing whether or not a significant increase in credit risk has occurred, relevant facts and circumstances should be taken into account, including the absolute change in PD. The EBA believes that the guidelines are sufficiently clear in this regard and consistent with BCBS guidance and would not prevent a credit institution from meeting the impairment requirements of IFRS 9.",
      "pageNumber1": 84,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_551.json",
      "excerpt2": "5.5.9 At each reporting date, an entity shall assess whether the credit risk on a financial instrument has increased significantly since initial recognition. When making the assessment, an entity shall use the change in the risk of a default occurring over the expected life of the financial instrument instead of the change in the amount of expected credit losses. To make that assessment, an entity shall compare the risk of a default occurring on the financial instrument as at the reporting date with the risk of a default occurring on the financial instrument as at the date of initial recognition and consider reasonable and supportable information, that is available without undue cost or effort, that is indicative of significant increases in credit risk since initial recognition.",
      "pageNumber2": 551,
      "explanation": "Both excerpts address the assessment of a 'significant increase in credit risk' for financial instruments under the IFRS 9 impairment requirements. The EBA Guidelines specify that 'relevant facts and circumstances should be taken into account, including the absolute change in PD,' even though IFRS 9 is a relative model (increase in risk of default since initial recognition). IFRS 9 paragraph 5.5.9 mandates using the 'change in the risk of a default occurring over the expected life of the financial instrument' and 'reasonable and supportable information' for this assessment. The EBA's guidance on considering the 'absolute change in PD' provides a specific interpretation or factor within the broader IFRS 9 principle of assessing the 'change in the risk of a default occurring since initial recognition' using available information.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_84.json",
      "excerpt1": "Paragraph 113 refers to the case of intensifying the monitoring of exposures as an example of an indicator of significant increase of credit risk and therefore it should not be considered automatically as a trigger for significant increase of credit risk.",
      "pageNumber1": 84,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_628.json",
      "excerpt2": "(o) changes in the entity's credit management approach in relation to the financial instrument; ie based on emerging indicators of changes in the credit risk of the financial instrument, the entity's credit risk management practice is expected to become more active or to be focused on managing the instrument, including the instrument becoming more closely monitored or controlled, or the entity specifically intervening with the borrower.",
      "pageNumber2": 628,
      "explanation": "Both excerpts address the role of intensified monitoring as an indicator of a significant increase in credit risk. The EBA Guidelines clarify that 'intensifying the monitoring of exposures' is 'an example of an indicator' but 'should not be considered automatically as a trigger.' IFRS 9 (B5.5.17(o)) lists 'changes in the entity's credit management approach' such as 'the instrument becoming more closely monitored or controlled' as a relevant piece of information for assessing changes in credit risk. Both acknowledge this operational change as an indicator related to credit risk assessment.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}