{
  "summary": "Both excerpts address the conditions under which the 30-days-past-due rebuttable presumption can be used or rebutted by credit institutions when assessing a significant increase in credit risk for the purpose of IFRS 9 expected credit loss (ECL) recognition. Both emphasize the importance of forward-looking information and the conditions for relying on or rebutting the past-due presumption, demonstrating an overlap in their regulatory guidance on this specific aspect of credit risk management and accounting.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_48.json",
      "excerpt1": "Although the use of the more-than-30-days-past-due rebuttable presumption as a backstop measure is not precluded in accordance with IFRS 9 alongside other, earlier indicators for assessing significant increase in credit risk, credit institutions should avoid using it as a primary indicator of transfer to lifetime ECL. 136. Any assertion that the more-than-30-days-past-due presumption is rebutted on the basis that there has not been a significant increase in credit risk should be accompanied by a thorough analysis clearly demonstrating that 30 days past due is not correlated with a significant increase in credit risk32. Such analysis should consider both current and reasonable and supportable forward-looking information that may cause future cash shortfalls to differ from historical experience. 137. In this regard, credit institutions should use relevant forward-looking information that is reasonable and supportable to analyse whether there is any substantive relationship between such information and credit risk drivers. Credit institutions should not use the 30-days-past- due rebuttable presumption unless they have demonstrated that the forward-looking information had no substantive relationship with the credit risk driver or such information is not available without undue cost or effort.",
      "pageNumber1": 48,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_552.json",
      "excerpt2": "Regardless of the way in which an entity assesses significant increases in credit risk, there is a rebuttable presumption that the credit risk on a financial asset has increased significantly since initial recognition when contractual payments are more than 30 days past due. An entity can rebut this presumption if the entity has reasonable and supportable information that is available without undue cost or effort, that demonstrates that the credit risk has not increased significantly since initial recognition even though the contractual payments are more than 30 days past due. When an entity determines that there have been significant increases in credit risk before contractual payments are more than 30 days past due, the rebuttable presumption does not apply.",
      "pageNumber2": 552,
      "explanation": "Both texts establish a rebuttable presumption that a significant increase in credit risk has occurred when contractual payments are more than 30 days past due. Both also provide conditions for rebutting this presumption, requiring reasonable and supportable information (including forward-looking information) that demonstrates no significant increase in credit risk, and both refer to the availability of such information without undue cost or effort. The EBA Guidelines specify that credit institutions should avoid using it as a primary indicator, while IFRS 9 articulates when an entity cannot solely rely on past due information if forward-looking information is available.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}