{
  "summary": "The EBA Guidelines (EBA-GL-2017-06) outline principles for competent authorities to evaluate credit institutions' credit risk management practices, including how institutions assess and reflect credit risk and Expected Credit Loss (ECL) allowances in relation to their risk appetite. Similarly, the Basel Framework (SRP32.14) and the EBA SREP Guidelines (para 220) provide that competent authorities should assess institutions' credit risk management frameworks, including the adequacy of policies and procedures related to credit granting, pricing, measurement, monitoring, and controls, ensuring consistency with risk appetite and incorporating forward-looking information and macroeconomic factors. The EBA Guidelines on Loan Origination and Monitoring (EBA-GL-2020-06, para 34) and the Finnish FSA Regulations (2018_04.m3_en, para 34) also specify that institutions must define credit risk policies and procedures for identifying, assessing, approving, monitoring, reporting, and mitigating credit risk, including criteria for measuring allowances for accounting and capital adequacy purposes, which should be documented and regularly updated.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_49.json",
      "excerpt1": "139. Competent authorities should be satisfied that credit institutions have adopted and adhered to the sound credit risk practices described in these guidelines. Competent authorities' evaluation should include, but not be limited to, whether: a. the credit institution's internal credit risk review function is robust and encompasses all lending exposures; b. the quality of a credit institution's processes and systems for identifying, classifying, monitoring and addressing changes in credit risk for all lending exposures in a timely manner is adequate, and management's experienced credit judgement considers current conditions and forward-looking information, including macroeconomic factors, and is well documented; c. the credit institution's processes reflect the risk appetite of the credit institution in a manner that ensures lending exposures on which credit risk has increased since origination or purchase to a level in excess of the credit institution's risk appetite are promptly identified and properly monitored, and ECL allowance estimates appropriately reflect the increases in the credit risk of these exposures as increases are identified.",
      "pageNumber1": 49,
      "filename2": "BaselFramework.di_page_1787.json",
      "excerpt2": "Principle 17: The supervisor determines that banks have an adequate credit risk management process that considers their risk appetite, risk profile, market conditions, macroeconomic factors and forward-looking information. This includes prudent policies and processes to identify, measure, evaluate, monitor, report and control or mitigate credit risk (including counterparty credit risk) on a timely basis. The full credit life cycle is covered, including credit underwriting, credit evaluation and the ongoing management of the bank's loan and investment portfolios.",
      "pageNumber2": 1787,
      "explanation": "Both excerpts address the supervisory assessment of credit institutions' credit risk management processes. The EBA guidelines state that competent authorities should evaluate if a credit institution's processes for identifying, classifying, monitoring, and addressing credit risk changes are adequate and reflect the risk appetite, considering forward-looking information and macroeconomic factors. Similarly, the Basel Framework states that the supervisor determines if banks have an adequate credit risk management process that considers risk appetite, market conditions, macroeconomic factors, and forward-looking information, including policies and processes to identify, measure, evaluate, monitor, report, and control credit risk.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_49.json",
      "excerpt1": "139. Competent authorities should be satisfied that credit institutions have adopted and adhered to the sound credit risk practices described in these guidelines. Competent authorities' evaluation should include, but not be limited to, whether: a. the credit institution's internal credit risk review function is robust and encompasses all lending exposures; b. the quality of a credit institution's processes and systems for identifying, classifying, monitoring and addressing changes in credit risk for all lending exposures in a timely manner is adequate, and management's experienced credit judgement considers current conditions and forward-looking information, including macroeconomic factors, and is well documented; c. the credit institution's processes reflect the risk appetite of the credit institution in a manner that ensures lending exposures on which credit risk has increased since origination or purchase to a level in excess of the credit institution's risk appetite are promptly identified and properly monitored, and ECL allowance estimates appropriately reflect the increases in the credit risk of these exposures as increases are identified.",
      "pageNumber1": 49,
      "filename2": "Final Report on Guidelines on common procedures and methodologies for SREP and supervisory stress testing.di_page_88.json",
      "excerpt2": "6.2.3 Assessment of credit risk management and controls 220. To achieve a comprehensive understanding of the institution's credit risk profile, competent authorities should also review the governance and risk management framework underlying its credit activities throughout the life cycle of a loan. To this end, competent authorities should assess the following elements, also having regard to the EBA Guidelines on loan origination and monitoring and the EBA Guidelines on management of non-performing and forborne exposures:",
      "pageNumber2": 88,
      "explanation": "Both excerpts deal with the supervisory assessment of credit institutions' credit risk management. The EBA guidelines (EBA-GL-2017-06) specify that competent authorities should evaluate the effectiveness of a credit institution's credit risk practices, including its processes for identifying, classifying, monitoring, and addressing credit risk. The EBA SREP Guidelines (EBA/GL/2014/13) state that competent authorities should review the governance and risk management framework underlying credit activities throughout the loan life cycle to understand the institution's credit risk profile, aligning on the subject of supervisory assessment of credit risk management frameworks.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_49.json",
      "excerpt1": "139. Competent authorities should be satisfied that credit institutions have adopted and adhered to the sound credit risk practices described in these guidelines. Competent authorities' evaluation should include, but not be limited to, whether: b. the quality of a credit institution's processes and systems for identifying, classifying, monitoring and addressing changes in credit risk for all lending exposures in a timely manner is adequate, and management's experienced credit judgement considers current conditions and forward-looking information, including macroeconomic factors, and is well documented; c. the credit institution's processes reflect the risk appetite of the credit institution in a manner that ensures lending exposures on which credit risk has increased since origination or purchase to a level in excess of the credit institution's risk appetite are promptly identified and properly monitored, and ECL allowance estimates appropriately reflect the increases in the credit risk of these exposures as increases are identified. Where a credit institution originates or purchases a lending exposure on which credit risk at acquisition exceeds the institution's risk appetite and which therefore represents an exception to the institution's lending policies and standards, competent authorities should evaluate whether the institution has established and adheres to appropriate processes and controls for: the initial identification, review, approval and documentation of such exposures; the reporting of such policy exceptions to senior management and, for individually significant exposures, to the management body; and the proper monitoring of such exposures after initial recognition. Competent authorities should also evaluate whether the credit institution's processes and controls separately identify ECL allowance estimates related to exposures consistent with the credit institution's risk appetite and those related to riskier lending exposures; d. appropriate information about the credit risk of lending exposures, changes in credit risk, the related ECL allowance and changes in allowance estimates is provided to the credit institution's management body and senior management on a regular (for example, quarterly or, if warranted, more frequent) basis;",
      "pageNumber1": 49,
      "filename2": "Final Report on Guidelines on common procedures and methodologies for SREP and supervisory stress testing.di_page_91.json",
      "excerpt2": "91. Competent authorities should assess whether the institution's management body approves the policies for managing, measuring and controlling credit risk and discusses and reviews them regularly, in line with risk strategies; b. senior management is responsible for drawing up and implementing the policies and procedures for managing, measuring and controlling credit risk, as defined by the management body; c. the policies and procedures are sound and consistent with the credit risk strategy, and cover all the main businesses and processes relevant to managing, measuring and controlling credit risk, in particular: · credit granting and pricing: for example, borrowers, guarantors and collateral eligibility; credit limits; selection of FMIs, CCPs and correspondent banks; types of credit facilities available; terms and conditions (including collateral and netting agreements requirement) to be applied; · credit risk measurement and monitoring: for example, criteria for identifying groups of connected counterparties; criteria for assessing borrowers' creditworthiness and collateral evaluation and frequency for their review; criteria for quantifying impairments, credit valuation adjustments and provisions; and · credit management: for example, criteria for reviewing products, terms and conditions; criteria for applying forbearance practices or restructuring; criteria for loan classification and management of NPLs;",
      "pageNumber2": 91,
      "explanation": "Both excerpts outline supervisory expectations regarding credit institutions' credit risk management. The EBA guidelines (EBA-GL-2017-06) detail the competent authorities' evaluation of whether credit institutions' processes reflect their risk appetite, promptly identify and monitor increased credit risk, and provide appropriate information to management. The EBA SREP Guidelines (EBA/GL/2014/13) specify that competent authorities should assess if the management body approves and reviews credit risk policies, and if policies and procedures cover credit granting, pricing, measurement, and monitoring, consistent with the credit risk strategy. Both focus on the supervisory evaluation of credit risk practices and governance.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_49.json",
      "excerpt1": "139. Competent authorities should be satisfied that credit institutions have adopted and adhered to the sound credit risk practices described in these guidelines. Competent authorities' evaluation should include, but not be limited to, whether: b. the quality of a credit institution's processes and systems for identifying, classifying, monitoring and addressing changes in credit risk for all lending exposures in a timely manner is adequate, and management's experienced credit judgement considers current conditions and forward-looking information, including macroeconomic factors, and is well documented; c. the credit institution's processes reflect the risk appetite of the credit institution in a manner that ensures lending exposures on which credit risk has increased since origination or purchase to a level in excess of the credit institution's risk appetite are promptly identified and properly monitored, and ECL allowance estimates appropriately reflect the increases in the credit risk of these exposures as increases are identified.",
      "pageNumber1": 49,
      "filename2": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_21.json",
      "excerpt2": "34. Institutions should set out, in their credit risk policies and procedures, the criteria for identifying, assessing, approving, monitoring, reporting and mitigating credit risk, and the criteria for measuring allowances for both accounting and capital adequacy purposes. Institutions should document the framework and update it regularly.",
      "pageNumber2": 21,
      "explanation": "Both excerpts address the definition and implementation of credit risk policies and procedures for institutions. The EBA Guidelines on Expected Credit Losses specify that competent authorities should evaluate whether a credit institution's processes are adequate for identifying, classifying, monitoring, and addressing changes in credit risk, and if ECL allowance estimates reflect increases in credit risk. The EBA Guidelines on Loan Origination and Monitoring state that institutions should set out criteria in their credit risk policies and procedures for identifying, assessing, approving, monitoring, reporting, and mitigating credit risk, including for measuring allowances for accounting and capital adequacy purposes. Both refer to the processes for managing credit risk and related allowances.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_49.json",
      "excerpt1": "139. Competent authorities should be satisfied that credit institutions have adopted and adhered to the sound credit risk practices described in these guidelines. Competent authorities' evaluation should include, but not be limited to, whether: b. the quality of a credit institution's processes and systems for identifying, classifying, monitoring and addressing changes in credit risk for all lending exposures in a timely manner is adequate, and management's experienced credit judgement considers current conditions and forward-looking information, including macroeconomic factors, and is well documented; c. the credit institution's processes reflect the risk appetite of the credit institution in a manner that ensures lending exposures on which credit risk has increased since origination or purchase to a level in excess of the credit institution's risk appetite are promptly identified and properly monitored, and ECL allowance estimates appropriately reflect the increases in the credit risk of these exposures as increases are identified.",
      "pageNumber1": 49,
      "filename2": "2018_04.m3_en.di_page_20.json",
      "excerpt2": "(73) Supervised entities must have a credit risk rating process in accordance with chapter 4.3.2, paragraphs (42-48) of the EBA Guidelines on credit institutions' credit risk management practices and accounting for expected credit losses.",
      "pageNumber2": 20,
      "explanation": "Both excerpts address credit risk management practices, specifically referencing EBA Guidelines on credit institutions' credit risk management practices and accounting for expected credit losses. The EBA guidelines describe what competent authorities should evaluate regarding a credit institution's processes for identifying, monitoring, and reflecting credit risk and ECL estimates. The Finnish FSA regulations explicitly state that supervised entities must have a credit risk rating process in accordance with the EBA Guidelines on credit institutions' credit risk management practices and accounting for expected credit losses. This is a direct normative reference, creating an overlap in the subject of credit risk management processes.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_49.json",
      "excerpt1": "139. Competent authorities should be satisfied that credit institutions have adopted and adhered to the sound credit risk practices described in these guidelines. Competent authorities' evaluation should include, but not be limited to, whether: c. the credit institution's processes reflect the risk appetite of the credit institution in a manner that ensures lending exposures on which credit risk has increased since origination or purchase to a level in excess of the credit institution's risk appetite are promptly identified and properly monitored, and ECL allowance estimates appropriately reflect the increases in the credit risk of these exposures as increases are identified.",
      "pageNumber1": 49,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_48.json",
      "excerpt2": "167. Credit institutions should estimate loss allowances for NPEs and FBEs subject to impairment in accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses.",
      "pageNumber2": 48,
      "explanation": "Both excerpts relate to the estimation of loss allowances based on the EBA Guidelines on credit risk management practices and accounting for expected credit losses. The EBA guidelines (EBA-GL-2017-06) specify that competent authorities should evaluate whether a credit institution's processes ensure ECL allowance estimates appropriately reflect increases in credit risk. The EBA Guidelines on Non-Performing and Forborne Exposures (EBA/GL/2018/06) explicitly require credit institutions to estimate loss allowances for NPEs and FBEs in accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses. This is a direct reference and therefore a clear overlap.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_49.json",
      "excerpt1": "139. Competent authorities should be satisfied that credit institutions have adopted and adhered to the sound credit risk practices described in these guidelines. Competent authorities' evaluation should include, but not be limited to, whether: c. the credit institution's processes reflect the risk appetite of the credit institution in a manner that ensures lending exposures on which credit risk has increased since origination or purchase to a level in excess of the credit institution's risk appetite are promptly identified and properly monitored, and ECL allowance estimates appropriately reflect the increases in the credit risk of these exposures as increases are identified.",
      "pageNumber1": 49,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_49.json",
      "excerpt2": "174. Credit institutions should adopt, document and adhere to sound policies, procedures and controls for assessing and measuring loss allowances and write-off on NPEs in accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses.",
      "pageNumber2": 49,
      "explanation": "Both excerpts pertain to the assessment and measurement of loss allowances for credit risk, referencing the EBA Guidelines on credit risk management practices and accounting for expected credit losses. The EBA guidelines (EBA-GL-2017-06) outline the supervisory evaluation of whether ECL allowance estimates appropriately reflect increased credit risk. The EBA Guidelines on Non-Performing and Forborne Exposures (EBA/GL/2018/06) state that credit institutions should adopt sound policies for assessing and measuring loss allowances and write-offs on NPEs in accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses. This direct reference establishes an overlap.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}