{
  "summary": "The EBA Guidelines on credit risk management practices and accounting for expected credit losses (filename1) introduces the importance of high-quality and consistent application of IFRS 9 for Expected Credit Losses (ECL) by credit institutions, noting the significant use of judgment required. The Basel Framework (filename2) directly refers to the same subject by requiring disclosures on how banks determine their accounting provisions for credit losses when adopting an ECL accounting model. Both documents address the application of ECL accounting models and the related disclosures or practices for credit institutions.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_53.json",
      "excerpt1": "High-quality and consistent application of accounting standards are the basis for the effective and consistent application of regulatory capital requirements. Accounting frameworks are commonly principles-based and credit institutions should use judgement when applying the accounting standards, with the objective of providing useful financial information to the users. In this regard, the use of judgement plays a fundamental role in some areas of accounting. For this reason, it is important for competent authorities to promote a high-quality and consistent application of the accounting standards which would also help in the comparability of financial statements across institutions. In addition, it would be a concern for competent authorities if, as a result of a low-quality implementation of the accounting standards, credit institutions have inadequate levels of ECL allowances relative to the credit risk of the loan portfolios, for instance if credit institutions minimise the effort to consider forward-looking information, which is a central feature of an expected credit loss ('ECL') model. ... The application of IFRS 9 also requires the use of judgement in the ECL assessment and measurement process, which could potentially affect the consistent application of IFRS 9 across institutions and the comparability of credit institutions' financial statements. Therefore, the existence of supervisory guidance emphasises the importance of high-quality, robust and consistent application of IFRS 9 and could help promote consistent interpretations and practices.",
      "pageNumber1": 53,
      "filename2": "BaselFramework.di_page_1516.json",
      "excerpt2": "Banks must provide the following disclosures: ... (c) Description of methods used for determining accounting provisions for credit losses. In addition, banks that have adopted an ECL accounting model must provide information on the rationale for categorisation of ECL accounting provisions in general and specific categories for standardised approach exposures.",
      "pageNumber2": 1516,
      "explanation": "Both excerpts address the application of Expected Credit Loss (ECL) accounting models by credit institutions. Filename1 highlights the importance of high-quality, robust, and consistent application of IFRS 9, especially concerning the use of judgment in ECL assessment and measurement. Filename2, under the section for disclosures, requires banks that have adopted an ECL accounting model to provide a description of the methods used for determining accounting provisions for credit losses and the rationale for their categorisation. This demonstrates an overlap in regulating the practices and transparency surrounding the application and methodology of ECL accounting for credit institutions.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_53.json",
      "excerpt1": "High-quality and consistent application of accounting standards are the basis for the effective and consistent application of regulatory capital requirements. Accounting frameworks are commonly principles-based and credit institutions should use judgement when applying the accounting standards, with the objective of providing useful financial information to the users. In this regard, the use of judgement plays a fundamental role in some areas of accounting. For this reason, it is important for competent authorities to promote a high-quality and consistent application of the accounting standards which would also help in the comparability of financial statements across institutions. In addition, it would be a concern for competent authorities if, as a result of a low-quality implementation of the accounting standards, credit institutions have inadequate levels of ECL allowances relative to the credit risk of the loan portfolios, for instance if credit institutions minimise the effort to consider forward-looking information, which is a central feature of an expected credit loss ('ECL') model. ... The application of IFRS 9 also requires the use of judgement in the ECL assessment and measurement process, which could potentially affect the consistent application of IFRS 9 across institutions and the comparability of credit institutions' financial statements. Therefore, the existence of supervisory guidance emphasises the importance of high-quality, robust and consistent application of IFRS 9 and could help promote consistent interpretations and practices.",
      "pageNumber1": 53,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_499.json",
      "excerpt2": "An entity shall explain its credit risk management practices and how they relate to the recognition and measurement of expected credit losses. To meet this objective an entity shall disclose information that enables users of financial statements to understand and evaluate: (a) how an entity determined whether the credit risk of financial instruments has increased significantly since initial recognition, including, if and how: (i) financial instruments are considered to have low credit risk in accordance with paragraph 5.5.10 of IFRS 9, including the classes of financial instruments to which it applies; and (ii) the presumption in paragraph 5.5.11 of IFRS 9, that there have been significant increases in credit risk since initial recognition when financial assets are more than 30 days past due, has been rebutted; (b) an entity's definitions of default, including the reasons for selecting those definitions; (c) how the instruments were grouped if expected credit losses were measured on a collective basis; (d) how an entity determined that financial assets are credit-impaired financial assets; (e) an entity's write-off policy, including the indicators that there is no reasonable expectation of recovery and information about the policy for financial assets that are written-off but are still subject to enforcement activity; and",
      "pageNumber2": 499,
      "explanation": "Both excerpts address the practices related to Expected Credit Loss (ECL) models, specifically concerning the application of IFRS 9. Filename1 discusses the importance of consistent application of IFRS 9 in ECL assessment and measurement, noting the role of judgment and the need for supervisory guidance. Filename2, an IFRS standard, explicitly requires an entity (e.g., credit institutions) to explain its credit risk management practices, including how they relate to the recognition and measurement of expected credit losses, how credit risk increases are determined, and how instruments are grouped for ECL measurement. Both focus on the methodological aspects and disclosure/explanation of ECL calculation under IFRS 9.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}