{
  "summary": "The EBA Guidelines (EBA-GL-2017-06) specify that their scope is limited to lending exposures, which are defined further in paragraph 15, and explicitly states that it does not apply to debt securities. In contrast, CELEX_32023R1803_EN_TXT, which contains IFRS 9, describes impairment requirements and disclosures for 'financial instruments' broadly, and explicitly includes 'debt securities' within the scope of its credit risk exposure disclosure requirements. This indicates a divergence in the scope concerning debt securities, where the IFRS 9 text includes them within its impairment and disclosure framework, while the EBA guidelines explicitly exclude them from their focus on credit risk management practices and ECL accounting, stating there isn't a strong case to apply to instruments beyond BCBS guidance (i.e. debt securities).",
  "overlaps": [],
  "contradictions": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_70.json",
      "excerpt1": "The EBA does not consider that there is a sufficiently strong case to develop material that would apply to instruments beyond the scope of the BCBS guidance, i.e. debt securities.",
      "pageNumber1": 70,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_502.json",
      "excerpt2": "35M To enable users of financial statements to assess an entity's credit risk exposure and understand its significant credit risk concentrations, an entity shall disclose, by credit risk rating grades, the gross carrying amount of financial assets and the exposure to credit risk on loan commitments and financial guarantee contracts. This information shall be provided separately for financial instruments: (a) for which the loss allowance is measured at an amount equal to 12-month expected credit losses; (b) for which the loss allowance is measured at an amount equal to lifetime expected credit losses and that are: (i) financial instruments for which credit risk has increased significantly since initial recognition but that are not credit-impaired financial assets; (ii) financial assets that are credit-impaired at the reporting date (but that are not purchased or originated credit-impaired); and (iii) trade receivables, contract assets or lease receivables for which the loss allowances are measured in accordance with paragraph 5.5.15 of IFRS 9. (c) that are purchased or originated credit-impaired financial assets. 35N For trade receivables, contract assets and lease receivables to which an entity applies paragraph 5.5.15 of IFRS 9, the information provided in accordance with paragraph 35M may be based on a provision matrix (see paragraph B5.5.35 of IFRS 9). 36 For all financial instruments within the scope of this IFRS, but to which the impairment requirements in IFRS 9 are not applied, an entity shall disclose by class of financial instrument: (a) the amount that best represents its maximum exposure to credit risk at the end of the reporting period without taking account of any collateral held or other credit enhancements (eg netting agreements that do not qualify for offset in accordance with IAS 32); this disclosure is not required for financial instruments whose carrying amount best represents the maximum exposure to credit risk. (b) a description of collateral held as security and other credit enhancements, and their financial effect (eg quantification of the extent to which collateral and other credit enhancements mitigate credit risk) in respect of the amount that best represents the maximum exposure to credit risk (whether disclosed in accordance with (a) or represented by the carrying amount of a financial instrument). (c) [deleted] (d) [deleted] 37 [Deleted] Collateral and other credit enhancements obtained 38 When an entity obtains financial or non-financial assets during the period by taking possession of collateral it holds as security or calling on other credit enhancements (eg guarantees), and such assets meet the recog- nition criteria in other IFRSs, an entity shall disclose for such assets held at the reporting date: (a) the nature and carrying amount of the assets; and (b) when the assets are not readily convertible into cash, its policies for disposing of such assets or for using them in its operations.",
      "pageNumber2": 502,
      "explanation": "The EBA Guidelines on accounting for expected credit losses (EBA-GL-2017-06) explicitly state that they do not consider it necessary to develop material for instruments beyond lending exposures, specifically excluding 'debt securities' from their scope of focus. However, IFRS 9 (as contained in CELEX_32023R1803_EN_TXT) clearly includes debt securities within the broader category of 'financial instruments' subject to its impairment requirements and credit risk disclosure obligations (see paragraph 35M and 36, also the definition of 'financial assets' implicitly covers debt securities). This creates a contradiction where EBA guidelines, which are specifically on credit risk management and expected credit losses, explicitly exclude debt securities, while IFRS 9, the underlying accounting standard for expected credit losses, explicitly applies its credit risk disclosure requirements to 'debt securities' as a type of financial instrument.",
      "type": "CONTRADICTION"
    }
  ]
}