{
  "summary": "The EBA Guidelines emphasize that credit institutions must define default consistent with their internal credit risk management, guided by Article 178 of Regulation (EU) 575/2013, which includes qualitative 'unlikeliness to pay' criteria and an objective indicator of 'more than 90 days past due'. While Article 178(1)(b) of Regulation (EU) 575/2013 grants competent authorities discretion to allow up to 180 days past due for certain retail and public sector exposures for regulatory purposes, this discretion should not be interpreted as an exemption from the IFRS 9 rebuttable presumption of default at 90 days past due. This means that for accounting purposes under IFRS 9, the 90-day rebuttable presumption generally applies, even if a longer period is allowed for regulatory purposes.",
  "overlaps": [],
  "contradictions": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_37.json",
      "excerpt1": "89. IFRS 9, paragraph B5.5.37, does not define default, but requires credit institutions to define default in a manner consistent with that used for internal credit risk management. IFRS 9, paragraph B5.5.37, also includes a rebuttable presumption that default does not occur later than 90 days past due. When adopting a definition of default for accounting purposes, credit institutions should be guided by the definition used for regulatory purposes provided in Article 178 of Regulation (EU) 575/201329, which includes both: a. a qualitative criterion by which 'the institution considers that the obligor is unlikely to pay its credit obligations to the institution, the parent undertaking or any of its subsidiaries in full, without recourse by the institution to actions such as realising security' ('unlikeliness to pay' events); and b. an objective indicator where 'the obligor is past due more than 90 days on any material credit obligation to the institution, the parent undertaking or any of its subsidiaries', equivalent to the rebuttable presumption in IFRS 9, paragraph B5.5.37. 90. In accordance with Article 178(1) of Regulation (EU) 575/2013, a default event shall be considered to have occurred with regard to a particular obligor when either of the criteria in paragraphs 4(a) and (b) is met, or both are met. In this context, credit institutions should identify default, in accordance with the 'unlikeliness to pay' criterion of the debtor, before the exposure becomes delinquent with the 90-days-past-due criterion. In line with the approach followed for regulatory purposes, the list of elements provided in Article 178(3) of Regulation (EU) 575/2013 as indications of unlikeliness to pay should be implemented in a way that ensures a timely detection of 'unlikeliness to pay' events that precipitate eventual cash shortfalls. As regards the criterion in paragraph 4(b), although for regulatory purposes in the case of retail and public sector entity obligations, for the 90-day figure competent authorities may substitute a figure of up to 180 days for different products, as it considers appropriate to local conditions (see Article 178(1)(b) of Regulation (EU) 575/2013), this possibility should not be read as an exemption from the application of the 90-day rebuttable presumption in IFRS 9, paragraph B5.5.37, for those exposures.",
      "pageNumber1": 37,
      "filename2": "Final Report on Guidelines on default definition (EBA-GL-2016-07).di_page_8.json",
      "excerpt2": "It is consequently proposed that as a general rule all exposures classified as Stage 3, i.e. exposures treated as credit-impaired under IFRS 9, should be treated as defaulted. Only a few exceptions from that rule have been specified and these include: \" exposures where 180 days past due are used instead of 90 days on the basis of the discretion provided in Article 178(1)(b) of the CRR;",
      "pageNumber2": 8,
      "explanation": "Both excerpts address the definition of default, specifically the interaction between the 90-day past due criterion in IFRS 9 and the discretion under CRR Article 178(1)(b) to use up to 180 days for regulatory purposes for certain exposures. Excerpt 1 (EBA-GL-2017-06) explicitly states that the CRR's discretion to use up to 180 days 'should not be read as an exemption from the application of the 90-day rebuttable presumption in IFRS 9, paragraph B5.5.37, for those exposures'. This means that for IFRS 9 accounting purposes, the 90-day presumption stands. In contrast, Excerpt 2 (EBA-GL-2016-07) lists 'exposures where 180 days past due are used instead of 90 days on the basis of the discretion provided in Article 178(1)(b) of the CRR' as an *exception* to the general rule that IFRS 9 Stage 3 (credit-impaired) exposures should be treated as defaulted. This implies that for such exposures, where 180 days is used for regulatory purposes, they *may not* be automatically treated as defaulted under IFRS 9/accounting, which contradicts the first excerpt's insistence on the IFRS 9 90-day rebuttable presumption always applying and not being exempt by the CRR discretion.",
      "type": "CONTRADICTION"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_37.json",
      "excerpt1": "89. IFRS 9, paragraph B5.5.37, does not define default, but requires credit institutions to define default in a manner consistent with that used for internal credit risk management. IFRS 9, paragraph B5.5.37, also includes a rebuttable presumption that default does not occur later than 90 days past due. When adopting a definition of default for accounting purposes, credit institutions should be guided by the definition used for regulatory purposes provided in Article 178 of Regulation (EU) 575/201329, which includes both: a. a qualitative criterion by which 'the institution considers that the obligor is unlikely to pay its credit obligations to the institution, the parent undertaking or any of its subsidiaries in full, without recourse by the institution to actions such as realising security' ('unlikeliness to pay' events); and b. an objective indicator where 'the obligor is past due more than 90 days on any material credit obligation to the institution, the parent undertaking or any of its subsidiaries', equivalent to the rebuttable presumption in IFRS 9, paragraph B5.5.37. 90. In accordance with Article 178(1) of Regulation (EU) 575/2013, a default event shall be considered to have occurred with regard to a particular obligor when either of the criteria in paragraphs 4(a) and (b) is met, or both are met. In this context, credit institutions should identify default, in accordance with the 'unlikeliness to pay' criterion of the debtor, before the exposure becomes delinquent with the 90-days-past-due criterion. In line with the approach followed for regulatory purposes, the list of elements provided in Article 178(3) of Regulation (EU) 575/2013 as indications of unlikeliness to pay should be implemented in a way that ensures a timely detection of 'unlikeliness to pay' events that precipitate eventual cash shortfalls. As regards the criterion in paragraph 4(b), although for regulatory purposes in the case of retail and public sector entity obligations, for the 90-day figure competent authorities may substitute a figure of up to 180 days for different products, as it considers appropriate to local conditions (see Article 178(1)(b) of Regulation (EU) 575/2013), this possibility should not be read as an exemption from the application of the 90-day rebuttable presumption in IFRS 9, paragraph B5.5.37, for those exposures.",
      "pageNumber1": 37,
      "filename2": "Final Report on Guidelines on default definition (EBA-GL-2016-07).di_page_27.json",
      "excerpt2": "39. Where the institution treats an exposure as credit-impaired under IFRS 9, i.e. assigns it to Stage 3 as defined in IFRS 9 Financial Instruments, published by the IASB in July 2014, such exposure should be considered defaulted, except where the exposure has been considered credit-impaired due to the delay in payment and either or both of the following conditions are met: (a) the competent authorities have replaced the 90 days past due with 180 days past due in accordance with point (b) of Article 178(1) of Regulation EU (No) 575/2013 and this longer period is not used for the purpose of recognition of credit-impairment;",
      "pageNumber2": 27,
      "explanation": "Both excerpts deal with the definition of default, specifically the relationship between the 90-day past due presumption under IFRS 9 and the 180-day discretion allowed by CRR Article 178(1)(b). Excerpt 1 (EBA-GL-2017-06) explicitly states that the CRR's allowance for up to 180 days 'should not be read as an exemption from the application of the 90-day rebuttable presumption in IFRS 9, paragraph B5.5.37, for those exposures'. This means the 90-day rule for IFRS 9 accounting generally applies. Excerpt 2 (EBA-GL-2016-07) presents a condition under which an IFRS 9 credit-impaired (Stage 3) exposure, due to delay in payment, *should not* be considered defaulted if 'competent authorities have replaced the 90 days past due with 180 days past due in accordance with point (b) of Article 178(1) of Regulation EU (No) 575/2013 and this longer period is not used for the purpose of recognition of credit-impairment'. This exception implies that if 180 days is used for regulatory purposes, the exposure might not be defaulted for accounting, which directly contradicts the strict application of the IFRS 9 90-day rebuttable presumption stated in Excerpt 1.",
      "type": "CONTRADICTION"
    }
  ]
}