{
  "summary": "The EBA Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06) and the EBA Guidelines on Loan Origination and Monitoring (EBA-GL-2020-06) both provide requirements for credit institutions to assess various factors related to borrowers and collateral to evaluate credit risk and the collectability of cash flows. There is a clear overlap in the general requirement for institutions to consider a borrower's ability to generate cash flow, their leverage, the value of collateral, and the impact of macroeconomic conditions and internal lending policies. The EBA-GL-2020-06 specifically details the assessment of collateral valuation and the borrower's capacity to meet obligations, which aligns closely with the factors listed in EBA-GL-2017-06 for assessing expected credit losses and collectability.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_24.json",
      "excerpt1": "36. With respect to factors related to the character, capacity and capital of borrowers, the terms of lending exposures, and the values of assets pledged as collateral together with other credit risk mitigants that may affect the full collectability of cash flows, a credit institution should (depending on the type of exposure) consider: a. its lending policies and procedures, including its underwriting standards and lending terms, that were in effect upon initial recognition of the borrower's lending exposure, and whether the lending exposure was originated as an exception to this policy. A credit institution's lending policy should include details of its underwriting standards, and guidelines and procedures that drive the credit institution's lending approval process; b. a borrower's sources of recurring income available to meet the scheduled payments; c. a borrower's ability to generate a sufficient cash flow stream over the term of the financial instrument; d. the borrower's overall leverage level and expectations of changes to leverage; e. the incentives or willingness of borrowers to meet their obligations; f. unencumbered assets24 the borrower may pledge as collateral in the market or bilaterally in order to raise funds and expectations of changes to the value of those assets; g. reasonably possible one-off events and recurring behaviour that may affect the borrower's ability to meet contractual obligations; and h. timely evaluations of collateral value and consideration of factors that may impact the future value of collateral (bearing in mind that collateral values directly affect estimates of LGD).",
      "pageNumber1": 24,
      "filename2": "EBA%20GL%202020%2006%20Final%20Report%20on%20GL%20on%20loan%20origination%20and%20monitoring.di_page_41.json",
      "excerpt2": "141. Institutions should assess the borrower's current and future ability to meet the obligations under the loan agreement. Institutions should also analyse the loan application of the borrower in order to ensure that the application is in line with the institution's credit risk appetite, policies, credit-granting criteria, limits and relevant metrics, as well as any relevant macroprudential measures, where applied by the designated macroprudential authority. 142. Institutions should consider that cash flow from the ordinary business activities of the borrower and, when applicable within the purpose of the loan agreement, any proceeds on the sale of the assets are the primary sources of repayment. 143. When assessing the creditworthiness of the borrower, institutions should put emphasis on the borrower's realistic and sustainable future income and future cash flow, and not on available collateral. Collateral by itself should not be a predominant criterion for approving a loan and cannot by itself justify the approval of any loan agreement. Collateral should be considered the institution's second way out in case of default or material deterioration of the risk profile, and not the primary source of repayment, with the exception of when the loan agreement envisages that the repayment of the loan is based on the sale of the property pledged as collateral or liquid collateral provided. 144. When carrying out the creditworthiness assessment, institutions should: a. analyse the financial position and credit risk of the borrower, as set out below; b. analyse the organisational structure, business model and strategy of the borrower, as set out below;",
      "pageNumber2": 41,
      "explanation": "Both excerpts address the assessment of a borrower's capacity to meet obligations and generate cash flow. Excerpt 1 (ECL Guidelines) requires institutions to consider 'a borrower's ability to generate a sufficient cash flow stream over the term of the financial instrument' and 'its lending policies and procedures, including its underwriting standards and lending terms'. Excerpt 2 (Loan Origination Guidelines) states that 'Institutions should assess the borrower's current and future ability to meet the obligations under the loan agreement' and 'should consider that cash flow from the ordinary business activities of the borrower... are the primary sources of repayment', while also mentioning that loan applications should be 'in line with the institution's credit risk appetite, policies, credit-granting criteria'. This demonstrates an overlap in the specific factors institutions must assess regarding borrower capacity and internal policies.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_24.json",
      "excerpt1": "36. With respect to factors related to the character, capacity and capital of borrowers, the terms of lending exposures, and the values of assets pledged as collateral together with other credit risk mitigants that may affect the full collectability of cash flows, a credit institution should (depending on the type of exposure) consider: ... f. unencumbered assets24 the borrower may pledge as collateral in the market or bilaterally in order to raise funds and expectations of changes to the value of those assets; ... h. timely evaluations of collateral value and consideration of factors that may impact the future value of collateral (bearing in mind that collateral values directly affect estimates of LGD).",
      "pageNumber1": 24,
      "filename2": "EBA%20GL%202020%2006%20Final%20Report%20on%20GL%20on%20loan%20origination%20and%20monitoring.di_page_45.json",
      "excerpt2": "163. Institutions should assess any pledged collateral against the requirements for collateral set out in the institution's credit risk appetite, policies and procedures, including the valuation and ownership, and check all relevant documentation (e.g. whether property is registered in appropriate registers). 164. Institutions should assess any guarantees, covenants, negative pledge clauses and debt service agreements that are used for the purposes of risk mitigation. Institutions should also consider if the value of the collateral is in some way correlated with the borrower's business or capacity to generate cash flow.",
      "pageNumber2": 45,
      "explanation": "Both excerpts require institutions to assess collateral. Excerpt 1 mandates 'timely evaluations of collateral value and consideration of factors that may impact the future value of collateral' and considering 'unencumbered assets the borrower may pledge as collateral... and expectations of changes to the value of those assets'. Excerpt 2 states 'Institutions should assess any pledged collateral against the requirements for collateral set out in the institution's credit risk appetite, policies and procedures, including the valuation and ownership' and 'consider if the value of the collateral is in some way correlated with the borrower's business or capacity to generate cash flow'. This is a direct overlap in the requirement for institutions to evaluate collateral value and its impact on credit risk.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_24.json",
      "excerpt1": "37. Where they have the potential to affect the credit institution's ability to recover amounts due, credit institutions should consider factors relating to the credit institution's business model and current and forecasted macroeconomic conditions, including but not limited to: a. competition and legal and regulatory requirements; b. trends in the institution's overall volume of credit;",
      "pageNumber1": 24,
      "filename2": "EBA%20GL%202020%2006%20Final%20Report%20on%20GL%20on%20loan%20origination%20and%20monitoring.di_page_65.json",
      "excerpt2": "274. As part of their ongoing monitoring of credit risk, institutions should consider the following credit quality deterioration signals: a. negative macroeconomic events (including but not limited to economic development, changes in legislation and technological threats to an industry) affecting the future profitability of an industry, a geographical segment, a group of borrowers or an individual corporate borrower, as well as the increased risk of unemployment for groups of individuals; b. known adverse changes in the financial position of borrowers, such as a significant increase in debt levels or significant increases in debt service ratios;",
      "pageNumber2": 65,
      "explanation": "Both excerpts require institutions to consider macroeconomic conditions as a factor in credit risk. Excerpt 1 states 'credit institutions should consider factors relating to the credit institution's business model and current and forecasted macroeconomic conditions'. Excerpt 2 mandates that 'institutions should consider the following credit quality deterioration signals: a. negative macroeconomic events (including but not limited to economic development, changes in legislation and technological threats to an industry) affecting the future profitability of an industry, a geographical segment, a group of borrowers or an individual corporate borrower'. This demonstrates an overlap in the requirement to assess macroeconomic conditions to manage credit risk.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}