{
  "summary": "The comparison identifies several overlaps between the original guidelines on accounting for expected credit losses and various EBA guidelines on loan origination, monitoring, and non-performing exposures. These overlaps primarily concern the criteria and considerations for assessing borrower creditworthiness, collateral valuation, and the management of loan modifications and renegotiations. Both sets of texts emphasize the importance of realistic income assessment over collateral, the need to monitor and manage flexible repayment terms, and the necessity of robust policies for loan modifications and classification to avoid masking credit risk.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_26.json",
      "excerpt1": "40. Senior management should be able to demonstrate that it understands and appropriately considers inherent risks when pricing lending exposures. Credit institutions should take particular care of the following fact patterns, which are potentially indicative of inadequate estimates of ECL: [...] d. for real estate and other asset based financing, lending of amounts equal to or exceeding the value of the financed property or otherwise failing to provide an adequate margin of collateral protection;",
      "pageNumber1": 26,
      "filename2": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_41.json",
      "excerpt2": "143. When assessing the creditworthiness of the borrower, institutions should put emphasis on the borrower's realistic and sustainable future income and future cash flow, and not on available collateral. Collateral by itself should not be a predominant criterion for approving a loan and cannot by itself justify the approval of any loan agreement. Collateral should be considered the institution's second way out in case of default or material deterioration of the risk profile, and not the primary source of repayment, with the exception of when the loan agreement envisages that the repayment of the loan is based on the sale of the property pledged as collateral or liquid collateral provided.",
      "pageNumber2": 41,
      "explanation": "Both excerpts address the proper consideration of collateral in lending decisions. Excerpt 1 warns against 'lending of amounts equal to or exceeding the value of the financed property or otherwise failing to provide an adequate margin of collateral protection' as an indicator of inadequate ECL estimates. Excerpt 2 explicitly states that 'Collateral by itself should not be a predominant criterion for approving a loan' and 'Collateral should be considered the institution's second way out'. Both highlight that collateral should not be the primary basis for lending decisions and its value needs to be carefully assessed relative to the loan amount and repayment capacity.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_26.json",
      "excerpt1": "40. Senior management should be able to demonstrate that it understands and appropriately considers inherent risks when pricing lending exposures. Credit institutions should take particular care of the following fact patterns, which are potentially indicative of inadequate estimates of ECL: [...] c. flexible repayment schedules, including payment vacations, interest-only payments and negative amortisation features;",
      "pageNumber1": 26,
      "filename2": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_66.json",
      "excerpt2": "k. for transactions secured with collateral, a significant worsening of the ratio of their amount to the value of the collateral due to unfavourable developments in the value of the collateral, or no change or an increase in the outstanding amount due to the payment terms established (such as extended principal payment grace periods, rising or flexible instalments, extended terms);",
      "pageNumber2": 66,
      "explanation": "Both excerpts address the risks associated with flexible or extended repayment terms in lending. Excerpt 1 identifies 'flexible repayment schedules, including payment vacations, interest-only payments and negative amortisation features' as potentially indicative of inadequate ECL estimates. Excerpt 2, in the context of early warning indicators, mentions 'no change or an increase in the outstanding amount due to the payment terms established (such as extended principal payment grace periods, rising or flexible instalments, extended terms)' as a sign of credit quality deterioration. Both underscore the need for careful monitoring and risk assessment of such payment structures.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_26.json",
      "excerpt1": "40. Senior management should be able to demonstrate that it understands and appropriately considers inherent risks when pricing lending exposures. Credit institutions should take particular care of the following fact patterns, which are potentially indicative of inadequate estimates of ECL: [...] e. undue increases in modifications of lending exposures due to financial difficulties faced by the borrower25 or renegotiations/modifications of lending exposures for other reasons (such as competitive pressures faced by credit institutions); f. circumvention of the classification and rating requirements, including rescheduling, refinancing or reclassification of lending exposures;",
      "pageNumber1": 26,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_44.json",
      "excerpt2": "152. Exposures should not be identified as forborne when concessions are made to borrowers who are not in financial difficulties. Credit institutions should distinguish, based on a detailed financial assessment, between renegotiations or rollovers granted to borrowers not in financial difficulties and forbearance measures such as concessions granted to borrowers in",
      "pageNumber2": 44,
      "explanation": "Both excerpts deal with the management and classification of loan modifications and renegotiations. Excerpt 1 points to 'undue increases in modifications' and 'circumvention of the classification and rating requirements' as signs of inadequate ECL estimates. Excerpt 2 requires credit institutions to 'distinguish, based on a detailed financial assessment, between renegotiations or rollovers granted to borrowers not in financial difficulties and forbearance measures such as concessions granted to borrowers in' financial difficulties, implying a need for proper classification and assessment of such modifications. Both highlight the risk of modifications masking true credit risk and the need for rigorous processes.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_26.json",
      "excerpt1": "40. Senior management should be able to demonstrate that it understands and appropriately considers inherent risks when pricing lending exposures. Credit institutions should take particular care of the following fact patterns, which are potentially indicative of inadequate estimates of ECL: [...] a. the granting of credit to borrowers based on fragile income streams (that could become non- recurrent upon a downturn) or with no documentation or limited verification of borrower income sources; b. high debt service requirements relative to the borrower's net available expected cash flows;",
      "pageNumber1": 26,
      "filename2": "EBA GL 2020 06 Final Report on GL on loan origination and monitoring.di_page_43.json",
      "excerpt2": "a. both the current and the projected financial position, including balance sheets and capital structure, working capital, income, cash flow and the source of repayment capacity to meet contractual obligations, e.g. debt-servicing capacity, including under possible adverse events (see also sensitivity analysis) - items to be analysed should include but not be limited to free cash flow available for debt servicing of the facility under consideration;",
      "pageNumber2": 43,
      "explanation": "Both excerpts focus on the assessment of a borrower's income and cash flow for repayment capacity. Excerpt 1 identifies 'fragile income streams' and 'high debt service requirements relative to the borrower's net available expected cash flows' as indicative of inadequate ECL estimates. Excerpt 2 mandates institutions to analyze 'current and the projected financial position, including... income, cash flow and the source of repayment capacity to meet contractual obligations, e.g. debt-servicing capacity'. Both texts require a thorough and realistic assessment of the borrower's ability to repay based on their income and cash flow.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_26.json",
      "excerpt1": "41. Credit institutions' accounting policies should address, and their allowance methodology should include, criteria for (a) renegotiations/modifications of lending exposures due to",
      "pageNumber1": 26,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_45.json",
      "excerpt2": "153. Granting new conditions such as a new interest rate more favourable than the rate borrowers with a similar risk profile could obtain may be considered an indication of such a concession when the credit institution determines that the reason for the new rate is the financial difficulties of the borrower. The provision of more favourable new conditions than those practised by the market should not be considered a prerequisite for the identification of concessions and therefore forbearance. In line with Annex V to Commission Implementing Regulation (EU) No 680/2014, when a borrower is in financial difficulties, a change in conditions in line with what other borrowers with a similar risk profile could get from the credit institution should qualify as a concession, including when borrowers are included in public forbearance schemes that are offered by credit institutions. 154. Borrowers may request modifications in the contractual conditions of their loans without facing or being about to face difficulties in meeting their financial commitments. Credit institutions should perform an assessment of the borrower's financial situation when such modifications to contractual conditions have an impact on payment performance.",
      "pageNumber2": 45,
      "explanation": "Both excerpts address the need for clear criteria and assessment procedures regarding renegotiations and modifications of lending exposures. Excerpt 1 states that accounting policies and allowance methodologies should include 'criteria for (a) renegotiations/modifications of lending exposures'. Excerpt 2 provides detailed guidance on identifying concessions (forbearance) in the context of modifications, requiring a 'detailed financial assessment' when borrowers request modifications and clarifying how to distinguish between true forbearance and other renegotiations. Both aim to ensure that such changes are properly assessed and accounted for.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}