{
  "summary": "The EBA Guidelines on credit risk management practices and accounting for expected credit losses (EBA/GL/2017/06) are consistently referenced and applied across various EBA guidelines and the Basel Framework. Several documents reiterate the requirement for credit institutions to follow these guidelines for estimating loss allowances, managing impairments and write-offs for non-performing exposures (NPEs) and forborne exposures (FBEs), defining default, and implementing appropriate credit risk management practices including those related to expected credit losses (ECLs). The Basel Framework also broadly emphasizes sound credit risk management processes and provisioning levels, referencing the BCBS guidance on ECL which the EBA guidelines aim to align with. Specific overlaps were found where other EBA guidelines mandate adherence to the original document's principles or where regulatory frameworks discuss the application of ECL accounting standards for credit risk management and disclosure.",
  "overlaps": [
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_87.json",
      "excerpt1": "Regarding the comments on the level playing field, the EBA acknowledges that the BCBS guidance is more relevant to internationally active banks and that IFRS and US GAAP requirements on ECL are not fully converged. However, as in the BCBS guidance, sections 4.1, 4.2 and 4.4 apply to all credit institutions applying an expected credit loss accounting framework, while section 4.3 is relevant to credit institutions applying IFRS 9. Therefore, these guidelines should provide to some extent a level playing field across those credit institutions applying an expected credit loss accounting framework (such as IFRS or US GAAP) and also across jurisdictions that apply either the EBA guidelines or the BCBS guidance.",
      "pageNumber1": 87,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_48.json",
      "excerpt2": "167. Credit institutions should estimate loss allowances for NPEs and FBEs subject to impairment in accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses. 169. In accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses,37 uncollectability should be recognised in the appropriate period through loss allowances or write-offs. When the credit institution has no reasonable expectation of recovering contractual cash flow of the exposure it should lead to a partial or full write-off of the exposure (IFRS 9.B3.2.16.r).",
      "pageNumber2": 48,
      "explanation": "Excerpt 1 from the original document specifies the scope of the EBA Guidelines on credit risk management practices and accounting for expected credit losses (EBA/GL/2017/06), stating that sections apply to all credit institutions applying an expected credit loss accounting framework. Excerpt 2 from another EBA guideline explicitly mandates credit institutions to estimate loss allowances, recognise uncollectability, and perform write-offs for NPEs and FBEs 'in accordance with' these same EBA Guidelines (EBA/GL/2017/06). This demonstrates a direct and explicit application of the original document's scope and requirements.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_87.json",
      "excerpt1": "Regarding the comments on the level playing field, the EBA acknowledges that the BCBS guidance is more relevant to internationally active banks and that IFRS and US GAAP requirements on ECL are not fully converged. However, as in the BCBS guidance, sections 4.1, 4.2 and 4.4 apply to all credit institutions applying an expected credit loss accounting framework, while section 4.3 is relevant to credit institutions applying IFRS 9. Therefore, these guidelines should provide to some extent a level playing field across those credit institutions applying an expected credit loss accounting framework (such as IFRS or US GAAP) and also across jurisdictions that apply either the EBA guidelines or the BCBS guidance.",
      "pageNumber1": 87,
      "filename2": "BaselFramework.di_page_1787.json",
      "excerpt2": "40.39 Principle 17:41 The supervisor determines that banks have an adequate credit risk management process that considers their risk appetite, risk profile, market conditions, macroeconomic factors and forward-looking information. This includes prudent policies and processes to identify, measure, evaluate, monitor, report and control or mitigate credit risk42 (including counterparty credit risk43) on a timely basis. The full credit life cycle is covered, including credit underwriting, credit evaluation and the ongoing management of the bank's loan and investment portfolios. Footnotes 41 Reference documents: BCBS, High-level considerations on proportionality, July 2022; BCBS, Guidance on credit risk and accounting for expected credit losses, December 2015;",
      "pageNumber2": 1787,
      "explanation": "Excerpt 1 discusses the EBA guidelines' aim to align with BCBS guidance on ECL and apply to institutions using an expected credit loss accounting framework. Excerpt 2, from the Basel Framework, sets out a principle for supervisors to ensure banks have adequate credit risk management processes, explicitly referencing the 'BCBS, Guidance on credit risk and accounting for expected credit losses, December 2015'. This demonstrates an overlap in the fundamental requirement for credit institutions (banks) to implement and for supervisors to oversee credit risk management processes that incorporate expected credit losses, directly linking to the international standards that EBA's guidelines also address.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_87.json",
      "excerpt1": "Regarding the comments on the level playing field, the EBA acknowledges that the BCBS guidance is more relevant to internationally active banks and that IFRS and US GAAP requirements on ECL are not fully converged. However, as in the BCBS guidance, sections 4.1, 4.2 and 4.4 apply to all credit institutions applying an expected credit loss accounting framework, while section 4.3 is relevant to credit institutions applying IFRS 9. Therefore, these guidelines should provide to some extent a level playing field across those credit institutions applying an expected credit loss accounting framework (such as IFRS or US GAAP) and also across jurisdictions that apply either the EBA guidelines or the BCBS guidance.",
      "pageNumber1": 87,
      "filename2": "Final Guidelines on management of non-performing and forborne exposures.di_page_49.json",
      "excerpt2": "174. Credit institutions should adopt, document and adhere to sound policies, procedures and controls for assessing and measuring loss allowances and write-off on NPEs in accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses. Credit institutions should back-test their loss allowance estimations against actual losses. 175. These methodologies should also include policies and procedures on write-offs and recoveries as defined in the EBA Guidelines on credit risk management practices and accounting for expected credit losses. 176. In accordance with the EBA Guidelines on credit risk management practices and accounting for expected credit losses, credit institutions should have in place common processes, systems, tools and data.",
      "pageNumber2": 49,
      "explanation": "The original document (Excerpt 1) defines the scope and application of its guidelines on expected credit losses for credit institutions. Excerpt 2 explicitly requires credit institutions to adopt policies and procedures for assessing loss allowances and write-offs on NPEs 'in accordance with' the EBA Guidelines on credit risk management practices and accounting for expected credit losses. This is a direct and mandatory reference to the original document's requirements, confirming its applicability and specifying the actions to be taken under those guidelines.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_87.json",
      "excerpt1": "Regarding the comments on the level playing field, the EBA acknowledges that the BCBS guidance is more relevant to internationally active banks and that IFRS and US GAAP requirements on ECL are not fully converged. However, as in the BCBS guidance, sections 4.1, 4.2 and 4.4 apply to all credit institutions applying an expected credit loss accounting framework, while section 4.3 is relevant to credit institutions applying IFRS 9. Therefore, these guidelines should provide to some extent a level playing field across those credit institutions applying an expected credit loss accounting framework (such as IFRS or US GAAP) and also across jurisdictions that apply either the EBA guidelines or the BCBS guidance.",
      "pageNumber1": 87,
      "filename2": "CELEX_32023R1803_EN_TXT.di_page_499.json",
      "excerpt2": "35B The credit risk disclosures made in accordance with paragraphs 35F-35N shall enable users of financial statements to understand the effect of credit risk on the amount, timing and uncertainty of future cash flows. To achieve this objective, credit risk disclosures shall provide: (a) information about an entity's credit risk management practices and how they relate to the recognition and measurement of expected credit losses, including the methods, assumptions and information used to measure expected credit losses; (b) quantitative and qualitative information that allows users of financial statements to evaluate the amounts in the financial statements arising from expected credit losses, including changes in the amount of expected credit losses and the reasons for those changes; and (c) information about an entity's credit risk exposure (ie the credit risk inherent in an entity's financial assets and commitments to extend credit) including significant credit risk concentrations. (...) 35F An entity shall explain its credit risk management practices and how they relate to the recognition and measurement of expected credit losses. To meet this objective an entity shall disclose information that enables users of financial statements to understand and evaluate: (a) how an entity determined whether the credit risk of financial instruments has increased significantly since initial recognition, including, if and how: (i) financial instruments are considered to have low credit risk in accordance with paragraph 5.5.10 of IFRS 9, including the classes of financial instruments to which it applies; and (ii) the presumption in paragraph 5.5.11 of IFRS 9, that there have been significant increases in credit risk since initial recognition when financial assets are more than 30 days past due, has been rebutted; (b) an entity's definitions of default, including the reasons for selecting those definitions; (c) how the instruments were grouped if expected credit losses were measured on a collective basis; (d) how an entity determined that financial assets are credit-impaired financial assets; (e) an entity's write-off policy, including the indicators that there is no reasonable expectation of recovery and information about the policy for financial assets that are written-off but are still subject to enforcement activity; and",
      "pageNumber2": 499,
      "explanation": "Excerpt 1 from the EBA guidelines discusses the application of an expected credit loss accounting framework (like IFRS 9) by credit institutions. Excerpt 2 from IFRS 7 (as amended by Regulation EU 2023/1803) directly mandates entities to provide disclosures about their credit risk management practices as they relate to the recognition and measurement of expected credit losses, specifically mentioning IFRS 9 concepts like 'significant increase in credit risk', 'definitions of default', 'credit-impaired financial assets', and 'write-off policy'. This constitutes an overlap because the EBA guidelines provide guidance on these practices, and the IFRS regulation mandates disclosure of how entities implement them under IFRS 9, directly addressing the same regulatory subject matter and functional context of ECL accounting and credit risk management.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_87.json",
      "excerpt1": "Regarding the comments on the level playing field, the EBA acknowledges that the BCBS guidance is more relevant to internationally active banks and that IFRS and US GAAP requirements on ECL are not fully converged. However, as in the BCBS guidance, sections 4.1, 4.2 and 4.4 apply to all credit institutions applying an expected credit loss accounting framework, while section 4.3 is relevant to credit institutions applying IFRS 9. Therefore, these guidelines should provide to some extent a level playing field across those credit institutions applying an expected credit loss accounting framework (such as IFRS or US GAAP) and also across jurisdictions that apply either the EBA guidelines or the BCBS guidance.",
      "pageNumber1": 87,
      "filename2": "BaselFramework.di_page_1520.json",
      "excerpt2": "Footnotes 3 When the accounting framework is IFRS 9, \"impaired exposures\" are those that are considered \"credit-impaired\" in the meaning of IFRS 9 Appendix A. When the accounting framework is US GAAP, \"impaired exposures\" are those exposures for which credit losses are measured under ASC Topic 326 and for which the bank has recorded a partial write-off/writedown. 4 Please refer to paragraph 33 of the Guidelines, where it is stated: \"these value adjustments and provisions refer to both the allowance for credit losses and direct reductions of the outstanding of an exposure to reflect a decline in the counterparty's creditworthiness\".",
      "pageNumber2": 1520,
      "explanation": "Excerpt 1 discusses the application of EBA guidelines to credit institutions applying expected credit loss frameworks such as IFRS or US GAAP. Excerpt 2 from the Basel Framework defines 'impaired exposures' specifically in the context of IFRS 9 and US GAAP for banks, directly linking to how credit losses (including ECLs) are measured and recognized under these accounting standards. This demonstrates an overlap in addressing the treatment of credit-impaired exposures under the same accounting frameworks that the EBA guidelines cover.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_87.json",
      "excerpt1": "Regarding the comments on the level playing field, the EBA acknowledges that the BCBS guidance is more relevant to internationally active banks and that IFRS and US GAAP requirements on ECL are not fully converged. However, as in the BCBS guidance, sections 4.1, 4.2 and 4.4 apply to all credit institutions applying an expected credit loss accounting framework, while section 4.3 is relevant to credit institutions applying IFRS 9. Therefore, these guidelines should provide to some extent a level playing field across those credit institutions applying an expected credit loss accounting framework (such as IFRS or US GAAP) and also across jurisdictions that apply either the EBA guidelines or the BCBS guidance.",
      "pageNumber1": 87,
      "filename2": "Final Report on Guidelines on default definition (EBA-GL-2016-07).di_page_8.json",
      "excerpt2": "It is expected that by the time of implementation of these guidelines many institutions will already apply IRFS 9 instead of current accounting standards. Since these new rules are significantly different from the currently used IAS 39 and introduce the concept of expected credit losses, which is new in the accounting framework, the EBA considers it necessary to specify the treatment of provisions under IFRS 9 - despite those rules not having entered into effect. It is consequently proposed that as a general rule all exposures classified as Stage 3, i.e. exposures treated as credit-impaired under IFRS 9, should be treated as defaulted. Only a few exceptions from that rule have been specified and these include: \" exposures where 180 days past due are used instead of 90 days on the basis of the discretion provided in Article 178(1)(b) of the CRR; \" the application of the materiality threshold in accordance with Article 178(2)(d) of the CRR where it is not used for the purpose of classification of exposures to Stage 3; \" technical past due situations; \" exposures to central governments, local authorities and public sector entities that are under specific treatment as described above. If in the cases listed above the 90 days past due criterion is used for accounting purposes and credit- impaired status would be the only indication of default, such exposures may remain in non-defaulted status. These exemptions are necessary in order to make sure that the treatment of SCRA under",
      "pageNumber2": 8,
      "explanation": "Excerpt 1 discusses the EBA guidelines' relevance to credit institutions applying IFRS 9 for ECL. Excerpt 2 explicitly states the EBA's position on the treatment of provisions under IFRS 9 for defining default, particularly that 'all exposures classified as Stage 3, i.e. exposures treated as credit-impaired under IFRS 9, should be treated as defaulted'. This shows a direct overlap as both documents address the application and interpretation of IFRS 9 and expected credit losses in the context of credit risk management and regulatory requirements for credit institutions.",
      "type": "OVERLAP"
    },
    {
      "filename1": "Final Guidelines on Accounting for Expected Credit Losses (EBA-GL-2017-06).di_page_87.json",
      "excerpt1": "Regarding the comments on the level playing field, the EBA acknowledges that the BCBS guidance is more relevant to internationally active banks and that IFRS and US GAAP requirements on ECL are not fully converged. However, as in the BCBS guidance, sections 4.1, 4.2 and 4.4 apply to all credit institutions applying an expected credit loss accounting framework, while section 4.3 is relevant to credit institutions applying IFRS 9. Therefore, these guidelines should provide to some extent a level playing field across those credit institutions applying an expected credit loss accounting framework (such as IFRS or US GAAP) and also across jurisdictions that apply either the EBA guidelines or the BCBS guidance.",
      "pageNumber1": 87,
      "filename2": "2018_04.m3_en.di_page_8.json",
      "excerpt2": "· EBA Guidelines on credit institutions' credit risk management practices and accounting for expected credit losses (EBA/GL/2017/06)",
      "pageNumber2": 8,
      "explanation": "Excerpt 1 from the original EBA document outlines the scope and application of the 'EBA Guidelines on credit institutions' credit risk management practices and accounting for expected credit losses (EBA/GL/2017/06)'. Excerpt 2 is a direct reference and listing of these exact guidelines in an official document ('Regulations and guidelines 4/2018' from FIN-FSA) under 'International recommendations'. This explicitly confirms the relevance and acknowledgement of the original document within broader regulatory frameworks, highlighting its foundational role in credit institutions' practices.",
      "type": "OVERLAP"
    }
  ],
  "contradictions": []
}